#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AutoCoverFeatureTemplate

#include "Basic.hpp"

#include "PopLeftRight_structs.hpp"
#include "Full_structs.hpp"
#include "KytheraPlugin_classes.hpp"
#include "PopUp_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass AutoCoverFeatureTemplate.AutoCoverFeatureTemplate_C
// 0x0048 (0x0098 - 0x0050)
class UAutoCoverFeatureTemplate_C final : public UKytAutoCoverFeature
{
public:
	struct FPopLeftRight                          PopLeft;                                           // 0x0050(0x0014)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPopLeftRight                          PopRight;                                          // 0x0064(0x0014)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFull                                  Full;                                              // 0x0078(0x0010)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPopUp                                 PopUp;                                             // 0x0088(0x0010)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AutoCoverFeatureTemplate_C">();
	}
	static class UAutoCoverFeatureTemplate_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAutoCoverFeatureTemplate_C>();
	}
};
static_assert(alignof(UAutoCoverFeatureTemplate_C) == 0x000008, "Wrong alignment on UAutoCoverFeatureTemplate_C");
static_assert(sizeof(UAutoCoverFeatureTemplate_C) == 0x000098, "Wrong size on UAutoCoverFeatureTemplate_C");
static_assert(offsetof(UAutoCoverFeatureTemplate_C, PopLeft) == 0x000050, "Member 'UAutoCoverFeatureTemplate_C::PopLeft' has a wrong offset!");
static_assert(offsetof(UAutoCoverFeatureTemplate_C, PopRight) == 0x000064, "Member 'UAutoCoverFeatureTemplate_C::PopRight' has a wrong offset!");
static_assert(offsetof(UAutoCoverFeatureTemplate_C, Full) == 0x000078, "Member 'UAutoCoverFeatureTemplate_C::Full' has a wrong offset!");
static_assert(offsetof(UAutoCoverFeatureTemplate_C, PopUp) == 0x000088, "Member 'UAutoCoverFeatureTemplate_C::PopUp' has a wrong offset!");

}

