#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CE_ListObj_InvItem

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ModKit_structs.hpp"


namespace SDK::Params
{

// Function BP_CE_ListObj_InvItem.BP_CE_ListObj_InvItem_C.InitDefaultBuild
// 0x00C0 (0x00C0 - 0x0000)
struct BP_CE_ListObj_InvItem_C_InitDefaultBuild final
{
public:
	struct FPrimaryAssetId                        InInvItemAssetId;                                  // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FUInt64                                InModId;                                           // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	class UVaRestJsonObject*                      InJSonObj;                                         // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsModIDForModOrStaging_ReturnValue;       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_GetInvItemTags_ReturnValue;               // 0x0028(0x0020)()
	TSoftObjectPtr<class UObject>                 CallFunc_GetARSSoftObjectPtrFromPrimaryAsset_OutSoftObjectPtr; // 0x0048(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_GetARSSoftObjectPtrFromPrimaryAsset_ReturnValue; // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_PrimaryAssetIdToString_ReturnValue;  // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0088(0x0018)()
	class FText                                   CallFunc_GetARSTextFromPrimaryAsset_OutText;       // 0x00A0(0x0018)()
	bool                                          CallFunc_GetARSTextFromPrimaryAsset_ReturnValue;   // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CE_ListObj_InvItem_C_InitDefaultBuild) == 0x000008, "Wrong alignment on BP_CE_ListObj_InvItem_C_InitDefaultBuild");
static_assert(sizeof(BP_CE_ListObj_InvItem_C_InitDefaultBuild) == 0x0000C0, "Wrong size on BP_CE_ListObj_InvItem_C_InitDefaultBuild");
static_assert(offsetof(BP_CE_ListObj_InvItem_C_InitDefaultBuild, InInvItemAssetId) == 0x000000, "Member 'BP_CE_ListObj_InvItem_C_InitDefaultBuild::InInvItemAssetId' has a wrong offset!");
static_assert(offsetof(BP_CE_ListObj_InvItem_C_InitDefaultBuild, InModId) == 0x000010, "Member 'BP_CE_ListObj_InvItem_C_InitDefaultBuild::InModId' has a wrong offset!");
static_assert(offsetof(BP_CE_ListObj_InvItem_C_InitDefaultBuild, InJSonObj) == 0x000018, "Member 'BP_CE_ListObj_InvItem_C_InitDefaultBuild::InJSonObj' has a wrong offset!");
static_assert(offsetof(BP_CE_ListObj_InvItem_C_InitDefaultBuild, CallFunc_IsModIDForModOrStaging_ReturnValue) == 0x000020, "Member 'BP_CE_ListObj_InvItem_C_InitDefaultBuild::CallFunc_IsModIDForModOrStaging_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CE_ListObj_InvItem_C_InitDefaultBuild, CallFunc_GetInvItemTags_ReturnValue) == 0x000028, "Member 'BP_CE_ListObj_InvItem_C_InitDefaultBuild::CallFunc_GetInvItemTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CE_ListObj_InvItem_C_InitDefaultBuild, CallFunc_GetARSSoftObjectPtrFromPrimaryAsset_OutSoftObjectPtr) == 0x000048, "Member 'BP_CE_ListObj_InvItem_C_InitDefaultBuild::CallFunc_GetARSSoftObjectPtrFromPrimaryAsset_OutSoftObjectPtr' has a wrong offset!");
static_assert(offsetof(BP_CE_ListObj_InvItem_C_InitDefaultBuild, CallFunc_GetARSSoftObjectPtrFromPrimaryAsset_ReturnValue) == 0x000070, "Member 'BP_CE_ListObj_InvItem_C_InitDefaultBuild::CallFunc_GetARSSoftObjectPtrFromPrimaryAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CE_ListObj_InvItem_C_InitDefaultBuild, CallFunc_Conv_PrimaryAssetIdToString_ReturnValue) == 0x000078, "Member 'BP_CE_ListObj_InvItem_C_InitDefaultBuild::CallFunc_Conv_PrimaryAssetIdToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CE_ListObj_InvItem_C_InitDefaultBuild, CallFunc_Conv_StringToText_ReturnValue) == 0x000088, "Member 'BP_CE_ListObj_InvItem_C_InitDefaultBuild::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CE_ListObj_InvItem_C_InitDefaultBuild, CallFunc_GetARSTextFromPrimaryAsset_OutText) == 0x0000A0, "Member 'BP_CE_ListObj_InvItem_C_InitDefaultBuild::CallFunc_GetARSTextFromPrimaryAsset_OutText' has a wrong offset!");
static_assert(offsetof(BP_CE_ListObj_InvItem_C_InitDefaultBuild, CallFunc_GetARSTextFromPrimaryAsset_ReturnValue) == 0x0000B8, "Member 'BP_CE_ListObj_InvItem_C_InitDefaultBuild::CallFunc_GetARSTextFromPrimaryAsset_ReturnValue' has a wrong offset!");

// Function BP_CE_ListObj_InvItem.BP_CE_ListObj_InvItem_C.InitCustomBuild
// 0x0090 (0x0090 - 0x0000)
struct BP_CE_ListObj_InvItem_C_InitCustomBuild final
{
public:
	class UVaRestJsonObject*                      InJSonObj;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 InFilename;                                        // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	struct FUInt64                                CallFunc_GetModIDForPrimaryAssetId_ReturnValue;    // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetBuildNameField_ReturnValue;            // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetStringField_ReturnValue;               // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetItemField_ReturnValue;                 // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0050(0x0018)()
	class FString                                 CallFunc_GetStringField_ReturnValue_1;             // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPrimaryAssetId                        K2Node_MakeStruct_PrimaryAssetId;                  // 0x0080(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CE_ListObj_InvItem_C_InitCustomBuild) == 0x000008, "Wrong alignment on BP_CE_ListObj_InvItem_C_InitCustomBuild");
static_assert(sizeof(BP_CE_ListObj_InvItem_C_InitCustomBuild) == 0x000090, "Wrong size on BP_CE_ListObj_InvItem_C_InitCustomBuild");
static_assert(offsetof(BP_CE_ListObj_InvItem_C_InitCustomBuild, InJSonObj) == 0x000000, "Member 'BP_CE_ListObj_InvItem_C_InitCustomBuild::InJSonObj' has a wrong offset!");
static_assert(offsetof(BP_CE_ListObj_InvItem_C_InitCustomBuild, InFilename) == 0x000008, "Member 'BP_CE_ListObj_InvItem_C_InitCustomBuild::InFilename' has a wrong offset!");
static_assert(offsetof(BP_CE_ListObj_InvItem_C_InitCustomBuild, CallFunc_GetModIDForPrimaryAssetId_ReturnValue) == 0x000018, "Member 'BP_CE_ListObj_InvItem_C_InitCustomBuild::CallFunc_GetModIDForPrimaryAssetId_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CE_ListObj_InvItem_C_InitCustomBuild, CallFunc_GetBuildNameField_ReturnValue) == 0x000020, "Member 'BP_CE_ListObj_InvItem_C_InitCustomBuild::CallFunc_GetBuildNameField_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CE_ListObj_InvItem_C_InitCustomBuild, CallFunc_GetStringField_ReturnValue) == 0x000030, "Member 'BP_CE_ListObj_InvItem_C_InitCustomBuild::CallFunc_GetStringField_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CE_ListObj_InvItem_C_InitCustomBuild, CallFunc_GetItemField_ReturnValue) == 0x000040, "Member 'BP_CE_ListObj_InvItem_C_InitCustomBuild::CallFunc_GetItemField_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CE_ListObj_InvItem_C_InitCustomBuild, CallFunc_Conv_StringToText_ReturnValue) == 0x000050, "Member 'BP_CE_ListObj_InvItem_C_InitCustomBuild::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CE_ListObj_InvItem_C_InitCustomBuild, CallFunc_GetStringField_ReturnValue_1) == 0x000068, "Member 'BP_CE_ListObj_InvItem_C_InitCustomBuild::CallFunc_GetStringField_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CE_ListObj_InvItem_C_InitCustomBuild, CallFunc_Conv_StringToName_ReturnValue) == 0x000078, "Member 'BP_CE_ListObj_InvItem_C_InitCustomBuild::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CE_ListObj_InvItem_C_InitCustomBuild, K2Node_MakeStruct_PrimaryAssetId) == 0x000080, "Member 'BP_CE_ListObj_InvItem_C_InitCustomBuild::K2Node_MakeStruct_PrimaryAssetId' has a wrong offset!");

// Function BP_CE_ListObj_InvItem.BP_CE_ListObj_InvItem_C.SetCustomBuildGameplayTags
// 0x0020 (0x0020 - 0x0000)
struct BP_CE_ListObj_InvItem_C_SetCustomBuildGameplayTags final
{
public:
	struct FGameplayTagContainer                  GameplayTags_0;                                    // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(BP_CE_ListObj_InvItem_C_SetCustomBuildGameplayTags) == 0x000008, "Wrong alignment on BP_CE_ListObj_InvItem_C_SetCustomBuildGameplayTags");
static_assert(sizeof(BP_CE_ListObj_InvItem_C_SetCustomBuildGameplayTags) == 0x000020, "Wrong size on BP_CE_ListObj_InvItem_C_SetCustomBuildGameplayTags");
static_assert(offsetof(BP_CE_ListObj_InvItem_C_SetCustomBuildGameplayTags, GameplayTags_0) == 0x000000, "Member 'BP_CE_ListObj_InvItem_C_SetCustomBuildGameplayTags::GameplayTags_0' has a wrong offset!");

}

