#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CE_ListObj_InvItem

#include "Basic.hpp"

#include "ModKit_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BP_CE_ListObjBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_CE_ListObj_InvItem.BP_CE_ListObj_InvItem_C
// 0x0080 (0x00E0 - 0x0060)
class UBP_CE_ListObj_InvItem_C final : public UBP_CE_ListObjBase_C
{
public:
	struct FPrimaryAssetId                        InvItemAssetId;                                    // 0x0060(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FUInt64                                ModID;                                             // 0x0070(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UObject>                 Icon;                                              // 0x0078(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<class UBP_CE_ListObj_InvItem_C*>       CustomBuildObjs;                                   // 0x00A0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bShowCustomBuilds;                                 // 0x00B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   DisplayNameTagKey;                                 // 0x00B4(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   IconTagKey;                                        // 0x00BC(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVaRestJsonObject*                      JsonObj;                                           // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Filename;                                          // 0x00D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void InitDefaultBuild(const struct FPrimaryAssetId& InInvItemAssetId, const struct FUInt64& InModId, class UVaRestJsonObject* InJSonObj);
	void InitCustomBuild(class UVaRestJsonObject* InJSonObj, const class FString& InFilename);
	void SetCustomBuildGameplayTags(const struct FGameplayTagContainer& GameplayTags_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_CE_ListObj_InvItem_C">();
	}
	static class UBP_CE_ListObj_InvItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_CE_ListObj_InvItem_C>();
	}
};
static_assert(alignof(UBP_CE_ListObj_InvItem_C) == 0x000008, "Wrong alignment on UBP_CE_ListObj_InvItem_C");
static_assert(sizeof(UBP_CE_ListObj_InvItem_C) == 0x0000E0, "Wrong size on UBP_CE_ListObj_InvItem_C");
static_assert(offsetof(UBP_CE_ListObj_InvItem_C, InvItemAssetId) == 0x000060, "Member 'UBP_CE_ListObj_InvItem_C::InvItemAssetId' has a wrong offset!");
static_assert(offsetof(UBP_CE_ListObj_InvItem_C, ModID) == 0x000070, "Member 'UBP_CE_ListObj_InvItem_C::ModID' has a wrong offset!");
static_assert(offsetof(UBP_CE_ListObj_InvItem_C, Icon) == 0x000078, "Member 'UBP_CE_ListObj_InvItem_C::Icon' has a wrong offset!");
static_assert(offsetof(UBP_CE_ListObj_InvItem_C, CustomBuildObjs) == 0x0000A0, "Member 'UBP_CE_ListObj_InvItem_C::CustomBuildObjs' has a wrong offset!");
static_assert(offsetof(UBP_CE_ListObj_InvItem_C, bShowCustomBuilds) == 0x0000B0, "Member 'UBP_CE_ListObj_InvItem_C::bShowCustomBuilds' has a wrong offset!");
static_assert(offsetof(UBP_CE_ListObj_InvItem_C, DisplayNameTagKey) == 0x0000B4, "Member 'UBP_CE_ListObj_InvItem_C::DisplayNameTagKey' has a wrong offset!");
static_assert(offsetof(UBP_CE_ListObj_InvItem_C, IconTagKey) == 0x0000BC, "Member 'UBP_CE_ListObj_InvItem_C::IconTagKey' has a wrong offset!");
static_assert(offsetof(UBP_CE_ListObj_InvItem_C, JsonObj) == 0x0000C8, "Member 'UBP_CE_ListObj_InvItem_C::JsonObj' has a wrong offset!");
static_assert(offsetof(UBP_CE_ListObj_InvItem_C, Filename) == 0x0000D0, "Member 'UBP_CE_ListObj_InvItem_C::Filename' has a wrong offset!");

}

