#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Grenade_Master

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GroundBranch_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Grenade_Master.BP_Grenade_Master_C
// 0x0038 (0x0498 - 0x0460)
class ABP_Grenade_Master_C : public AGBGrenade
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   PinSMC;                                            // 0x0468(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SpoonSMC;                                          // 0x0470(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   GrenadeSMC;                                        // 0x0478(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         TimeToDetonation;                                  // 0x0480(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_484[0x4];                                      // 0x0484(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 ExplosionClass;                                    // 0x0488(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           TimerHandle_AutoRemoveGrenadeArc;                  // 0x0490(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Grenade_Master(int32 EntryPoint);
	void OnBeingEquipped();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Grenade_Master_C">();
	}
	static class ABP_Grenade_Master_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Grenade_Master_C>();
	}
};
static_assert(alignof(ABP_Grenade_Master_C) == 0x000008, "Wrong alignment on ABP_Grenade_Master_C");
static_assert(sizeof(ABP_Grenade_Master_C) == 0x000498, "Wrong size on ABP_Grenade_Master_C");
static_assert(offsetof(ABP_Grenade_Master_C, UberGraphFrame) == 0x000460, "Member 'ABP_Grenade_Master_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Grenade_Master_C, PinSMC) == 0x000468, "Member 'ABP_Grenade_Master_C::PinSMC' has a wrong offset!");
static_assert(offsetof(ABP_Grenade_Master_C, SpoonSMC) == 0x000470, "Member 'ABP_Grenade_Master_C::SpoonSMC' has a wrong offset!");
static_assert(offsetof(ABP_Grenade_Master_C, GrenadeSMC) == 0x000478, "Member 'ABP_Grenade_Master_C::GrenadeSMC' has a wrong offset!");
static_assert(offsetof(ABP_Grenade_Master_C, TimeToDetonation) == 0x000480, "Member 'ABP_Grenade_Master_C::TimeToDetonation' has a wrong offset!");
static_assert(offsetof(ABP_Grenade_Master_C, ExplosionClass) == 0x000488, "Member 'ABP_Grenade_Master_C::ExplosionClass' has a wrong offset!");
static_assert(offsetof(ABP_Grenade_Master_C, TimerHandle_AutoRemoveGrenadeArc) == 0x000490, "Member 'ABP_Grenade_Master_C::TimerHandle_AutoRemoveGrenadeArc' has a wrong offset!");

}

