#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HUD

#include "Basic.hpp"

#include "GroundBranch_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_HUD.BP_HUD_C.ExecuteUbergraph_BP_HUD
// 0x02D8 (0x02D8 - 0x0000)
struct BP_HUD_C_ExecuteUbergraph_BP_HUD final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGBPlayerState*                         K2Node_DynamicCast_AsGBPlayer_State;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   K2Node_Event_HintWidgetClass;                      // 0x0020(0x0028)(ConstParm, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   K2Node_Event_HintName;                             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   CallFunc_Map_Find_Value;                           // 0x0050(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7A[0x2];                                       // 0x007A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_MenuType_1;                           // 0x007C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bTeamChat;                      // 0x0085(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_86[0x2];                                       // 0x0086(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_MenuType;                             // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess_1;                    // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_92[0x6];                                       // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayerController_ReturnValue;    // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGBPlayerController*                    K2Node_DynamicCast_AsGBPlayer_Controller;          // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGBPlayerState*                         K2Node_Event_SenderGBPlayerState;                  // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_Type;                                 // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DisplayTime;                          // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Event_Message;                              // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_Event_PlayerName_1;                         // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ETeamElement                                  K2Node_Event_PlayerTeamElement_1;                  // 0x00E8(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x3];                                       // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_Index;                                // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bImmediate;                           // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AGBInvItem*>                     K2Node_Event_Items;                                // 0x00F8(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Event_MenuName_2;                           // 0x0110(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_Event_MenuName_1;                           // 0x0120(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_Event_MenuName;                             // 0x0130(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_MenuName;                       // 0x0140(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_MenuType;                       // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGBPlayerSettings*                      K2Node_Event_GBPlayerSettings;                     // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGBPlayerState*                         K2Node_DynamicCast_AsGBPlayer_State_1;             // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_181[0x3];                                      // 0x0181(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_Time;                           // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Event_PlayerName;                           // 0x0190(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ETeamElement                                  K2Node_Event_PlayerTeamElement;                    // 0x01A0(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A1[0x7];                                      // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_ReadyRoomPlayerName_C*             CallFunc_GetReadyRoomPlayerNameChecked_ReadyRoomPlayerName; // 0x01A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayerController_ReturnValue_1;  // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGBPlayerController*                    K2Node_DynamicCast_AsGBPlayer_Controller_1;        // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C1[0x3];                                      // 0x01C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AGBPlayerState* PlayerState)> K2Node_CreateDelegate_OutputDelegate;         // 0x01C4(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_1D4[0x4];                                      // 0x01D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_FriendlyPlayer_C*                  CallFunc_GetFriendlyPlayerNameChecked_FriendlytPlayerName; // 0x01D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable;                               // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UObject>                    K2Node_CustomEvent_Loaded;                         // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsUser_Widget;             // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x01F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x01FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1FB[0x5];                                      // 0x01FB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_InGameMenuManager_C*               CallFunc_Create_ReturnValue;                       // 0x0200(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0209(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_20A[0x6];                                      // 0x020A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_ChatOverlay_C*                     CallFunc_Create_ReturnValue_1;                     // 0x0210(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_11;                   // 0x0219(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21A[0x6];                                      // 0x021A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Hint_Manager_C*                    CallFunc_Create_ReturnValue_2;                     // 0x0220(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCameraModifier*                        CallFunc_FindCameraModifierByClass_ReturnValue;    // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_ChatInput_C*                       CallFunc_Create_ReturnValue_3;                     // 0x0238(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDisabled_ReturnValue;                   // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0241(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_12;                   // 0x0242(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_13;                   // 0x0243(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_14;                   // 0x0244(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_15;                   // 0x0245(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_246[0x2];                                      // 0x0246(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_WarningName;                          // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_HUD_C*                             CallFunc_Create_ReturnValue_4;                     // 0x0250(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess_2;                    // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_259[0x7];                                      // 0x0259(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   K2Node_CustomEvent_UserWidgetClass;                // 0x0260(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_16;                   // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_17;                   // 0x0289(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_28A[0x6];                                      // 0x028A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AGBPlayerState*                         K2Node_CustomEvent_PlayerState;                    // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UUserWidget*>                    K2Node_Event_RadialMenuEntries;                    // 0x0298(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	TDelegate<void(TSubclassOf<class UObject> Loaded)> K2Node_CreateDelegate_OutputDelegate_1;       // 0x02A8(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x02B8(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x02C8(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_18;                   // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_HUD_C_ExecuteUbergraph_BP_HUD) == 0x000008, "Wrong alignment on BP_HUD_C_ExecuteUbergraph_BP_HUD");
static_assert(sizeof(BP_HUD_C_ExecuteUbergraph_BP_HUD) == 0x0002D8, "Wrong size on BP_HUD_C_ExecuteUbergraph_BP_HUD");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, EntryPoint) == 0x000000, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_DynamicCast_AsGBPlayer_State) == 0x000010, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_DynamicCast_AsGBPlayer_State' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_HintWidgetClass) == 0x000020, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_HintWidgetClass' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_HintName) == 0x000048, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_HintName' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, CallFunc_Map_Find_Value) == 0x000050, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, CallFunc_Map_Find_ReturnValue) == 0x000078, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, CallFunc_IsValid_ReturnValue_1) == 0x000079, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_MenuType_1) == 0x00007C, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_MenuType_1' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_SwitchName_CmpSuccess) == 0x000084, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_CustomEvent_bTeamChat) == 0x000085, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_CustomEvent_bTeamChat' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_MenuType) == 0x000088, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_MenuType' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_SwitchName_CmpSuccess_1) == 0x000090, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_SwitchName_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, CallFunc_IsValid_ReturnValue_2) == 0x000091, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, CallFunc_GetOwningPlayerController_ReturnValue) == 0x000098, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::CallFunc_GetOwningPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_DynamicCast_AsGBPlayer_Controller) == 0x0000A0, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_DynamicCast_AsGBPlayer_Controller' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_DynamicCast_bSuccess_1) == 0x0000A8, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_SenderGBPlayerState) == 0x0000B0, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_SenderGBPlayerState' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_Type) == 0x0000B8, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_Type' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_DisplayTime) == 0x0000C0, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_DisplayTime' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_Message) == 0x0000C8, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_Message' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_PlayerName_1) == 0x0000D8, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_PlayerName_1' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_PlayerTeamElement_1) == 0x0000E8, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_PlayerTeamElement_1' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_Index) == 0x0000EC, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_Index' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_bImmediate) == 0x0000F0, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_bImmediate' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_Items) == 0x0000F8, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_Items' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, CallFunc_IsValid_ReturnValue_3) == 0x000108, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_MenuName_2) == 0x000110, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_MenuName_2' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_MenuName_1) == 0x000120, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_MenuName_1' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_MenuName) == 0x000130, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_MenuName' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_CustomEvent_MenuName) == 0x000140, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_CustomEvent_MenuName' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_CustomEvent_MenuType) == 0x000150, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_CustomEvent_MenuType' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, CallFunc_IsValid_ReturnValue_4) == 0x000158, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_GBPlayerSettings) == 0x000160, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_GBPlayerSettings' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, CallFunc_GetPlayerController_ReturnValue_1) == 0x000168, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, CallFunc_IsValid_ReturnValue_5) == 0x000170, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_DynamicCast_AsGBPlayer_State_1) == 0x000178, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_DynamicCast_AsGBPlayer_State_1' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_DynamicCast_bSuccess_2) == 0x000180, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_CustomEvent_Time) == 0x000184, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_CustomEvent_Time' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, CallFunc_IsValid_ReturnValue_6) == 0x000188, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_PlayerName) == 0x000190, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_PlayerName' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_PlayerTeamElement) == 0x0001A0, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_PlayerTeamElement' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, CallFunc_GetReadyRoomPlayerNameChecked_ReadyRoomPlayerName) == 0x0001A8, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::CallFunc_GetReadyRoomPlayerNameChecked_ReadyRoomPlayerName' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, CallFunc_GetOwningPlayerController_ReturnValue_1) == 0x0001B0, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::CallFunc_GetOwningPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_DynamicCast_AsGBPlayer_Controller_1) == 0x0001B8, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_DynamicCast_AsGBPlayer_Controller_1' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_DynamicCast_bSuccess_3) == 0x0001C0, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_CreateDelegate_OutputDelegate) == 0x0001C4, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, CallFunc_GetFriendlyPlayerNameChecked_FriendlytPlayerName) == 0x0001D8, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::CallFunc_GetFriendlyPlayerNameChecked_FriendlytPlayerName' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, Temp_class_Variable) == 0x0001E0, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::Temp_class_Variable' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_CustomEvent_Loaded) == 0x0001E8, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_ClassDynamicCast_AsUser_Widget) == 0x0001F0, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_ClassDynamicCast_AsUser_Widget' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_ClassDynamicCast_bSuccess) == 0x0001F8, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, CallFunc_IsValid_ReturnValue_7) == 0x0001F9, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, CallFunc_IsValid_ReturnValue_8) == 0x0001FA, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, CallFunc_Create_ReturnValue) == 0x000200, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, CallFunc_IsValid_ReturnValue_9) == 0x000208, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::CallFunc_IsValid_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, CallFunc_Not_PreBool_ReturnValue) == 0x000209, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, CallFunc_Create_ReturnValue_1) == 0x000210, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, CallFunc_IsValid_ReturnValue_10) == 0x000218, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::CallFunc_IsValid_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, CallFunc_IsValid_ReturnValue_11) == 0x000219, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::CallFunc_IsValid_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, CallFunc_Create_ReturnValue_2) == 0x000220, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::CallFunc_Create_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000228, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, CallFunc_FindCameraModifierByClass_ReturnValue) == 0x000230, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::CallFunc_FindCameraModifierByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, CallFunc_Create_ReturnValue_3) == 0x000238, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::CallFunc_Create_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, CallFunc_IsDisabled_ReturnValue) == 0x000240, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::CallFunc_IsDisabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, CallFunc_Not_PreBool_ReturnValue_1) == 0x000241, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, CallFunc_IsValid_ReturnValue_12) == 0x000242, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::CallFunc_IsValid_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, CallFunc_IsValid_ReturnValue_13) == 0x000243, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::CallFunc_IsValid_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, CallFunc_IsValid_ReturnValue_14) == 0x000244, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::CallFunc_IsValid_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, CallFunc_IsValid_ReturnValue_15) == 0x000245, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::CallFunc_IsValid_ReturnValue_15' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_WarningName) == 0x000248, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_WarningName' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, CallFunc_Create_ReturnValue_4) == 0x000250, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::CallFunc_Create_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_SwitchName_CmpSuccess_2) == 0x000258, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_SwitchName_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_CustomEvent_UserWidgetClass) == 0x000260, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_CustomEvent_UserWidgetClass' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, CallFunc_IsValid_ReturnValue_16) == 0x000288, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::CallFunc_IsValid_ReturnValue_16' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, CallFunc_IsValid_ReturnValue_17) == 0x000289, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::CallFunc_IsValid_ReturnValue_17' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_CustomEvent_PlayerState) == 0x000290, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_CustomEvent_PlayerState' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_RadialMenuEntries) == 0x000298, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_RadialMenuEntries' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_CreateDelegate_OutputDelegate_1) == 0x0002A8, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_CreateDelegate_OutputDelegate_2) == 0x0002B8, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0002C8, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, CallFunc_IsValid_ReturnValue_18) == 0x0002D0, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::CallFunc_IsValid_ReturnValue_18' has a wrong offset!");

// Function BP_HUD.BP_HUD_C.ShowRadialMenuEvent
// 0x0010 (0x0010 - 0x0000)
struct BP_HUD_C_ShowRadialMenuEvent final
{
public:
	TArray<class UUserWidget*>                    RadialMenuEntries;                                 // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(BP_HUD_C_ShowRadialMenuEvent) == 0x000008, "Wrong alignment on BP_HUD_C_ShowRadialMenuEvent");
static_assert(sizeof(BP_HUD_C_ShowRadialMenuEvent) == 0x000010, "Wrong size on BP_HUD_C_ShowRadialMenuEvent");
static_assert(offsetof(BP_HUD_C_ShowRadialMenuEvent, RadialMenuEntries) == 0x000000, "Member 'BP_HUD_C_ShowRadialMenuEvent::RadialMenuEntries' has a wrong offset!");

// Function BP_HUD.BP_HUD_C.OnPlayerReadyRoomStatusChanged_Event_0
// 0x0008 (0x0008 - 0x0000)
struct BP_HUD_C_OnPlayerReadyRoomStatusChanged_Event_0 final
{
public:
	class AGBPlayerState*                         PlayerState;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HUD_C_OnPlayerReadyRoomStatusChanged_Event_0) == 0x000008, "Wrong alignment on BP_HUD_C_OnPlayerReadyRoomStatusChanged_Event_0");
static_assert(sizeof(BP_HUD_C_OnPlayerReadyRoomStatusChanged_Event_0) == 0x000008, "Wrong size on BP_HUD_C_OnPlayerReadyRoomStatusChanged_Event_0");
static_assert(offsetof(BP_HUD_C_OnPlayerReadyRoomStatusChanged_Event_0, PlayerState) == 0x000000, "Member 'BP_HUD_C_OnPlayerReadyRoomStatusChanged_Event_0::PlayerState' has a wrong offset!");

// Function BP_HUD.BP_HUD_C.AddHint
// 0x0028 (0x0028 - 0x0000)
struct BP_HUD_C_AddHint final
{
public:
	TSoftClassPtr<class UClass>                   UserWidgetClass;                                   // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_HUD_C_AddHint) == 0x000008, "Wrong alignment on BP_HUD_C_AddHint");
static_assert(sizeof(BP_HUD_C_AddHint) == 0x000028, "Wrong size on BP_HUD_C_AddHint");
static_assert(offsetof(BP_HUD_C_AddHint, UserWidgetClass) == 0x000000, "Member 'BP_HUD_C_AddHint::UserWidgetClass' has a wrong offset!");

// Function BP_HUD.BP_HUD_C.ShowWarningEvent
// 0x0008 (0x0008 - 0x0000)
struct BP_HUD_C_ShowWarningEvent final
{
public:
	class FName                                   WarningName;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HUD_C_ShowWarningEvent) == 0x000004, "Wrong alignment on BP_HUD_C_ShowWarningEvent");
static_assert(sizeof(BP_HUD_C_ShowWarningEvent) == 0x000008, "Wrong size on BP_HUD_C_ShowWarningEvent");
static_assert(offsetof(BP_HUD_C_ShowWarningEvent, WarningName) == 0x000000, "Member 'BP_HUD_C_ShowWarningEvent::WarningName' has a wrong offset!");

// Function BP_HUD.BP_HUD_C.ShowFriendlyPlayerNameEvent
// 0x0018 (0x0018 - 0x0000)
struct BP_HUD_C_ShowFriendlyPlayerNameEvent final
{
public:
	class FString                                 PlayerName;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ETeamElement                                  PlayerTeamElement;                                 // 0x0010(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HUD_C_ShowFriendlyPlayerNameEvent) == 0x000008, "Wrong alignment on BP_HUD_C_ShowFriendlyPlayerNameEvent");
static_assert(sizeof(BP_HUD_C_ShowFriendlyPlayerNameEvent) == 0x000018, "Wrong size on BP_HUD_C_ShowFriendlyPlayerNameEvent");
static_assert(offsetof(BP_HUD_C_ShowFriendlyPlayerNameEvent, PlayerName) == 0x000000, "Member 'BP_HUD_C_ShowFriendlyPlayerNameEvent::PlayerName' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ShowFriendlyPlayerNameEvent, PlayerTeamElement) == 0x000010, "Member 'BP_HUD_C_ShowFriendlyPlayerNameEvent::PlayerTeamElement' has a wrong offset!");

// Function BP_HUD.BP_HUD_C.DelayedPlayerNameCleanUp
// 0x0004 (0x0004 - 0x0000)
struct BP_HUD_C_DelayedPlayerNameCleanUp final
{
public:
	float                                         Time;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HUD_C_DelayedPlayerNameCleanUp) == 0x000004, "Wrong alignment on BP_HUD_C_DelayedPlayerNameCleanUp");
static_assert(sizeof(BP_HUD_C_DelayedPlayerNameCleanUp) == 0x000004, "Wrong size on BP_HUD_C_DelayedPlayerNameCleanUp");
static_assert(offsetof(BP_HUD_C_DelayedPlayerNameCleanUp, Time) == 0x000000, "Member 'BP_HUD_C_DelayedPlayerNameCleanUp::Time' has a wrong offset!");

// Function BP_HUD.BP_HUD_C.ApplyPlayerSettingsEvent
// 0x0008 (0x0008 - 0x0000)
struct BP_HUD_C_ApplyPlayerSettingsEvent final
{
public:
	class UGBPlayerSettings*                      GBPlayerSettings;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HUD_C_ApplyPlayerSettingsEvent) == 0x000008, "Wrong alignment on BP_HUD_C_ApplyPlayerSettingsEvent");
static_assert(sizeof(BP_HUD_C_ApplyPlayerSettingsEvent) == 0x000008, "Wrong size on BP_HUD_C_ApplyPlayerSettingsEvent");
static_assert(offsetof(BP_HUD_C_ApplyPlayerSettingsEvent, GBPlayerSettings) == 0x000000, "Member 'BP_HUD_C_ApplyPlayerSettingsEvent::GBPlayerSettings' has a wrong offset!");

// Function BP_HUD.BP_HUD_C.InternalOpenUserMenu
// 0x0018 (0x0018 - 0x0000)
struct BP_HUD_C_InternalOpenUserMenu final
{
public:
	class FString                                 MenuName;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FName                                   MenuType;                                          // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HUD_C_InternalOpenUserMenu) == 0x000008, "Wrong alignment on BP_HUD_C_InternalOpenUserMenu");
static_assert(sizeof(BP_HUD_C_InternalOpenUserMenu) == 0x000018, "Wrong size on BP_HUD_C_InternalOpenUserMenu");
static_assert(offsetof(BP_HUD_C_InternalOpenUserMenu, MenuName) == 0x000000, "Member 'BP_HUD_C_InternalOpenUserMenu::MenuName' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_InternalOpenUserMenu, MenuType) == 0x000010, "Member 'BP_HUD_C_InternalOpenUserMenu::MenuType' has a wrong offset!");

// Function BP_HUD.BP_HUD_C.OpenUserMenu
// 0x0010 (0x0010 - 0x0000)
struct BP_HUD_C_OpenUserMenu final
{
public:
	class FString                                 MenuName;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HUD_C_OpenUserMenu) == 0x000008, "Wrong alignment on BP_HUD_C_OpenUserMenu");
static_assert(sizeof(BP_HUD_C_OpenUserMenu) == 0x000010, "Wrong size on BP_HUD_C_OpenUserMenu");
static_assert(offsetof(BP_HUD_C_OpenUserMenu, MenuName) == 0x000000, "Member 'BP_HUD_C_OpenUserMenu::MenuName' has a wrong offset!");

// Function BP_HUD.BP_HUD_C.OpenRadialUserMenu
// 0x0010 (0x0010 - 0x0000)
struct BP_HUD_C_OpenRadialUserMenu final
{
public:
	class FString                                 MenuName;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HUD_C_OpenRadialUserMenu) == 0x000008, "Wrong alignment on BP_HUD_C_OpenRadialUserMenu");
static_assert(sizeof(BP_HUD_C_OpenRadialUserMenu) == 0x000010, "Wrong size on BP_HUD_C_OpenRadialUserMenu");
static_assert(offsetof(BP_HUD_C_OpenRadialUserMenu, MenuName) == 0x000000, "Member 'BP_HUD_C_OpenRadialUserMenu::MenuName' has a wrong offset!");

// Function BP_HUD.BP_HUD_C.OpenLinearUserMenu
// 0x0010 (0x0010 - 0x0000)
struct BP_HUD_C_OpenLinearUserMenu final
{
public:
	class FString                                 MenuName;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HUD_C_OpenLinearUserMenu) == 0x000008, "Wrong alignment on BP_HUD_C_OpenLinearUserMenu");
static_assert(sizeof(BP_HUD_C_OpenLinearUserMenu) == 0x000010, "Wrong size on BP_HUD_C_OpenLinearUserMenu");
static_assert(offsetof(BP_HUD_C_OpenLinearUserMenu, MenuName) == 0x000000, "Member 'BP_HUD_C_OpenLinearUserMenu::MenuName' has a wrong offset!");

// Function BP_HUD.BP_HUD_C.ShowRadialItemsMenuEvent
// 0x0010 (0x0010 - 0x0000)
struct BP_HUD_C_ShowRadialItemsMenuEvent final
{
public:
	TArray<class AGBInvItem*>                     Items;                                             // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BP_HUD_C_ShowRadialItemsMenuEvent) == 0x000008, "Wrong alignment on BP_HUD_C_ShowRadialItemsMenuEvent");
static_assert(sizeof(BP_HUD_C_ShowRadialItemsMenuEvent) == 0x000010, "Wrong size on BP_HUD_C_ShowRadialItemsMenuEvent");
static_assert(offsetof(BP_HUD_C_ShowRadialItemsMenuEvent, Items) == 0x000000, "Member 'BP_HUD_C_ShowRadialItemsMenuEvent::Items' has a wrong offset!");

// Function BP_HUD.BP_HUD_C.OnInventorySlotEvent
// 0x0008 (0x0008 - 0x0000)
struct BP_HUD_C_OnInventorySlotEvent final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bImmediate;                                        // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_HUD_C_OnInventorySlotEvent) == 0x000004, "Wrong alignment on BP_HUD_C_OnInventorySlotEvent");
static_assert(sizeof(BP_HUD_C_OnInventorySlotEvent) == 0x000008, "Wrong size on BP_HUD_C_OnInventorySlotEvent");
static_assert(offsetof(BP_HUD_C_OnInventorySlotEvent, Index_0) == 0x000000, "Member 'BP_HUD_C_OnInventorySlotEvent::Index_0' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_OnInventorySlotEvent, bImmediate) == 0x000004, "Member 'BP_HUD_C_OnInventorySlotEvent::bImmediate' has a wrong offset!");

// Function BP_HUD.BP_HUD_C.ShowReadyRoomPlayerNameEvent
// 0x0018 (0x0018 - 0x0000)
struct BP_HUD_C_ShowReadyRoomPlayerNameEvent final
{
public:
	class FString                                 PlayerName;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ETeamElement                                  PlayerTeamElement;                                 // 0x0010(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HUD_C_ShowReadyRoomPlayerNameEvent) == 0x000008, "Wrong alignment on BP_HUD_C_ShowReadyRoomPlayerNameEvent");
static_assert(sizeof(BP_HUD_C_ShowReadyRoomPlayerNameEvent) == 0x000018, "Wrong size on BP_HUD_C_ShowReadyRoomPlayerNameEvent");
static_assert(offsetof(BP_HUD_C_ShowReadyRoomPlayerNameEvent, PlayerName) == 0x000000, "Member 'BP_HUD_C_ShowReadyRoomPlayerNameEvent::PlayerName' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ShowReadyRoomPlayerNameEvent, PlayerTeamElement) == 0x000010, "Member 'BP_HUD_C_ShowReadyRoomPlayerNameEvent::PlayerTeamElement' has a wrong offset!");

// Function BP_HUD.BP_HUD_C.OnChatLineAddedEvent
// 0x0028 (0x0028 - 0x0000)
struct BP_HUD_C_OnChatLineAddedEvent final
{
public:
	class AGBPlayerState*                         SenderGBPlayerState;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Type;                                              // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DisplayTime;                                       // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Message;                                           // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HUD_C_OnChatLineAddedEvent) == 0x000008, "Wrong alignment on BP_HUD_C_OnChatLineAddedEvent");
static_assert(sizeof(BP_HUD_C_OnChatLineAddedEvent) == 0x000028, "Wrong size on BP_HUD_C_OnChatLineAddedEvent");
static_assert(offsetof(BP_HUD_C_OnChatLineAddedEvent, SenderGBPlayerState) == 0x000000, "Member 'BP_HUD_C_OnChatLineAddedEvent::SenderGBPlayerState' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_OnChatLineAddedEvent, Type) == 0x000008, "Member 'BP_HUD_C_OnChatLineAddedEvent::Type' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_OnChatLineAddedEvent, DisplayTime) == 0x000010, "Member 'BP_HUD_C_OnChatLineAddedEvent::DisplayTime' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_OnChatLineAddedEvent, Message) == 0x000018, "Member 'BP_HUD_C_OnChatLineAddedEvent::Message' has a wrong offset!");

// Function BP_HUD.BP_HUD_C.HideMenuEvent
// 0x0008 (0x0008 - 0x0000)
struct BP_HUD_C_HideMenuEvent final
{
public:
	class FName                                   MenuType;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HUD_C_HideMenuEvent) == 0x000004, "Wrong alignment on BP_HUD_C_HideMenuEvent");
static_assert(sizeof(BP_HUD_C_HideMenuEvent) == 0x000008, "Wrong size on BP_HUD_C_HideMenuEvent");
static_assert(offsetof(BP_HUD_C_HideMenuEvent, MenuType) == 0x000000, "Member 'BP_HUD_C_HideMenuEvent::MenuType' has a wrong offset!");

// Function BP_HUD.BP_HUD_C.ShowChatInput
// 0x0001 (0x0001 - 0x0000)
struct BP_HUD_C_ShowChatInput final
{
public:
	bool                                          bTeamChat;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_HUD_C_ShowChatInput) == 0x000001, "Wrong alignment on BP_HUD_C_ShowChatInput");
static_assert(sizeof(BP_HUD_C_ShowChatInput) == 0x000001, "Wrong size on BP_HUD_C_ShowChatInput");
static_assert(offsetof(BP_HUD_C_ShowChatInput, bTeamChat) == 0x000000, "Member 'BP_HUD_C_ShowChatInput::bTeamChat' has a wrong offset!");

// Function BP_HUD.BP_HUD_C.ShowMenuEvent
// 0x0008 (0x0008 - 0x0000)
struct BP_HUD_C_ShowMenuEvent final
{
public:
	class FName                                   MenuType;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HUD_C_ShowMenuEvent) == 0x000004, "Wrong alignment on BP_HUD_C_ShowMenuEvent");
static_assert(sizeof(BP_HUD_C_ShowMenuEvent) == 0x000008, "Wrong size on BP_HUD_C_ShowMenuEvent");
static_assert(offsetof(BP_HUD_C_ShowMenuEvent, MenuType) == 0x000000, "Member 'BP_HUD_C_ShowMenuEvent::MenuType' has a wrong offset!");

// Function BP_HUD.BP_HUD_C.OnSuggestHintEvent
// 0x0008 (0x0008 - 0x0000)
struct BP_HUD_C_OnSuggestHintEvent final
{
public:
	class FName                                   HintName;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HUD_C_OnSuggestHintEvent) == 0x000004, "Wrong alignment on BP_HUD_C_OnSuggestHintEvent");
static_assert(sizeof(BP_HUD_C_OnSuggestHintEvent) == 0x000008, "Wrong size on BP_HUD_C_OnSuggestHintEvent");
static_assert(offsetof(BP_HUD_C_OnSuggestHintEvent, HintName) == 0x000000, "Member 'BP_HUD_C_OnSuggestHintEvent::HintName' has a wrong offset!");

// Function BP_HUD.BP_HUD_C.OnShowHintEvent
// 0x0028 (0x0028 - 0x0000)
struct BP_HUD_C_OnShowHintEvent final
{
public:
	TSoftClassPtr<class UClass>                   HintWidgetClass;                                   // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(BP_HUD_C_OnShowHintEvent) == 0x000008, "Wrong alignment on BP_HUD_C_OnShowHintEvent");
static_assert(sizeof(BP_HUD_C_OnShowHintEvent) == 0x000028, "Wrong size on BP_HUD_C_OnShowHintEvent");
static_assert(offsetof(BP_HUD_C_OnShowHintEvent, HintWidgetClass) == 0x000000, "Member 'BP_HUD_C_OnShowHintEvent::HintWidgetClass' has a wrong offset!");

// Function BP_HUD.BP_HUD_C.OnLoaded_B00F4E19A9F84D66A6AC71A67BEBA963
// 0x0008 (0x0008 - 0x0000)
struct BP_HUD_C_OnLoaded_B00F4E19A9F84D66A6AC71A67BEBA963 final
{
public:
	TSubclassOf<class UObject>                    Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(BP_HUD_C_OnLoaded_B00F4E19A9F84D66A6AC71A67BEBA963) == 0x000008, "Wrong alignment on BP_HUD_C_OnLoaded_B00F4E19A9F84D66A6AC71A67BEBA963");
static_assert(sizeof(BP_HUD_C_OnLoaded_B00F4E19A9F84D66A6AC71A67BEBA963) == 0x000008, "Wrong size on BP_HUD_C_OnLoaded_B00F4E19A9F84D66A6AC71A67BEBA963");
static_assert(offsetof(BP_HUD_C_OnLoaded_B00F4E19A9F84D66A6AC71A67BEBA963, Loaded) == 0x000000, "Member 'BP_HUD_C_OnLoaded_B00F4E19A9F84D66A6AC71A67BEBA963::Loaded' has a wrong offset!");

// Function BP_HUD.BP_HUD_C.GetReadyRoomPlayerNameChecked
// 0x0018 (0x0018 - 0x0000)
struct BP_HUD_C_GetReadyRoomPlayerNameChecked final
{
public:
	class UWBP_ReadyRoomPlayerName_C*             ReadyRoomPlayerName_0;                             // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_ReadyRoomPlayerName_C*             CallFunc_Create_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HUD_C_GetReadyRoomPlayerNameChecked) == 0x000008, "Wrong alignment on BP_HUD_C_GetReadyRoomPlayerNameChecked");
static_assert(sizeof(BP_HUD_C_GetReadyRoomPlayerNameChecked) == 0x000018, "Wrong size on BP_HUD_C_GetReadyRoomPlayerNameChecked");
static_assert(offsetof(BP_HUD_C_GetReadyRoomPlayerNameChecked, ReadyRoomPlayerName_0) == 0x000000, "Member 'BP_HUD_C_GetReadyRoomPlayerNameChecked::ReadyRoomPlayerName_0' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_GetReadyRoomPlayerNameChecked, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'BP_HUD_C_GetReadyRoomPlayerNameChecked::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_GetReadyRoomPlayerNameChecked, CallFunc_Create_ReturnValue) == 0x000010, "Member 'BP_HUD_C_GetReadyRoomPlayerNameChecked::CallFunc_Create_ReturnValue' has a wrong offset!");

// Function BP_HUD.BP_HUD_C.GetFriendlyPlayerNameChecked
// 0x0018 (0x0018 - 0x0000)
struct BP_HUD_C_GetFriendlyPlayerNameChecked final
{
public:
	class UWBP_FriendlyPlayer_C*                  FriendlytPlayerName;                               // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_FriendlyPlayer_C*                  CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_HUD_C_GetFriendlyPlayerNameChecked) == 0x000008, "Wrong alignment on BP_HUD_C_GetFriendlyPlayerNameChecked");
static_assert(sizeof(BP_HUD_C_GetFriendlyPlayerNameChecked) == 0x000018, "Wrong size on BP_HUD_C_GetFriendlyPlayerNameChecked");
static_assert(offsetof(BP_HUD_C_GetFriendlyPlayerNameChecked, FriendlytPlayerName) == 0x000000, "Member 'BP_HUD_C_GetFriendlyPlayerNameChecked::FriendlytPlayerName' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_GetFriendlyPlayerNameChecked, CallFunc_Create_ReturnValue) == 0x000008, "Member 'BP_HUD_C_GetFriendlyPlayerNameChecked::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_GetFriendlyPlayerNameChecked, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_HUD_C_GetFriendlyPlayerNameChecked::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_HUD.BP_HUD_C.InternalOnChatLineAdded
// 0x0088 (0x0088 - 0x0000)
struct BP_HUD_C_InternalOnChatLineAdded final
{
public:
	class AGBPlayerState*                         InSenderPlayerState;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   InType;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InDisplayTime;                                     // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 InMessage;                                         // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	TArray<class FName>                           LocalEmptyTags;                                    // 0x0028(0x0010)(Edit, BlueprintVisible)
	class FText                                   LocalMessage;                                      // 0x0038(0x0018)(Edit, BlueprintVisible)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0050(0x0018)()
	TArray<class FName>                           K2Node_MakeArray_Array;                            // 0x0068(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
