#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_KytBase

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "KytheraPlugin_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function BP_KytBase.BP_KytBase_C.ExecuteUbergraph_BP_KytBase
// 0x03C0 (0x03C0 - 0x0000)
struct BP_KytBase_C_ExecuteUbergraph_BP_KytBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_3;                   // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_2;                   // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_1;                   // 0x0024(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_1;            // 0x002C(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x003C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_2;            // 0x0044(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   Temp_name_Variable;                                // 0x0054(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x005C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x006C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x007C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x008C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_CheckUseLadder_bLadderFound;              // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDestroyed_ReturnValue;                  // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsOpenedEnoughForAIToUse_ReturnValue;     // 0x009E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x009F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckUseLadder_bLadderFound_1;            // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetOutLocation_Center;                    // 0x00B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckUseDoor_bDoorFound;                  // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGBUseInterface>       CallFunc_ServerUse_self_CastInput;                 // 0x00C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue; // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_4;                   // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x3];                                       // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetCenterLocation_Center;                 // 0x00EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKytAnimRequest                        K2Node_ComponentBoundEvent_AnimParameters;         // 0x00F8(0x0058)()
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0158(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchString_CmpSuccess;                    // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_MakeStruct_GameplayEventData;               // 0x0170(0x00B0)()
	struct FGameplayEventData                     K2Node_MakeStruct_GameplayEventData_1;             // 0x0220(0x00B0)()
	class UAbilityAsync_WaitGameplayTagAdded*     CallFunc_WaitGameplayTagAddToActor_ReturnValue;    // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D9[0x7];                                      // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityAsync_WaitGameplayTagAdded*     CallFunc_WaitGameplayTagAddToActor_ReturnValue_1;  // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_7;            // 0x02E8(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F9[0x7];                                      // 0x02F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityAsync_WaitGameplayTagAdded*     CallFunc_WaitGameplayTagAddToActor_ReturnValue_2;  // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityAsync_WaitGameplayTagRemoved*   CallFunc_WaitGameplayTagRemoveFromActor_ReturnValue; // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0311(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_312[0x6];                                      // 0x0312(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetOverlappingActors_OverlappingActors;   // 0x0318(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_331[0x7];                                      // 0x0331(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_CrouchNavLink_C*                    K2Node_DynamicCast_AsBP_Crouch_Nav_Link;           // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_341[0x3];                                      // 0x0341(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetMoveGoal_MoveGoal;                     // 0x0344(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0350(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x0354(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0358(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue_1;       // 0x0360(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_8;            // 0x0364(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_374[0x4];                                      // 0x0374(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue_1;                // 0x0378(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue_2;       // 0x0380(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue_3;       // 0x0384(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue_2;                // 0x0388(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue_3;                // 0x0390(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AGBKytController*                       K2Node_ComponentBoundEvent_Controller;             // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UKytBlackboard*                         CallFunc_GetCommonBlackboard_ReturnValue;          // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RunBehavior_ReturnValue;                  // 0x03A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A9[0x7];                                      // 0x03A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UKytBlackboard*                         CallFunc_CreateKytBlackboard_ReturnValue;          // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAlive_ReturnValue;                      // 0x03B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_KytBase_C_ExecuteUbergraph_BP_KytBase) == 0x000008, "Wrong alignment on BP_KytBase_C_ExecuteUbergraph_BP_KytBase");
static_assert(sizeof(BP_KytBase_C_ExecuteUbergraph_BP_KytBase) == 0x0003C0, "Wrong size on BP_KytBase_C_ExecuteUbergraph_BP_KytBase");
static_assert(offsetof(BP_KytBase_C_ExecuteUbergraph_BP_KytBase, EntryPoint) == 0x000000, "Member 'BP_KytBase_C_ExecuteUbergraph_BP_KytBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_ExecuteUbergraph_BP_KytBase, K2Node_CustomEvent_NotifyName_3) == 0x000004, "Member 'BP_KytBase_C_ExecuteUbergraph_BP_KytBase::K2Node_CustomEvent_NotifyName_3' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_ExecuteUbergraph_BP_KytBase, K2Node_CustomEvent_NotifyName_2) == 0x00000C, "Member 'BP_KytBase_C_ExecuteUbergraph_BP_KytBase::K2Node_CustomEvent_NotifyName_2' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_ExecuteUbergraph_BP_KytBase, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'BP_KytBase_C_ExecuteUbergraph_BP_KytBase::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_ExecuteUbergraph_BP_KytBase, K2Node_CustomEvent_NotifyName_1) == 0x000024, "Member 'BP_KytBase_C_ExecuteUbergraph_BP_KytBase::K2Node_CustomEvent_NotifyName_1' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_ExecuteUbergraph_BP_KytBase, K2Node_CreateDelegate_OutputDelegate_1) == 0x00002C, "Member 'BP_KytBase_C_ExecuteUbergraph_BP_KytBase::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_ExecuteUbergraph_BP_KytBase, K2Node_CustomEvent_NotifyName) == 0x00003C, "Member 'BP_KytBase_C_ExecuteUbergraph_BP_KytBase::K2Node_CustomEvent_NotifyName' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_ExecuteUbergraph_BP_KytBase, K2Node_CreateDelegate_OutputDelegate_2) == 0x000044, "Member 'BP_KytBase_C_ExecuteUbergraph_BP_KytBase::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_ExecuteUbergraph_BP_KytBase, Temp_name_Variable) == 0x000054, "Member 'BP_KytBase_C_ExecuteUbergraph_BP_KytBase::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_ExecuteUbergraph_BP_KytBase, K2Node_CreateDelegate_OutputDelegate_3) == 0x00005C, "Member 'BP_KytBase_C_ExecuteUbergraph_BP_KytBase::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_ExecuteUbergraph_BP_KytBase, K2Node_CreateDelegate_OutputDelegate_4) == 0x00006C, "Member 'BP_KytBase_C_ExecuteUbergraph_BP_KytBase::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_ExecuteUbergraph_BP_KytBase, K2Node_CreateDelegate_OutputDelegate_5) == 0x00007C, "Member 'BP_KytBase_C_ExecuteUbergraph_BP_KytBase::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_ExecuteUbergraph_BP_KytBase, K2Node_CreateDelegate_OutputDelegate_6) == 0x00008C, "Member 'BP_KytBase_C_ExecuteUbergraph_BP_KytBase::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_ExecuteUbergraph_BP_KytBase, CallFunc_CheckUseLadder_bLadderFound) == 0x00009C, "Member 'BP_KytBase_C_ExecuteUbergraph_BP_KytBase::CallFunc_CheckUseLadder_bLadderFound' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_ExecuteUbergraph_BP_KytBase, CallFunc_IsDestroyed_ReturnValue) == 0x00009D, "Member 'BP_KytBase_C_ExecuteUbergraph_BP_KytBase::CallFunc_IsDestroyed_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_ExecuteUbergraph_BP_KytBase, CallFunc_IsOpenedEnoughForAIToUse_ReturnValue) == 0x00009E, "Member 'BP_KytBase_C_ExecuteUbergraph_BP_KytBase::CallFunc_IsOpenedEnoughForAIToUse_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_ExecuteUbergraph_BP_KytBase, CallFunc_BooleanOR_ReturnValue) == 0x00009F, "Member 'BP_KytBase_C_ExecuteUbergraph_BP_KytBase::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_ExecuteUbergraph_BP_KytBase, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000A0, "Member 'BP_KytBase_C_ExecuteUbergraph_BP_KytBase::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_ExecuteUbergraph_BP_KytBase, CallFunc_CheckUseLadder_bLadderFound_1) == 0x0000AC, "Member 'BP_KytBase_C_ExecuteUbergraph_BP_KytBase::CallFunc_CheckUseLadder_bLadderFound_1' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_ExecuteUbergraph_BP_KytBase, CallFunc_GetOutLocation_Center) == 0x0000B0, "Member 'BP_KytBase_C_ExecuteUbergraph_BP_KytBase::CallFunc_GetOutLocation_Center' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_ExecuteUbergraph_BP_KytBase, CallFunc_Array_Add_ReturnValue) == 0x0000BC, "Member 'BP_KytBase_C_ExecuteUbergraph_BP_KytBase::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_ExecuteUbergraph_BP_KytBase, CallFunc_CheckUseDoor_bDoorFound) == 0x0000C0, "Member 'BP_KytBase_C_ExecuteUbergraph_BP_KytBase::CallFunc_CheckUseDoor_bDoorFound' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_ExecuteUbergraph_BP_KytBase, CallFunc_ServerUse_self_CastInput) == 0x0000C8, "Member 'BP_KytBase_C_ExecuteUbergraph_BP_KytBase::CallFunc_ServerUse_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_ExecuteUbergraph_BP_KytBase, CallFunc_CreateProxyObjectForPlayMontage_ReturnValue) == 0x0000D8, "Member 'BP_KytBase_C_ExecuteUbergraph_BP_KytBase::CallFunc_CreateProxyObjectForPlayMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_ExecuteUbergraph_BP_KytBase, K2Node_CustomEvent_NotifyName_4) == 0x0000E0, "Member 'BP_KytBase_C_ExecuteUbergraph_BP_KytBase::K2Node_CustomEvent_NotifyName_4' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_ExecuteUbergraph_BP_KytBase, CallFunc_IsValid_ReturnValue) == 0x0000E8, "Member 'BP_KytBase_C_ExecuteUbergraph_BP_KytBase::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_ExecuteUbergraph_BP_KytBase, CallFunc_GetCenterLocation_Center) == 0x0000EC, "Member 'BP_KytBase_C_ExecuteUbergraph_BP_KytBase::CallFunc_GetCenterLocation_Center' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_ExecuteUbergraph_BP_KytBase, K2Node_ComponentBoundEvent_AnimParameters) == 0x0000F8, "Member 'BP_KytBase_C_ExecuteUbergraph_BP_KytBase::K2Node_ComponentBoundEvent_AnimParameters' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_ExecuteUbergraph_BP_KytBase, CallFunc_Array_Add_ReturnValue_1) == 0x000150, "Member 'BP_KytBase_C_ExecuteUbergraph_BP_KytBase::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_ExecuteUbergraph_BP_KytBase, CallFunc_Concat_StrStr_ReturnValue) == 0x000158, "Member 'BP_KytBase_C_ExecuteUbergraph_BP_KytBase::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_ExecuteUbergraph_BP_KytBase, K2Node_SwitchString_CmpSuccess) == 0x000168, "Member 'BP_KytBase_C_ExecuteUbergraph_BP_KytBase::K2Node_SwitchString_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_ExecuteUbergraph_BP_KytBase, K2Node_MakeStruct_GameplayEventData) == 0x000170, "Member 'BP_KytBase_C_ExecuteUbergraph_BP_KytBase::K2Node_MakeStruct_GameplayEventData' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_ExecuteUbergraph_BP_KytBase, K2Node_MakeStruct_GameplayEventData_1) == 0x000220, "Member 'BP_KytBase_C_ExecuteUbergraph_BP_KytBase::K2Node_MakeStruct_GameplayEventData_1' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_ExecuteUbergraph_BP_KytBase, CallFunc_WaitGameplayTagAddToActor_ReturnValue) == 0x0002D0, "Member 'BP_KytBase_C_ExecuteUbergraph_BP_KytBase::CallFunc_WaitGameplayTagAddToActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_ExecuteUbergraph_BP_KytBase, CallFunc_IsValid_ReturnValue_1) == 0x0002D8, "Member 'BP_KytBase_C_ExecuteUbergraph_BP_KytBase::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_ExecuteUbergraph_BP_KytBase, CallFunc_WaitGameplayTagAddToActor_ReturnValue_1) == 0x0002E0, "Member 'BP_KytBase_C_ExecuteUbergraph_BP_KytBase::CallFunc_WaitGameplayTagAddToActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_ExecuteUbergraph_BP_KytBase, K2Node_CreateDelegate_OutputDelegate_7) == 0x0002E8, "Member 'BP_KytBase_C_ExecuteUbergraph_BP_KytBase::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_ExecuteUbergraph_BP_KytBase, CallFunc_IsValid_ReturnValue_2) == 0x0002F8, "Member 'BP_KytBase_C_ExecuteUbergraph_BP_KytBase::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_ExecuteUbergraph_BP_KytBase, CallFunc_WaitGameplayTagAddToActor_ReturnValue_2) == 0x000300, "Member 'BP_KytBase_C_ExecuteUbergraph_BP_KytBase::CallFunc_WaitGameplayTagAddToActor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_ExecuteUbergraph_BP_KytBase, CallFunc_WaitGameplayTagRemoveFromActor_ReturnValue) == 0x000308, "Member 'BP_KytBase_C_ExecuteUbergraph_BP_KytBase::CallFunc_WaitGameplayTagRemoveFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_ExecuteUbergraph_BP_KytBase, CallFunc_IsValid_ReturnValue_3) == 0x000310, "Member 'BP_KytBase_C_ExecuteUbergraph_BP_KytBase::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_ExecuteUbergraph_BP_KytBase, CallFunc_IsValid_ReturnValue_4) == 0x000311, "Member 'BP_KytBase_C_ExecuteUbergraph_BP_KytBase::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_ExecuteUbergraph_BP_KytBase, CallFunc_GetOverlappingActors_OverlappingActors) == 0x000318, "Member 'BP_KytBase_C_ExecuteUbergraph_BP_KytBase::CallFunc_GetOverlappingActors_OverlappingActors' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_ExecuteUbergraph_BP_KytBase, CallFunc_Array_Get_Item) == 0x000328, "Member 'BP_KytBase_C_ExecuteUbergraph_BP_KytBase::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_ExecuteUbergraph_BP_KytBase, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000330, "Member 'BP_KytBase_C_ExecuteUbergraph_BP_KytBase::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_ExecuteUbergraph_BP_KytBase, K2Node_DynamicCast_AsBP_Crouch_Nav_Link) == 0x000338, "Member 'BP_KytBase_C_ExecuteUbergraph_BP_KytBase::K2Node_DynamicCast_AsBP_Crouch_Nav_Link' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_ExecuteUbergraph_BP_KytBase, K2Node_DynamicCast_bSuccess) == 0x000340, "Member 'BP_KytBase_C_ExecuteUbergraph_BP_KytBase::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_ExecuteUbergraph_BP_KytBase, CallFunc_GetMoveGoal_MoveGoal) == 0x000344, "Member 'BP_KytBase_C_ExecuteUbergraph_BP_KytBase::CallFunc_GetMoveGoal_MoveGoal' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_ExecuteUbergraph_BP_KytBase, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000350, "Member 'BP_KytBase_C_ExecuteUbergraph_BP_KytBase::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_ExecuteUbergraph_BP_KytBase, CallFunc_Array_Add_ReturnValue_2) == 0x000354, "Member 'BP_KytBase_C_ExecuteUbergraph_BP_KytBase::CallFunc_Array_Add_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_ExecuteUbergraph_BP_KytBase, CallFunc_K2_SetTimer_ReturnValue) == 0x000358, "Member 'BP_KytBase_C_ExecuteUbergraph_BP_KytBase::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_ExecuteUbergraph_BP_KytBase, CallFunc_GetWorldDeltaSeconds_ReturnValue_1) == 0x000360, "Member 'BP_KytBase_C_ExecuteUbergraph_BP_KytBase::CallFunc_GetWorldDeltaSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_ExecuteUbergraph_BP_KytBase, K2Node_CreateDelegate_OutputDelegate_8) == 0x000364, "Member 'BP_KytBase_C_ExecuteUbergraph_BP_KytBase::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_ExecuteUbergraph_BP_KytBase, CallFunc_K2_SetTimer_ReturnValue_1) == 0x000378, "Member 'BP_KytBase_C_ExecuteUbergraph_BP_KytBase::CallFunc_K2_SetTimer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_ExecuteUbergraph_BP_KytBase, CallFunc_GetWorldDeltaSeconds_ReturnValue_2) == 0x000380, "Member 'BP_KytBase_C_ExecuteUbergraph_BP_KytBase::CallFunc_GetWorldDeltaSeconds_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_ExecuteUbergraph_BP_KytBase, CallFunc_GetWorldDeltaSeconds_ReturnValue_3) == 0x000384, "Member 'BP_KytBase_C_ExecuteUbergraph_BP_KytBase::CallFunc_GetWorldDeltaSeconds_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_ExecuteUbergraph_BP_KytBase, CallFunc_K2_SetTimer_ReturnValue_2) == 0x000388, "Member 'BP_KytBase_C_ExecuteUbergraph_BP_KytBase::CallFunc_K2_SetTimer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_ExecuteUbergraph_BP_KytBase, CallFunc_K2_SetTimer_ReturnValue_3) == 0x000390, "Member 'BP_KytBase_C_ExecuteUbergraph_BP_KytBase::CallFunc_K2_SetTimer_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_ExecuteUbergraph_BP_KytBase, K2Node_ComponentBoundEvent_Controller) == 0x000398, "Member 'BP_KytBase_C_ExecuteUbergraph_BP_KytBase::K2Node_ComponentBoundEvent_Controller' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_ExecuteUbergraph_BP_KytBase, CallFunc_GetCommonBlackboard_ReturnValue) == 0x0003A0, "Member 'BP_KytBase_C_ExecuteUbergraph_BP_KytBase::CallFunc_GetCommonBlackboard_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_ExecuteUbergraph_BP_KytBase, CallFunc_RunBehavior_ReturnValue) == 0x0003A8, "Member 'BP_KytBase_C_ExecuteUbergraph_BP_KytBase::CallFunc_RunBehavior_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_ExecuteUbergraph_BP_KytBase, CallFunc_CreateKytBlackboard_ReturnValue) == 0x0003B0, "Member 'BP_KytBase_C_ExecuteUbergraph_BP_KytBase::CallFunc_CreateKytBlackboard_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_ExecuteUbergraph_BP_KytBase, CallFunc_IsAlive_ReturnValue) == 0x0003B8, "Member 'BP_KytBase_C_ExecuteUbergraph_BP_KytBase::CallFunc_IsAlive_ReturnValue' has a wrong offset!");

// Function BP_KytBase.BP_KytBase_C.BndEvt__BP_KytBase_GBAIExtension_K2Node_ComponentBoundEvent_0_AIInitializedSignature__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_KytBase_C_BndEvt__BP_KytBase_GBAIExtension_K2Node_ComponentBoundEvent_0_AIInitializedSignature__DelegateSignature final
{
public:
	class AGBKytController*                       Controller_0;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_KytBase_C_BndEvt__BP_KytBase_GBAIExtension_K2Node_ComponentBoundEvent_0_AIInitializedSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_KytBase_C_BndEvt__BP_KytBase_GBAIExtension_K2Node_ComponentBoundEvent_0_AIInitializedSignature__DelegateSignature");
static_assert(sizeof(BP_KytBase_C_BndEvt__BP_KytBase_GBAIExtension_K2Node_ComponentBoundEvent_0_AIInitializedSignature__DelegateSignature) == 0x000008, "Wrong size on BP_KytBase_C_BndEvt__BP_KytBase_GBAIExtension_K2Node_ComponentBoundEvent_0_AIInitializedSignature__DelegateSignature");
static_assert(offsetof(BP_KytBase_C_BndEvt__BP_KytBase_GBAIExtension_K2Node_ComponentBoundEvent_0_AIInitializedSignature__DelegateSignature, Controller_0) == 0x000000, "Member 'BP_KytBase_C_BndEvt__BP_KytBase_GBAIExtension_K2Node_ComponentBoundEvent_0_AIInitializedSignature__DelegateSignature::Controller_0' has a wrong offset!");

// Function BP_KytBase.BP_KytBase_C.BndEvt__BP_KyBase_KytPathFollowing_K2Node_ComponentBoundEvent_0_KytAnimationEvent__DelegateSignature
// 0x0058 (0x0058 - 0x0000)
struct BP_KytBase_C_BndEvt__BP_KyBase_KytPathFollowing_K2Node_ComponentBoundEvent_0_KytAnimationEvent__DelegateSignature final
{
public:
	struct FKytAnimRequest                        AnimParameters;                                    // 0x0000(0x0058)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(BP_KytBase_C_BndEvt__BP_KyBase_KytPathFollowing_K2Node_ComponentBoundEvent_0_KytAnimationEvent__DelegateSignature) == 0x000008, "Wrong alignment on BP_KytBase_C_BndEvt__BP_KyBase_KytPathFollowing_K2Node_ComponentBoundEvent_0_KytAnimationEvent__DelegateSignature");
static_assert(sizeof(BP_KytBase_C_BndEvt__BP_KyBase_KytPathFollowing_K2Node_ComponentBoundEvent_0_KytAnimationEvent__DelegateSignature) == 0x000058, "Wrong size on BP_KytBase_C_BndEvt__BP_KyBase_KytPathFollowing_K2Node_ComponentBoundEvent_0_KytAnimationEvent__DelegateSignature");
static_assert(offsetof(BP_KytBase_C_BndEvt__BP_KyBase_KytPathFollowing_K2Node_ComponentBoundEvent_0_KytAnimationEvent__DelegateSignature, AnimParameters) == 0x000000, "Member 'BP_KytBase_C_BndEvt__BP_KyBase_KytPathFollowing_K2Node_ComponentBoundEvent_0_KytAnimationEvent__DelegateSignature::AnimParameters' has a wrong offset!");

// Function BP_KytBase.BP_KytBase_C.OnCompleted_57DFBDB84A18F4C71465C2BF15ACDA23
// 0x0008 (0x0008 - 0x0000)
struct BP_KytBase_C_OnCompleted_57DFBDB84A18F4C71465C2BF15ACDA23 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_KytBase_C_OnCompleted_57DFBDB84A18F4C71465C2BF15ACDA23) == 0x000004, "Wrong alignment on BP_KytBase_C_OnCompleted_57DFBDB84A18F4C71465C2BF15ACDA23");
static_assert(sizeof(BP_KytBase_C_OnCompleted_57DFBDB84A18F4C71465C2BF15ACDA23) == 0x000008, "Wrong size on BP_KytBase_C_OnCompleted_57DFBDB84A18F4C71465C2BF15ACDA23");
static_assert(offsetof(BP_KytBase_C_OnCompleted_57DFBDB84A18F4C71465C2BF15ACDA23, NotifyName) == 0x000000, "Member 'BP_KytBase_C_OnCompleted_57DFBDB84A18F4C71465C2BF15ACDA23::NotifyName' has a wrong offset!");

// Function BP_KytBase.BP_KytBase_C.OnBlendOut_57DFBDB84A18F4C71465C2BF15ACDA23
// 0x0008 (0x0008 - 0x0000)
struct BP_KytBase_C_OnBlendOut_57DFBDB84A18F4C71465C2BF15ACDA23 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_KytBase_C_OnBlendOut_57DFBDB84A18F4C71465C2BF15ACDA23) == 0x000004, "Wrong alignment on BP_KytBase_C_OnBlendOut_57DFBDB84A18F4C71465C2BF15ACDA23");
static_assert(sizeof(BP_KytBase_C_OnBlendOut_57DFBDB84A18F4C71465C2BF15ACDA23) == 0x000008, "Wrong size on BP_KytBase_C_OnBlendOut_57DFBDB84A18F4C71465C2BF15ACDA23");
static_assert(offsetof(BP_KytBase_C_OnBlendOut_57DFBDB84A18F4C71465C2BF15ACDA23, NotifyName) == 0x000000, "Member 'BP_KytBase_C_OnBlendOut_57DFBDB84A18F4C71465C2BF15ACDA23::NotifyName' has a wrong offset!");

// Function BP_KytBase.BP_KytBase_C.OnInterrupted_57DFBDB84A18F4C71465C2BF15ACDA23
// 0x0008 (0x0008 - 0x0000)
struct BP_KytBase_C_OnInterrupted_57DFBDB84A18F4C71465C2BF15ACDA23 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_KytBase_C_OnInterrupted_57DFBDB84A18F4C71465C2BF15ACDA23) == 0x000004, "Wrong alignment on BP_KytBase_C_OnInterrupted_57DFBDB84A18F4C71465C2BF15ACDA23");
static_assert(sizeof(BP_KytBase_C_OnInterrupted_57DFBDB84A18F4C71465C2BF15ACDA23) == 0x000008, "Wrong size on BP_KytBase_C_OnInterrupted_57DFBDB84A18F4C71465C2BF15ACDA23");
static_assert(offsetof(BP_KytBase_C_OnInterrupted_57DFBDB84A18F4C71465C2BF15ACDA23, NotifyName) == 0x000000, "Member 'BP_KytBase_C_OnInterrupted_57DFBDB84A18F4C71465C2BF15ACDA23::NotifyName' has a wrong offset!");

// Function BP_KytBase.BP_KytBase_C.OnNotifyBegin_57DFBDB84A18F4C71465C2BF15ACDA23
// 0x0008 (0x0008 - 0x0000)
struct BP_KytBase_C_OnNotifyBegin_57DFBDB84A18F4C71465C2BF15ACDA23 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_KytBase_C_OnNotifyBegin_57DFBDB84A18F4C71465C2BF15ACDA23) == 0x000004, "Wrong alignment on BP_KytBase_C_OnNotifyBegin_57DFBDB84A18F4C71465C2BF15ACDA23");
static_assert(sizeof(BP_KytBase_C_OnNotifyBegin_57DFBDB84A18F4C71465C2BF15ACDA23) == 0x000008, "Wrong size on BP_KytBase_C_OnNotifyBegin_57DFBDB84A18F4C71465C2BF15ACDA23");
static_assert(offsetof(BP_KytBase_C_OnNotifyBegin_57DFBDB84A18F4C71465C2BF15ACDA23, NotifyName) == 0x000000, "Member 'BP_KytBase_C_OnNotifyBegin_57DFBDB84A18F4C71465C2BF15ACDA23::NotifyName' has a wrong offset!");

// Function BP_KytBase.BP_KytBase_C.OnNotifyEnd_57DFBDB84A18F4C71465C2BF15ACDA23
// 0x0008 (0x0008 - 0x0000)
struct BP_KytBase_C_OnNotifyEnd_57DFBDB84A18F4C71465C2BF15ACDA23 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_KytBase_C_OnNotifyEnd_57DFBDB84A18F4C71465C2BF15ACDA23) == 0x000004, "Wrong alignment on BP_KytBase_C_OnNotifyEnd_57DFBDB84A18F4C71465C2BF15ACDA23");
static_assert(sizeof(BP_KytBase_C_OnNotifyEnd_57DFBDB84A18F4C71465C2BF15ACDA23) == 0x000008, "Wrong size on BP_KytBase_C_OnNotifyEnd_57DFBDB84A18F4C71465C2BF15ACDA23");
static_assert(offsetof(BP_KytBase_C_OnNotifyEnd_57DFBDB84A18F4C71465C2BF15ACDA23, NotifyName) == 0x000000, "Member 'BP_KytBase_C_OnNotifyEnd_57DFBDB84A18F4C71465C2BF15ACDA23::NotifyName' has a wrong offset!");

// Function BP_KytBase.BP_KytBase_C.IsAnimationSupported
// 0x0020 (0x0020 - 0x0000)
struct BP_KytBase_C_IsAnimationSupported final
{
public:
	class FString                                 AnimationName;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	const class UKytBlackboard*                   AnimationParameters;                               // 0x0010(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_KytBase_C_IsAnimationSupported) == 0x000008, "Wrong alignment on BP_KytBase_C_IsAnimationSupported");
static_assert(sizeof(BP_KytBase_C_IsAnimationSupported) == 0x000020, "Wrong size on BP_KytBase_C_IsAnimationSupported");
static_assert(offsetof(BP_KytBase_C_IsAnimationSupported, AnimationName) == 0x000000, "Member 'BP_KytBase_C_IsAnimationSupported::AnimationName' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_IsAnimationSupported, AnimationParameters) == 0x000010, "Member 'BP_KytBase_C_IsAnimationSupported::AnimationParameters' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_IsAnimationSupported, ReturnValue) == 0x000018, "Member 'BP_KytBase_C_IsAnimationSupported::ReturnValue' has a wrong offset!");

// Function BP_KytBase.BP_KytBase_C.CheckUseDoor
// 0x0198 (0x0198 - 0x0000)
struct BP_KytBase_C_CheckUseDoor final
{
public:
	bool                                          bDoorFound;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bFoundDoor;                                        // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ConstParm, ReferenceParm)
	TArray<class AActor*>                         K2Node_MakeArray_Array_1;                          // 0x0020(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0054(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FHitResult>                     CallFunc_BoxTraceMultiForObjects_OutHits;          // 0x0060(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_BoxTraceMultiForObjects_ReturnValue;      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_Array_Get_Item;                           // 0x007C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0105(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_106[0x2];                                      // 0x0106(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0110(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x011C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0128(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0134(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0150(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x016C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0178(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_184[0x4];                                      // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_DoorSwinging_Generic_C*             K2Node_DynamicCast_AsBP_Door_Swinging_Generic;     // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_KytBase_C_CheckUseDoor) == 0x000008, "Wrong alignment on BP_KytBase_C_CheckUseDoor");
static_assert(sizeof(BP_KytBase_C_CheckUseDoor) == 0x000198, "Wrong size on BP_KytBase_C_CheckUseDoor");
static_assert(offsetof(BP_KytBase_C_CheckUseDoor, bDoorFound) == 0x000000, "Member 'BP_KytBase_C_CheckUseDoor::bDoorFound' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_CheckUseDoor, bFoundDoor) == 0x000001, "Member 'BP_KytBase_C_CheckUseDoor::bFoundDoor' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_CheckUseDoor, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_KytBase_C_CheckUseDoor::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_CheckUseDoor, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'BP_KytBase_C_CheckUseDoor::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_CheckUseDoor, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_KytBase_C_CheckUseDoor::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_CheckUseDoor, K2Node_MakeArray_Array) == 0x000010, "Member 'BP_KytBase_C_CheckUseDoor::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_CheckUseDoor, K2Node_MakeArray_Array_1) == 0x000020, "Member 'BP_KytBase_C_CheckUseDoor::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_CheckUseDoor, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000030, "Member 'BP_KytBase_C_CheckUseDoor::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_CheckUseDoor, CallFunc_GetActorForwardVector_ReturnValue) == 0x00003C, "Member 'BP_KytBase_C_CheckUseDoor::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_CheckUseDoor, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000048, "Member 'BP_KytBase_C_CheckUseDoor::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_CheckUseDoor, CallFunc_Add_VectorVector_ReturnValue) == 0x000054, "Member 'BP_KytBase_C_CheckUseDoor::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_CheckUseDoor, CallFunc_BoxTraceMultiForObjects_OutHits) == 0x000060, "Member 'BP_KytBase_C_CheckUseDoor::CallFunc_BoxTraceMultiForObjects_OutHits' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_CheckUseDoor, CallFunc_BoxTraceMultiForObjects_ReturnValue) == 0x000070, "Member 'BP_KytBase_C_CheckUseDoor::CallFunc_BoxTraceMultiForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_CheckUseDoor, CallFunc_Array_Length_ReturnValue) == 0x000074, "Member 'BP_KytBase_C_CheckUseDoor::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_CheckUseDoor, CallFunc_Less_IntInt_ReturnValue) == 0x000078, "Member 'BP_KytBase_C_CheckUseDoor::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_CheckUseDoor, CallFunc_Array_Get_Item) == 0x00007C, "Member 'BP_KytBase_C_CheckUseDoor::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_CheckUseDoor, CallFunc_BreakHitResult_bBlockingHit) == 0x000104, "Member 'BP_KytBase_C_CheckUseDoor::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_CheckUseDoor, CallFunc_BreakHitResult_bInitialOverlap) == 0x000105, "Member 'BP_KytBase_C_CheckUseDoor::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_CheckUseDoor, CallFunc_BreakHitResult_Time) == 0x000108, "Member 'BP_KytBase_C_CheckUseDoor::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_CheckUseDoor, CallFunc_BreakHitResult_Distance) == 0x00010C, "Member 'BP_KytBase_C_CheckUseDoor::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_CheckUseDoor, CallFunc_BreakHitResult_Location) == 0x000110, "Member 'BP_KytBase_C_CheckUseDoor::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_CheckUseDoor, CallFunc_BreakHitResult_ImpactPoint) == 0x00011C, "Member 'BP_KytBase_C_CheckUseDoor::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_CheckUseDoor, CallFunc_BreakHitResult_Normal) == 0x000128, "Member 'BP_KytBase_C_CheckUseDoor::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_CheckUseDoor, CallFunc_BreakHitResult_ImpactNormal) == 0x000134, "Member 'BP_KytBase_C_CheckUseDoor::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_CheckUseDoor, CallFunc_BreakHitResult_PhysMat) == 0x000140, "Member 'BP_KytBase_C_CheckUseDoor::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_CheckUseDoor, CallFunc_BreakHitResult_HitActor) == 0x000148, "Member 'BP_KytBase_C_CheckUseDoor::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_CheckUseDoor, CallFunc_BreakHitResult_HitComponent) == 0x000150, "Member 'BP_KytBase_C_CheckUseDoor::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_CheckUseDoor, CallFunc_BreakHitResult_HitBoneName) == 0x000158, "Member 'BP_KytBase_C_CheckUseDoor::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_CheckUseDoor, CallFunc_BreakHitResult_HitItem) == 0x000160, "Member 'BP_KytBase_C_CheckUseDoor::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_CheckUseDoor, CallFunc_BreakHitResult_ElementIndex) == 0x000164, "Member 'BP_KytBase_C_CheckUseDoor::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_CheckUseDoor, CallFunc_BreakHitResult_FaceIndex) == 0x000168, "Member 'BP_KytBase_C_CheckUseDoor::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_CheckUseDoor, CallFunc_BreakHitResult_TraceStart) == 0x00016C, "Member 'BP_KytBase_C_CheckUseDoor::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_CheckUseDoor, CallFunc_BreakHitResult_TraceEnd) == 0x000178, "Member 'BP_KytBase_C_CheckUseDoor::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_CheckUseDoor, K2Node_DynamicCast_AsBP_Door_Swinging_Generic) == 0x000188, "Member 'BP_KytBase_C_CheckUseDoor::K2Node_DynamicCast_AsBP_Door_Swinging_Generic' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_CheckUseDoor, K2Node_DynamicCast_bSuccess) == 0x000190, "Member 'BP_KytBase_C_CheckUseDoor::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_CheckUseDoor, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000191, "Member 'BP_KytBase_C_CheckUseDoor::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function BP_KytBase.BP_KytBase_C.MoveTowards
// 0x0060 (0x0060 - 0x0000)
struct BP_KytBase_C_MoveTowards final
{
public:
	struct FVector                                DirTo;                                             // 0x0000(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_Distance2D_ReturnValue;            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector_X;                            // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0054(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_KytBase_C_MoveTowards) == 0x000004, "Wrong alignment on BP_KytBase_C_MoveTowards");
static_assert(sizeof(BP_KytBase_C_MoveTowards) == 0x000060, "Wrong size on BP_KytBase_C_MoveTowards");
static_assert(offsetof(BP_KytBase_C_MoveTowards, DirTo) == 0x000000, "Member 'BP_KytBase_C_MoveTowards::DirTo' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_MoveTowards, CallFunc_Array_IsValidIndex_ReturnValue) == 0x00000C, "Member 'BP_KytBase_C_MoveTowards::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_MoveTowards, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000010, "Member 'BP_KytBase_C_MoveTowards::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_MoveTowards, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x00001C, "Member 'BP_KytBase_C_MoveTowards::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_MoveTowards, CallFunc_Vector_Distance2D_ReturnValue) == 0x000028, "Member 'BP_KytBase_C_MoveTowards::CallFunc_Vector_Distance2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_MoveTowards, CallFunc_Subtract_VectorVector_ReturnValue) == 0x00002C, "Member 'BP_KytBase_C_MoveTowards::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_MoveTowards, CallFunc_Less_FloatFloat_ReturnValue) == 0x000038, "Member 'BP_KytBase_C_MoveTowards::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_MoveTowards, CallFunc_BreakVector_X) == 0x00003C, "Member 'BP_KytBase_C_MoveTowards::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_MoveTowards, CallFunc_BreakVector_Y) == 0x000040, "Member 'BP_KytBase_C_MoveTowards::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_MoveTowards, CallFunc_BreakVector_Z) == 0x000044, "Member 'BP_KytBase_C_MoveTowards::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_MoveTowards, CallFunc_MakeVector_ReturnValue) == 0x000048, "Member 'BP_KytBase_C_MoveTowards::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KytBase_C_MoveTowards, CallFunc_Normal_ReturnValue) == 0x000054, "Member 'BP_KytBase_C_MoveTowards::CallFunc_Normal_ReturnValue' has a wrong offset!");

// Function BP_KytBase.BP_KytBase_C.CheckUseLadder
// 0x0100 (0x0100 - 0x0000)
struct BP_KytBase_C_CheckUseLadder final
{
public:
	bool                                          bLadderFound;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bFoundLadder;                                      // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0008(0x0010)(ConstParm, ReferenceParm)
	class FText                                   CallFunc_Conv_ObjectToText_ReturnValue;            // 0x0018(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0030(0x0040)(HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0078(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0088(0x0018)()
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array_1;                          // 0x00A8(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_SphereOverlapActors_OutActors;            // 0x00C8(0x0010)(ReferenceParm)
	bool                                          CallFunc_SphereOverlapActors_ReturnValue;          // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
