#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GroundBranch

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "ModKit_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayAbilities_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "GroundBranch_structs.hpp"
#include "Gauntlet_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"
#include "DeveloperSettings_classes.hpp"
#include "PhysicsCore_structs.hpp"
#include "PhysicsCore_classes.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_classes.hpp"
#include "Foliage_classes.hpp"
#include "FMModdingPlugin_structs.hpp"
#include "LuaMachine_classes.hpp"
#include "KytheraPlugin_classes.hpp"
#include "LXR_classes.hpp"
#include "RBHotFoot_classes.hpp"
#include "NavigationSystem_classes.hpp"
#include "PortalSystem_classes.hpp"
#include "SkyCreatorPlugin_classes.hpp"
#include "AkAudio_structs.hpp"
#include "AkAudio_classes.hpp"


namespace SDK
{

// Class GroundBranch.GBInvItem
// 0x0228 (0x0448 - 0x0220)
class AGBInvItem : public AActor
{
public:
	class FName                                   ItemAssetName;                                     // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 DefaultItemBuild;                                  // 0x0228(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, EditConst, AssetRegistrySearchable, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         ItemWeight;                                        // 0x0238(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_23C[0x4];                                      // 0x023C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   DisplayName;                                       // 0x0240(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, AssetRegistrySearchable, Protected, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UTexture2D>              Icon;                                              // 0x0258(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoClear, AssetRegistrySearchable, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  InvItemTags;                                       // 0x0280(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, AssetRegistrySearchable, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  CosmeticTags;                                      // 0x02A0(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, AssetRegistrySearchable, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  RequiredCosmeticTags;                              // 0x02C0(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, AssetRegistrySearchable, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  IncompatibleCosmeticTags;                          // 0x02E0(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, AssetRegistrySearchable, Protected, NativeAccessSpecifierProtected)
	class AGBCharacter*                           GBInstigator;                                      // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UUserWidget>                CustomisationWidget;                               // 0x0308(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<struct FGameplayTag, TSoftClassPtr<class UClass>> DragDropOperations;                       // 0x0310(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, AssetRegistrySearchable, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TSubclassOf<class AGBDroppedInvItem>          DroppedInvItemClass;                               // 0x0360(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   EquippedCollisionProfileName;                      // 0x0368(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   UnequippedCollisionProfileName;                    // 0x0370(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bUnequippedEnableCollision;                        // 0x0378(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_379[0x7];                                      // 0x0379(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class AGBInvItem* ClientsideProxy, class AGBInvItem* Source)> OnReplacingClientsideProxy; // 0x0380(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_390[0x1];                                      // 0x0390(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bAllowKitEncoding;                                 // 0x0391(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_392[0x2];                                      // 0x0392(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         InventorySlot;                                     // 0x0394(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UUserWidget>                InventorySlotWidget;                               // 0x0398(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FPrimaryAssetId                        InvItemSkinId;                                     // 0x03A0(0x0010)(BlueprintVisible, Net, ZeroConstructor, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         BaseRotationalInertiaModifier;                     // 0x03B0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3B4[0x4];                                      // 0x03B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSoftObjectPtr<class UGBGameplayAbilitySet>> GameplayAbilitySets;                         // 0x03B8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TArray<struct FGameplayAbilitySpecHandle>     GameplayAbilitySpecHandles;                        // 0x03C8(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TSoftClassPtr<class UClass>                   AnimLayerClass;                                    // 0x03D8(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<TSoftObjectPtr<class UGBInvItemMontageSet>> CharMontageSets;                              // 0x0400(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TArray<TSoftObjectPtr<class UGBInvItemMontageSet>> MontageSets;                                  // 0x0410(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TArray<TSoftObjectPtr<class UGBInvItemAudioEventSet>> AudioEventSets;                            // 0x0420(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TArray<TSoftObjectPtr<class UGBInvItemEffectSet>> EffectSets;                                    // 0x0430(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	float                                         DecalFadeScreenSize;                               // 0x0440(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_444[0x4];                                      // 0x0444(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class AGBInvItem* SpawnInvItem(TSubclassOf<class AGBInvItem> InvItemClass, class AActor* InvItemOwner);

	void AddAttachedUseMenuEntries(class UUserWidget* UsageMenu);
	void AddedToCharacter(class AGBCharacter* NewParentCharacter);
	void AddedToItem(class AGBInvItem* NewParentItem);
	class UGBItemCameraModifier* AddNewItemCameraModifier(TSubclassOf<class UGBItemCameraModifier> ItemCameraModifierClass);
	void AddToInventory(class AGBCharacter* Character);
	bool AllowUsageWhileAttached();
	void ApplyPlayerSettings(class UGBPlayerSettings* GBPlayerSettings);
	bool BP_AttachItemTo(class USceneComponent* Parent, class FName SocketName, EAttachmentRule LocationRule, EAttachmentRule RotationRule);
	void BP_DetachItemFrom(EDetachmentRule LocationRule, EDetachmentRule RotationRule);
	bool CanAddChild(class AGBInvItem* PotentialChild);
	bool CanAddToCharacter(class AGBCharacter* Character);
	bool CanBeAddedAsChild(class AGBInvItem* PotentialParent);
	void ChangeOwnerOnlyRelevancy(bool bOnlyOwner);
	void CharacterDestroyed(class AActor* DestroyedActor);
	void ClientAddToInventory(class AGBCharacter* Character);
	void ClientForceDestroy();
	void ClientRemoveFromInventory(class AGBCharacter* Character);
	class AGBInvItem* CreateClientsideProxy();
	void CreateMIDs();
	void CreateMIDsEvent();
	bool DecodeKit(class UVaRestJsonObject* ItemAsJson, class AActor* DecodedOwner, class AGBInvItem* DecodedParentItem, const class FName& ProfileName);
	bool DenyDrop();
	bool DenyUnequip();
	class AGBDroppedInvItem* DoDropFrom(const struct FVector& InLocation, const struct FRotator& InRotation, const struct FVector& InVelocity, const struct FVector& InAngularVelocity);
	void EditItemSetup(class AGBCharacter* UICharacter);
	void EncodeKit(class UVaRestJsonObject* ItemAsJson);
	TArray<class AGBInvItem*> FindParentItems(class AGBCharacter* Character);
	void ForceCreateMIDs();
	void ForceLoadGameplayAbilities();
	void ForceLODZero();
	TArray<class AGBInvItem*> GetChildInvItemsOfClass(TSubclassOf<class AGBInvItem> InvItemClass, bool bAllChildren);
	class FName GetEquipMontageSection(EHand TargetHand, const struct FGBChangeEquippedInfo& ChangeEquippedInfo);
	TArray<class UPrimitiveComponent*> GetHiddenComponents();
	bool GetPatchSocketNameMap(class USceneComponent* SceneComp, TMap<class FName, struct FGameplayTag>* OutSocketToPatchNameTagMap);
	void GetPositionAlphaTargets(float TargetEngagedAlpha, float TargetOffTargetAlpha, float* OutTargetEngagedAlpha, float* OutTargetOffTargetAlpha, float* OutOffTargetInterpSpeed);
	void GetStaminaMultipliers(float* RecoveryMultiplier, float* ExhaustionMultiplier);
	TSoftObjectPtr<class UMaterialInterface> GetStaticMeshPatchMaterial();
	class FString GetStatKey();
	struct FGBUnequipInfo GetUnequipInfo(EHand TargetHand);
	class FName GetUnequipMontageSection(EHand TargetHand, const struct FGBChangeEquippedInfo& ChangeEquippedInfo, const struct FGBUnequipInfo& LeftUnequipInfo, const struct FGBUnequipInfo& RightUnequipInfo);
	float GetWeaponsPositionTransitionTime(EGBWeaponPosition FromPosition, EGBWeaponPosition ToPosition);
	void MarkAsClientsideProxy();
	void OnAddedToCharacter(class AGBCharacter* NewParentCharacter);
	void OnAddedToInventoryEvent(class AGBCharacter* Character);
	void OnAddedToItem(class AGBInvItem* NewParentItem);
	void OnAddingChild(class AGBInvItem* AddedChild);
	void OnBeingDropped();
	void OnBeingEquipped();
	void OnBeingUnequipped();
	void OnClientsideProxyCreatedEvent(class AGBInvItem* Proxy);
	void OnCosmeticTagsUpdated(const struct FGameplayTagContainer& InCosmeticTags);
	void OnForceLoadGameplayAbilitiesComplete();
	void OnRemovedFromCharacter(class AGBCharacter* OldParentCharacter, class FName OldSocketName);
	void OnRemovedFromInventoryEvent(class AGBCharacter* Character);
	void OnRemovedFromItem(class AGBInvItem* OldParentItem, class USceneComponent* OldParentComp, class FName OldParentSocket);
	void OnRemovingChild(class AGBInvItem* RemovedChild);
	void OnRep_InvItemSkinId();
	bool OtherTagsSatisfied(const struct FGameplayTagContainer& InCosmeticTags);
	class AGBDroppedInvItem* PlaceAt(const struct FVector& InLocation, const struct FRotator& InRotation);
	void PositionAlphaMet();
	void PositionTransitionBegins();
	bool PostDecode();
	void PreEncodeCheck();
	void Refill();
	void RemovedFromCharacter(class AGBCharacter* OldParentCharacter, const class FName& OldSocketName);
	void RemovedFromItem(class AGBInvItem* OldParentItem, class USceneComponent* OldParentComp, const class FName& OldParentSocket);
	void RemoveFromInventory(class AGBCharacter* Character);
	void RemoveFromSkinnedDecalSampler(class AGBCharacter* Character);
	void RemoveItemCameraModifier(class UGBItemCameraModifier* ItemCameraModifierToRemove);
	void SetInvItemSkinId(const struct FPrimaryAssetId& NewInvItemSkinId);
	void SetupSightComponents();
	void SyncMontageWithOtherItem(class AGBInvItem* OtherItem, class FName MontageName);
	bool TryActivateItemAbilityByTag(const struct FGameplayTag& GameplayTag);
	bool TryActivateItemAbilityByTagWithPayload(const struct FGameplayTag& GameplayTag, const struct FGameplayEventData& Payload);
	void UpdateAudioValues();
	void UpdatePatches();
	void UpdateWetness(float InRadius, const struct FVector& InLocation);
	bool ValidateDecodedItem(class FString* OutFailureReason);

	TSubclassOf<class UAnimInstance> GetAnimLayerClassRef() const;
	class AGBInvItem* GetBaseItem() const;
	class UAnimMontage* GetCharMontage(class FName MontageName) const;
	TArray<class AGBInvItem*> GetChildInvItems(bool bAllChildren) const;
	TArray<class AGBInvItem*> GetChildInvItemsAttachedTo(class USceneComponent* Component, class FName SocketName) const;
	TArray<class AGBInvItem*> GetChildInvItemsWithTags(const struct FGameplayTagContainer& WithTags, bool bExactMatch, bool bAllChildren) const;
	struct FGameplayTagContainer GetCosmeticTags() const;
	class UGBSightComponent* GetCurrentSight() const;
	TSubclassOf<class UUserWidget> GetCustomisationWidget() const;
	class FText GetDisplayName() const;
	TSubclassOf<class UGBInvItemDragDropOperation> GetDragDropOperation(const struct FGameplayTagContainer& DragOpTags) const;
	class UNiagaraSystem* GetEffect(class FName EffectName) const;
	class AGBInvItem* GetFirstChildInvItemAttachedTo(class USceneComponent* Component, class FName SocketName) const;
	class AGBInvItem* GetFirstChildInvItemOfClass(TSubclassOf<class AGBInvItem> InvItemClass, bool bAllChildren) const;
	class AGBInvItem* GetFirstChildInvItemWithTags(const struct FGameplayTagContainer& WithTags, bool bExactMatch, bool bAllChildren) const;
	TArray<struct FGameplayAbilitySpecHandle> GetGameplayAbilitySpecHandles() const;
	class AGBCharacter* GetGBInstigator() const;
	EHand GetHandEnum() const;
	TSoftObjectPtr<class UTexture2D> GetIcon() const;
	int32 GetInventorySlot() const;
	TSubclassOf<class UUserWidget> GetInventorySlotWidget() const;
	struct FPrimaryAssetId GetInvItemSkinId() const;
	struct FGameplayTagContainer GetInvItemTags() const;
	float GetItemWeight() const;
	class UAnimMontage* GetMontage(class FName MontageName) const;
	class AGBInvItem* GetParentItem() const;
	class UAkAudioEvent* GetSound(class FName SoundName) const;
	bool IsClientsideProxy() const;
	bool IsEquipped() const;
	bool UsesGameplayAbilityByClass(TSubclassOf<class UGBGameplayAbility> GameplayAbilityClass) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GBInvItem">();
	}
	static class AGBInvItem* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGBInvItem>();
	}
};
static_assert(alignof(AGBInvItem) == 0x000008, "Wrong alignment on AGBInvItem");
static_assert(sizeof(AGBInvItem) == 0x000448, "Wrong size on AGBInvItem");
static_assert(offsetof(AGBInvItem, ItemAssetName) == 0x000220, "Member 'AGBInvItem::ItemAssetName' has a wrong offset!");
static_assert(offsetof(AGBInvItem, DefaultItemBuild) == 0x000228, "Member 'AGBInvItem::DefaultItemBuild' has a wrong offset!");
static_assert(offsetof(AGBInvItem, ItemWeight) == 0x000238, "Member 'AGBInvItem::ItemWeight' has a wrong offset!");
static_assert(offsetof(AGBInvItem, DisplayName) == 0x000240, "Member 'AGBInvItem::DisplayName' has a wrong offset!");
static_assert(offsetof(AGBInvItem, Icon) == 0x000258, "Member 'AGBInvItem::Icon' has a wrong offset!");
static_assert(offsetof(AGBInvItem, InvItemTags) == 0x000280, "Member 'AGBInvItem::InvItemTags' has a wrong offset!");
static_assert(offsetof(AGBInvItem, CosmeticTags) == 0x0002A0, "Member 'AGBInvItem::CosmeticTags' has a wrong offset!");
static_assert(offsetof(AGBInvItem, RequiredCosmeticTags) == 0x0002C0, "Member 'AGBInvItem::RequiredCosmeticTags' has a wrong offset!");
static_assert(offsetof(AGBInvItem, IncompatibleCosmeticTags) == 0x0002E0, "Member 'AGBInvItem::IncompatibleCosmeticTags' has a wrong offset!");
static_assert(offsetof(AGBInvItem, GBInstigator) == 0x000300, "Member 'AGBInvItem::GBInstigator' has a wrong offset!");
static_assert(offsetof(AGBInvItem, CustomisationWidget) == 0x000308, "Member 'AGBInvItem::CustomisationWidget' has a wrong offset!");
static_assert(offsetof(AGBInvItem, DragDropOperations) == 0x000310, "Member 'AGBInvItem::DragDropOperations' has a wrong offset!");
static_assert(offsetof(AGBInvItem, DroppedInvItemClass) == 0x000360, "Member 'AGBInvItem::DroppedInvItemClass' has a wrong offset!");
static_assert(offsetof(AGBInvItem, EquippedCollisionProfileName) == 0x000368, "Member 'AGBInvItem::EquippedCollisionProfileName' has a wrong offset!");
static_assert(offsetof(AGBInvItem, UnequippedCollisionProfileName) == 0x000370, "Member 'AGBInvItem::UnequippedCollisionProfileName' has a wrong offset!");
static_assert(offsetof(AGBInvItem, bUnequippedEnableCollision) == 0x000378, "Member 'AGBInvItem::bUnequippedEnableCollision' has a wrong offset!");
static_assert(offsetof(AGBInvItem, OnReplacingClientsideProxy) == 0x000380, "Member 'AGBInvItem::OnReplacingClientsideProxy' has a wrong offset!");
static_assert(offsetof(AGBInvItem, bAllowKitEncoding) == 0x000391, "Member 'AGBInvItem::bAllowKitEncoding' has a wrong offset!");
static_assert(offsetof(AGBInvItem, InventorySlot) == 0x000394, "Member 'AGBInvItem::InventorySlot' has a wrong offset!");
static_assert(offsetof(AGBInvItem, InventorySlotWidget) == 0x000398, "Member 'AGBInvItem::InventorySlotWidget' has a wrong offset!");
static_assert(offsetof(AGBInvItem, InvItemSkinId) == 0x0003A0, "Member 'AGBInvItem::InvItemSkinId' has a wrong offset!");
static_assert(offsetof(AGBInvItem, BaseRotationalInertiaModifier) == 0x0003B0, "Member 'AGBInvItem::BaseRotationalInertiaModifier' has a wrong offset!");
static_assert(offsetof(AGBInvItem, GameplayAbilitySets) == 0x0003B8, "Member 'AGBInvItem::GameplayAbilitySets' has a wrong offset!");
static_assert(offsetof(AGBInvItem, GameplayAbilitySpecHandles) == 0x0003C8, "Member 'AGBInvItem::GameplayAbilitySpecHandles' has a wrong offset!");
static_assert(offsetof(AGBInvItem, AnimLayerClass) == 0x0003D8, "Member 'AGBInvItem::AnimLayerClass' has a wrong offset!");
static_assert(offsetof(AGBInvItem, CharMontageSets) == 0x000400, "Member 'AGBInvItem::CharMontageSets' has a wrong offset!");
static_assert(offsetof(AGBInvItem, MontageSets) == 0x000410, "Member 'AGBInvItem::MontageSets' has a wrong offset!");
static_assert(offsetof(AGBInvItem, AudioEventSets) == 0x000420, "Member 'AGBInvItem::AudioEventSets' has a wrong offset!");
static_assert(offsetof(AGBInvItem, EffectSets) == 0x000430, "Member 'AGBInvItem::EffectSets' has a wrong offset!");
static_assert(offsetof(AGBInvItem, DecalFadeScreenSize) == 0x000440, "Member 'AGBInvItem::DecalFadeScreenSize' has a wrong offset!");

// Class GroundBranch.GBAmmunition
// 0x0000 (0x0448 - 0x0448)
class AGBAmmunition : public AGBInvItem
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GBAmmunition">();
	}
	static class AGBAmmunition* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGBAmmunition>();
	}
};
static_assert(alignof(AGBAmmunition) == 0x000008, "Wrong alignment on AGBAmmunition");
static_assert(sizeof(AGBAmmunition) == 0x000448, "Wrong size on AGBAmmunition");

// Class GroundBranch.GBBulletItem
// 0x0008 (0x0450 - 0x0448)
class AGBBulletItem : public AGBAmmunition
{
public:
	TSubclassOf<class AGBBulletProjectile>        BulletProjectileClass;                             // 0x0448(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AssetRegistrySearchable, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	TSubclassOf<class AGBBulletProjectile> GetBulletProjectileClass() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GBBulletItem">();
	}
	static class AGBBulletItem* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGBBulletItem>();
	}
};
static_assert(alignof(AGBBulletItem) == 0x000008, "Wrong alignment on AGBBulletItem");
static_assert(sizeof(AGBBulletItem) == 0x000450, "Wrong size on AGBBulletItem");
static_assert(offsetof(AGBBulletItem, BulletProjectileClass) == 0x000448, "Member 'AGBBulletItem::BulletProjectileClass' has a wrong offset!");

// Class GroundBranch.GBAbilitySystemBlueprintLibrary
// 0x0000 (0x0028 - 0x0028)
class UGBAbilitySystemBlueprintLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void AddGameplayEffect(class AActor* Actor, TSubclassOf<class UGameplayEffect> GameplayEffectClass);
	static void AddGameplayEffectWithDuration(class AActor* Actor, TSubclassOf<class UGameplayEffect> GameplayEffectClass, float Duration);
	static bool AddLooseGameplayTag(class AActor* Actor, const struct FGameplayTag& GameplayTag, bool bShouldReplicate);
	static bool AddLooseGameplayTags(class AActor* Actor, const struct FGameplayTagContainer& GameplayTags, bool bShouldReplicate);
	static void CancelAbilities(class AActor* Actor, const struct FGameplayTagContainer& WithTags, const struct FGameplayTagContainer& WithoutTags, class UGameplayAbility* Ignore);
	static void ClearLooseGameplayTagsByParent(class AActor* Actor, const struct FGameplayTag& ParentGameplayTag, bool bShouldReplicate);
	static bool ConditionalAddLooseGameplayTag(class AActor* Actor, const struct FGameplayTag& GameplayTag, bool bShouldReplicate);
	static bool ConditionalRemoveLooseGameplayTag(class AActor* Actor, const struct FGameplayTag& GameplayTag, bool bShouldReplicate);
	static struct FGameplayTag ConvertNameToGameplayTag(const class FName& TagName, bool ErrorIfNotFound);
	static struct FGameplayTag ConvertStringToGameplayTag(const class FString& TagString, bool ErrorIfNotFound);
	static bool GameplayEffect_IsValidHandle(const struct FActiveGameplayEffectHandle& GameplayEffectHandle);
	static struct FGameplayTag GameplayTag_FromSocketName(const class FName& SocketName, const struct FGameplayTag& ParentGameplayTag);
	static class FName GameplayTag_ToSocketName(const struct FGameplayTag& GameplayTag, const struct FGameplayTag& ParentGameplayTag);
	static bool GameplayTagContainer_Filter(const struct FGameplayTagContainer& SourceContainer, const struct FGameplayTagContainer& OtherContainer, struct FGameplayTagContainer* OutFilteredContainer);
	static bool GameplayTagContainer_FilterExact(const struct FGameplayTagContainer& SourceContainer, const struct FGameplayTagContainer& OtherContainer, struct FGameplayTagContainer* OutFilteredContainer);
	static bool GameplayTagContainer_IsValid(const struct FGameplayTagContainer& Container);
	static struct FGameplayTagContainer GetPrimaryFirearmTypeTags();
	static struct FGameplayTagContainer GetSidearmFirearmTypeTags();
	static struct FGBGameplayTagEventHandle RegisterGameplayTagEvent(class AActor* Actor, const struct FGameplayTag& Tag, TDelegate<void(int32 NewCount)> OnGameplayTagChanged);
	static void RemoveGameplayEffect(class AActor* Actor, TSubclassOf<class UGameplayEffect> GameplayEffectClass);
	static bool RemoveLooseGameplayTag(class AActor* Actor, const struct FGameplayTag& GameplayTag, bool bShouldReplicate);
	static bool RemoveLooseGameplayTags(class AActor* Actor, const struct FGameplayTagContainer& GameplayTags, bool bShouldReplicate);
	static struct FGameplayTagContainer RequestGameplayTagChildren(const struct FGameplayTag& ParentTag);
	static bool SetLooseGameplayTagCount(class AActor* Actor, const struct FGameplayTag& GameplayTag, int32 NewCount, bool bShouldReplicate);
	static void SetRemoveAbilityOnEnd(class AActor* Actor, class UGameplayAbility* Ability);
	static void UnregisterGameplayTagEvent(struct FGBGameplayTagEventHandle& Handle);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GBAbilitySystemBlueprintLibrary">();
	}
	static class UGBAbilitySystemBlueprintLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGBAbilitySystemBlueprintLibrary>();
	}
};
static_assert(alignof(UGBAbilitySystemBlueprintLibrary) == 0x000008, "Wrong alignment on UGBAbilitySystemBlueprintLibrary");
static_assert(sizeof(UGBAbilitySystemBlueprintLibrary) == 0x000028, "Wrong size on UGBAbilitySystemBlueprintLibrary");

// Class GroundBranch.GBAbilitySystemComponent
// 0x0130 (0x1498 - 0x1368)
class UGBAbilitySystemComponent final : public UAbilitySystemComponent
{
public:
	class UGBAbilityTagRelationshipMapping*       TagRelationshipMapping;                            // 0x1368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1370[0x128];                                   // 0x1370(0x0128)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BlockAbilitiesWithoutTags(const struct FGameplayTagContainer& Tags);
	bool CancelAbilityByClass(TSubclassOf<class UGameplayAbility> InAbilityToCancel);
	bool SetGameplayEffectDurationHandle(const struct FActiveGameplayEffectHandle& Handle, float NewDuration);
	void UnBlockAbilitiesWithoutTags(const struct FGameplayTagContainer& Tags);

	struct FActiveGameplayEffectHandle GetFirstActiveGameplayEffect(const TSubclassOf<class UGameplayEffect>& GameplayEffectClass) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GBAbilitySystemComponent">();
	}
	static class UGBAbilitySystemComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGBAbilitySystemComponent>();
	}
};
static_assert(alignof(UGBAbilitySystemComponent) == 0x000008, "Wrong alignment on UGBAbilitySystemComponent");
static_assert(sizeof(UGBAbilitySystemComponent) == 0x001498, "Wrong size on UGBAbilitySystemComponent");
static_assert(offsetof(UGBAbilitySystemComponent, TagRelationshipMapping) == 0x001368, "Member 'UGBAbilitySystemComponent::TagRelationshipMapping' has a wrong offset!");

// Class GroundBranch.GBAbilityTagRelationshipMapping
// 0x0010 (0x0040 - 0x0030)
class UGBAbilityTagRelationshipMapping final : public UDataAsset
{
public:
	TArray<struct FGBAbilityTagRelationship>      AbilityTagRelationships;                           // 0x0030(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GBAbilityTagRelationshipMapping">();
	}
	static class UGBAbilityTagRelationshipMapping* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGBAbilityTagRelationshipMapping>();
	}
};
static_assert(alignof(UGBAbilityTagRelationshipMapping) == 0x000008, "Wrong alignment on UGBAbilityTagRelationshipMapping");
static_assert(sizeof(UGBAbilityTagRelationshipMapping) == 0x000040, "Wrong size on UGBAbilityTagRelationshipMapping");
static_assert(offsetof(UGBAbilityTagRelationshipMapping, AbilityTagRelationships) == 0x000030, "Member 'UGBAbilityTagRelationshipMapping::AbilityTagRelationships' has a wrong offset!");

// Class GroundBranch.GBBulletMovementComponent
// 0x0110 (0x02E0 - 0x01D0)
class UGBBulletMovementComponent final : public UProjectileMovementComponent
{
public:
	uint8                                         Pad_1D0[0x8];                                      // 0x01D0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(const struct FHitResult& ImpactResult)> OnImpactDelegate;          // 0x01D8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FHitResult& ImpactResult)> OnExitDelegate;            // 0x01E8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_1F8[0x8];                                      // 0x01F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  IgnoredPMTags;                                     // 0x0200(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  FXOnlyPMTags;                                      // 0x0220(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  ImpenetrablePMTags;                                // 0x0240(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_260[0xC];                                      // 0x0260(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AirDensity;                                        // 0x026C(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         WaterDensity;                                      // 0x0270(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         Length;                                            // 0x0274(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         Diameter;                                          // 0x0278(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_27C[0xC];                                      // 0x027C(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Mass;                                              // 0x0288(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         DragCoefficient;                                   // 0x028C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCurveFloat*                            DragCoefficientTable;                              // 0x0290(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         ExpansionIndice;                                   // 0x0298(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         PointShape;                                        // 0x029C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2A0[0x40];                                     // 0x02A0(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	float GetDragCoefficient(float Speed) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GBBulletMovementComponent">();
	}
	static class UGBBulletMovementComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGBBulletMovementComponent>();
	}
};
static_assert(alignof(UGBBulletMovementComponent) == 0x000010, "Wrong alignment on UGBBulletMovementComponent");
static_assert(sizeof(UGBBulletMovementComponent) == 0x0002E0, "Wrong size on UGBBulletMovementComponent");
static_assert(offsetof(UGBBulletMovementComponent, OnImpactDelegate) == 0x0001D8, "Member 'UGBBulletMovementComponent::OnImpactDelegate' has a wrong offset!");
static_assert(offsetof(UGBBulletMovementComponent, OnExitDelegate) == 0x0001E8, "Member 'UGBBulletMovementComponent::OnExitDelegate' has a wrong offset!");
static_assert(offsetof(UGBBulletMovementComponent, IgnoredPMTags) == 0x000200, "Member 'UGBBulletMovementComponent::IgnoredPMTags' has a wrong offset!");
static_assert(offsetof(UGBBulletMovementComponent, FXOnlyPMTags) == 0x000220, "Member 'UGBBulletMovementComponent::FXOnlyPMTags' has a wrong offset!");
static_assert(offsetof(UGBBulletMovementComponent, ImpenetrablePMTags) == 0x000240, "Member 'UGBBulletMovementComponent::ImpenetrablePMTags' has a wrong offset!");
static_assert(offsetof(UGBBulletMovementComponent, AirDensity) == 0x00026C, "Member 'UGBBulletMovementComponent::AirDensity' has a wrong offset!");
static_assert(offsetof(UGBBulletMovementComponent, WaterDensity) == 0x000270, "Member 'UGBBulletMovementComponent::WaterDensity' has a wrong offset!");
static_assert(offsetof(UGBBulletMovementComponent, Length) == 0x000274, "Member 'UGBBulletMovementComponent::Length' has a wrong offset!");
static_assert(offsetof(UGBBulletMovementComponent, Diameter) == 0x000278, "Member 'UGBBulletMovementComponent::Diameter' has a wrong offset!");
static_assert(offsetof(UGBBulletMovementComponent, Mass) == 0x000288, "Member 'UGBBulletMovementComponent::Mass' has a wrong offset!");
static_assert(offsetof(UGBBulletMovementComponent, DragCoefficient) == 0x00028C, "Member 'UGBBulletMovementComponent::DragCoefficient' has a wrong offset!");
static_assert(offsetof(UGBBulletMovementComponent, DragCoefficientTable) == 0x000290, "Member 'UGBBulletMovementComponent::DragCoefficientTable' has a wrong offset!");
static_assert(offsetof(UGBBulletMovementComponent, ExpansionIndice) == 0x000298, "Member 'UGBBulletMovementComponent::ExpansionIndice' has a wrong offset!");
static_assert(offsetof(UGBBulletMovementComponent, PointShape) == 0x00029C, "Member 'UGBBulletMovementComponent::PointShape' has a wrong offset!");

// Class GroundBranch.GBAbilityTask_CharacterWalkTo
// 0x0050 (0x00D0 - 0x0080)
class UGBAbilityTask_CharacterWalkTo final : public UAbilityTask
{
public:
	TMulticastInlineDelegate<void()>              OnTargetReached;                                   // 0x0080(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	TMulticastInlineDelegate<void()>              OnFailureToMove;                                   // 0x0090(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	uint8                                         Pad_A0[0x14];                                      // 0x00A0(0x0014)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AcceptableRadius;                                  // 0x00B4(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                TargetLocation;                                    // 0x00B8(0x000C)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         TargetRotationYaw;                                 // 0x00C4(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         RateOfRotation;                                    // 0x00C8(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UGBAbilityTask_CharacterWalkTo* CharacterWalkTo(class UGameplayAbility* OwningAbility, class FName TaskInstanceName, const struct FVector& Location, float Radius, const struct FRotator& Rotation, float RotationRate, float MaxFailedMoveTime);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GBAbilityTask_CharacterWalkTo">();
	}
	static class UGBAbilityTask_CharacterWalkTo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGBAbilityTask_CharacterWalkTo>();
	}
};
static_assert(alignof(UGBAbilityTask_CharacterWalkTo) == 0x000008, "Wrong alignment on UGBAbilityTask_CharacterWalkTo");
static_assert(sizeof(UGBAbilityTask_CharacterWalkTo) == 0x0000D0, "Wrong size on UGBAbilityTask_CharacterWalkTo");
static_assert(offsetof(UGBAbilityTask_CharacterWalkTo, OnTargetReached) == 0x000080, "Member 'UGBAbilityTask_CharacterWalkTo::OnTargetReached' has a wrong offset!");
static_assert(offsetof(UGBAbilityTask_CharacterWalkTo, OnFailureToMove) == 0x000090, "Member 'UGBAbilityTask_CharacterWalkTo::OnFailureToMove' has a wrong offset!");
static_assert(offsetof(UGBAbilityTask_CharacterWalkTo, AcceptableRadius) == 0x0000B4, "Member 'UGBAbilityTask_CharacterWalkTo::AcceptableRadius' has a wrong offset!");
static_assert(offsetof(UGBAbilityTask_CharacterWalkTo, TargetLocation) == 0x0000B8, "Member 'UGBAbilityTask_CharacterWalkTo::TargetLocation' has a wrong offset!");
static_assert(offsetof(UGBAbilityTask_CharacterWalkTo, TargetRotationYaw) == 0x0000C4, "Member 'UGBAbilityTask_CharacterWalkTo::TargetRotationYaw' has a wrong offset!");
static_assert(offsetof(UGBAbilityTask_CharacterWalkTo, RateOfRotation) == 0x0000C8, "Member 'UGBAbilityTask_CharacterWalkTo::RateOfRotation' has a wrong offset!");

// Class GroundBranch.GBBulletProjectile
// 0x00C8 (0x02E8 - 0x0220)
class AGBBulletProjectile : public AActor
{
public:
	uint8                                         Pad_220[0x30];                                     // 0x0220(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRepBulletMovement                     BulletReplicatedMovement;                          // 0x0250(0x0018)(Net, RepNotify, NoDestructor, NativeAccessSpecifierPublic)
	float                                         DumpedKEToDamageScale;                             // 0x0268(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         DumpedKEToDamageScaleDeviation;                    // 0x026C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UDamageType>                DamageType;                                        // 0x0270(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UGBBulletMovementComponent*             BulletMovementComp;                                // 0x0278(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USphereComponent*                       CollisionComp;                                     // 0x0280(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USphereComponent*                       BulletWarningTrigger;                              // 0x0288(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAkComponent*                           AkImpactComponent;                                 // 0x0290(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_298[0x8];                                      // 0x0298(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class AGBBulletProjectile>        SimulatedBulletClass;                              // 0x02A0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2A8[0x10];                                     // 0x02A8(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class AGBBulletProjectile*                    ParentBullet;                                      // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 StatKey;                                           // 0x02C0(0x0010)(ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         BulletIndex;                                       // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2D1[0xF];                                      // 0x02D1(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         TracerColourIndex;                                 // 0x02E0(0x0001)(BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2E1[0x7];                                      // 0x02E1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class AGBBulletProjectile* SpawnBullet(class AActor* BulletOwner, TSubclassOf<class AGBBulletProjectile> BulletClass, const struct FVector& SpawnLocation, const struct FVector& ShotDirection, float VelocityModifier, bool bSimulated);

	void CharacterImpact(class AGBCharacter* Character, const struct FHitResult& HitResult);
	void CreateTracerEvent();
	void ImpactDamage(const struct FHitResult& HitResult);
	void ImpactEffect(const struct FHitResult& HitResult, bool bExiting);
	void InitForSimulatedTrajectory();
	void OnBulletWarnSphereEndOverlap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void OnExit(const struct FHitResult& HitResult);
	void OnExitEvent(const struct FHitResult& HitResult);
	void OnImpact(const struct FHitResult& HitResult);
	void OnRep_BulletReplicatedMovement();
	void OnStop(const struct FHitResult& HitResult);
	void OnStopEvent(const struct FHitResult& HitResult);
	void SetBulletIndex(uint8 NewBulletIndex);
	void SetDragCoefficientOverride(float NewValue);
	void SetDumpedKEToDamageScale(float NewValue);
	void SetDumpedKEToDamageScaleDeviation(int32 NewValue);
	void SetParentBullet(class AGBBulletProjectile* NewParentBullet);
	void SetStatKey(const class FString& NewStatKey);
	void SetTracerColourIndex(uint8 NewTracerColourIndex);
	void SimulateTrajectory(const struct FTransform& SimTM, const float SimTime, const float SimTimeStep, const float MaxDistance, TArray<struct FVector>* OutTrajectoryPoints, bool* bOutSimulatedImpact);

	uint8 GetBulletIndex() const;
	class UGBBulletMovementComponent* GetBulletMovementComp() const;
	float GetDumpedKEToDamageScale() const;
	int32 GetDumpedKEToDamageScaleDeviation() const;
	class UAkComponent* GetImpactComp() const;
	class FString GetStatKey() const;
	uint8 GetTracerColourIndex() const;
	bool IsDebuggingBullets() const;
	bool IsSimulatedOnly() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GBBulletProjectile">();
	}
	static class AGBBulletProjectile* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGBBulletProjectile>();
	}
};
static_assert(alignof(AGBBulletProjectile) == 0x000008, "Wrong alignment on AGBBulletProjectile");
static_assert(sizeof(AGBBulletProjectile) == 0x0002E8, "Wrong size on AGBBulletProjectile");
static_assert(offsetof(AGBBulletProjectile, BulletReplicatedMovement) == 0x000250, "Member 'AGBBulletProjectile::BulletReplicatedMovement' has a wrong offset!");
static_assert(offsetof(AGBBulletProjectile, DumpedKEToDamageScale) == 0x000268, "Member 'AGBBulletProjectile::DumpedKEToDamageScale' has a wrong offset!");
static_assert(offsetof(AGBBulletProjectile, DumpedKEToDamageScaleDeviation) == 0x00026C, "Member 'AGBBulletProjectile::DumpedKEToDamageScaleDeviation' has a wrong offset!");
static_assert(offsetof(AGBBulletProjectile, DamageType) == 0x000270, "Member 'AGBBulletProjectile::DamageType' has a wrong offset!");
static_assert(offsetof(AGBBulletProjectile, BulletMovementComp) == 0x000278, "Member 'AGBBulletProjectile::BulletMovementComp' has a wrong offset!");
static_assert(offsetof(AGBBulletProjectile, CollisionComp) == 0x000280, "Member 'AGBBulletProjectile::CollisionComp' has a wrong offset!");
static_assert(offsetof(AGBBulletProjectile, BulletWarningTrigger) == 0x000288, "Member 'AGBBulletProjectile::BulletWarningTrigger' has a wrong offset!");
static_assert(offsetof(AGBBulletProjectile, AkImpactComponent) == 0x000290, "Member 'AGBBulletProjectile::AkImpactComponent' has a wrong offset!");
static_assert(offsetof(AGBBulletProjectile, SimulatedBulletClass) == 0x0002A0, "Member 'AGBBulletProjectile::SimulatedBulletClass' has a wrong offset!");
static_assert(offsetof(AGBBulletProjectile, ParentBullet) == 0x0002B8, "Member 'AGBBulletProjectile::ParentBullet' has a wrong offset!");
static_assert(offsetof(AGBBulletProjectile, StatKey) == 0x0002C0, "Member 'AGBBulletProjectile::StatKey' has a wrong offset!");
static_assert(offsetof(AGBBulletProjectile, BulletIndex) == 0x0002D0, "Member 'AGBBulletProjectile::BulletIndex' has a wrong offset!");
static_assert(offsetof(AGBBulletProjectile, TracerColourIndex) == 0x0002E0, "Member 'AGBBulletProjectile::TracerColourIndex' has a wrong offset!");

// Class GroundBranch.GBAbilityTask_Tick
// 0x0010 (0x0090 - 0x0080)
class UGBAbilityTask_Tick final : public UAbilityTask
{
public:
	TMulticastInlineDelegate<void(float DeltaTime)> OnTick;                                          // 0x0080(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)

public:
	static class UGBAbilityTask_Tick* Tick(class UGameplayAbility* OwningAbility, class FName TaskInstanceName);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GBAbilityTask_Tick">();
	}
	static class UGBAbilityTask_Tick* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGBAbilityTask_Tick>();
	}
};
static_assert(alignof(UGBAbilityTask_Tick) == 0x000008, "Wrong alignment on UGBAbilityTask_Tick");
static_assert(sizeof(UGBAbilityTask_Tick) == 0x000090, "Wrong size on UGBAbilityTask_Tick");
static_assert(offsetof(UGBAbilityTask_Tick, OnTick) == 0x000080, "Member 'UGBAbilityTask_Tick::OnTick' has a wrong offset!");

// Class GroundBranch.GBAbilityTask_WaitAbilityEnded
// 0x00B8 (0x0138 - 0x0080)
class UGBAbilityTask_WaitAbilityEnded final : public UAbilityTask
{
public:
	TMulticastInlineDelegate<void(class UGameplayAbility* EndedAbility)> OnEnded;                    // 0x0080(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	uint8                                         Pad_90[0xA8];                                      // 0x0090(0x00A8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UGBAbilityTask_WaitAbilityEnded* WaitForAbilityEnded(class UGameplayAbility* OwningAbility, const struct FGameplayTag& WithTag, const struct FGameplayTag& WithoutTag, bool IncludeTriggeredAbilities, bool TriggerOnce);
	static class UGBAbilityTask_WaitAbilityEnded* WaitForAbilityEnded_Query(class UGameplayAbility* OwningAbility, const struct FGameplayTagQuery& Query, bool IncludeTriggeredAbilities, bool TriggerOnce);
	static class UGBAbilityTask_WaitAbilityEnded* WaitForAbilityEndedWithTagRequirements(class UGameplayAbility* OwningAbility, const struct FGameplayTagRequirements& TagRequirements, bool IncludeTriggeredAbilities, bool TriggerOnce);

	void OnAbilityEnded(class UGameplayAbility* EndedAbility);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GBAbilityTask_WaitAbilityEnded">();
	}
	static class UGBAbilityTask_WaitAbilityEnded* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGBAbilityTask_WaitAbilityEnded>();
	}
};
static_assert(alignof(UGBAbilityTask_WaitAbilityEnded) == 0x000008, "Wrong alignment on UGBAbilityTask_WaitAbilityEnded");
static_assert(sizeof(UGBAbilityTask_WaitAbilityEnded) == 0x000138, "Wrong size on UGBAbilityTask_WaitAbilityEnded");
static_assert(offsetof(UGBAbilityTask_WaitAbilityEnded, OnEnded) == 0x000080, "Member 'UGBAbilityTask_WaitAbilityEnded::OnEnded' has a wrong offset!");

// Class GroundBranch.GBCameraModifier
// 0x0000 (0x0048 - 0x0048)
class UGBCameraModifier : public UCameraModifier
{
public:
	void BlueprintAddedToCamera(class AGBPlayerCameraManager* GBPlayerCameraManager);
	void BlueprintPreApplyCameraModifier(class AGBPlayerCameraManager* GBPlayerCameraManager, float DeltaTime);
	bool BlueprintProcessViewRotation(class AActor* ViewTarget, float DeltaTime, struct FRotator* OutViewRotation, struct FRotator* OutDeltaRot);
	void BlueprintRemovedFromCamera(class AGBPlayerCameraManager* GBPlayerCameraManager);
	void OnCameraStyleChanged(class FName OldCameraStyle, class FName NewCameraStyle);
	void OnCameraStyleChangedEvent(class FName OldCameraStyle, class FName NewCameraStyle);
	void OnModifierDisabledEvent();
	void OnModifierEnabledEvent();

	class AGBPlayerCameraManager* GetGBPlayerCameraManager() const;
	class AGBPlayerController* GetGBPlayerController() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GBCameraModifier">();
	}
	static class UGBCameraModifier* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGBCameraModifier>();
	}
};
static_assert(alignof(UGBCameraModifier) == 0x000008, "Wrong alignment on UGBCameraModifier");
static_assert(sizeof(UGBCameraModifier) == 0x000048, "Wrong size on UGBCameraModifier");

// Class GroundBranch.GBAbilityTask_WaitActionPress
// 0x0030 (0x00B0 - 0x0080)
class UGBAbilityTask_WaitActionPress final : public UAbilityTask
{
public:
	TMulticastInlineDelegate<void(float TimeWaited)> OnPress;                                        // 0x0080(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_90[0x18];                                      // 0x0090(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputComponent*                        InputComponent;                                    // 0x00A8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UGBAbilityTask_WaitActionPress* WaitActionPress(class UGameplayAbility* OwningAbility, class FName ActionName, bool bTestAlreadyPressed);

	void OnPressCallback();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GBAbilityTask_WaitActionPress">();
	}
	static class UGBAbilityTask_WaitActionPress* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGBAbilityTask_WaitActionPress>();
	}
};
static_assert(alignof(UGBAbilityTask_WaitActionPress) == 0x000008, "Wrong alignment on UGBAbilityTask_WaitActionPress");
static_assert(sizeof(UGBAbilityTask_WaitActionPress) == 0x0000B0, "Wrong size on UGBAbilityTask_WaitActionPress");
static_assert(offsetof(UGBAbilityTask_WaitActionPress, OnPress) == 0x000080, "Member 'UGBAbilityTask_WaitActionPress::OnPress' has a wrong offset!");
static_assert(offsetof(UGBAbilityTask_WaitActionPress, InputComponent) == 0x0000A8, "Member 'UGBAbilityTask_WaitActionPress::InputComponent' has a wrong offset!");

// Class GroundBranch.GBCampaignSettings
// 0x0050 (0x0078 - 0x0028)
class UGBCampaignSettings final : public UObject
{
public:
	int32                                         RosterSize;                                        // 0x0028(0x0004)(Edit, ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGBOperatorDetails>             OperatorRoster;                                    // 0x0030(0x0010)(Edit, ZeroConstructor, Config, GlobalConfig, Protected, NativeAccessSpecifierProtected)
	TArray<struct FGBOperatorDetails>             KIAList;                                           // 0x0040(0x0010)(Edit, ZeroConstructor, Config, GlobalConfig, Protected, NativeAccessSpecifierProtected)
	TArray<struct FGBMissionCompletionDetails>    MissionCompletionDetails;                          // 0x0050(0x0010)(Edit, ZeroConstructor, Config, GlobalConfig, Protected, NativeAccessSpecifierProtected)
	TArray<class FName>                           AvailableCodenames;                                // 0x0060(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	bool                                          bGeneratedAvailableCodenames;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bLoadedConfig;                                     // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UGBCampaignSettings* Get();

	void AddOperatorToRoster(const struct FGBOperatorDetails& OperatorDetails, const bool bUpdateConfig);
	void FillRoster();
	void GenerateAvailableCodenames();
	TArray<class FName> GetAvailableCodenames();
	struct FGBMissionCompletionDetails GetCompletionDetailsForMission(const class FName& InHotspotCodename, const int32 InMissionSequenceNumber);
	void GetCompletionForHotspot(const class FName& InHotspotCodename, float* OutSinglePlayerCompletion, float* OutCoopCompletion);
	int32 GetIndexInOperatorDetailsList(const TArray<struct FGBOperatorDetails>& OperatorList, const struct FGBOperatorDetails& OperatorDetails);
	TArray<struct FGBOperatorDetails> GetKIAList();
	struct FGBOperatorDetails GetNewOperator();
	TArray<struct FGBOperatorDetails> GetOperatorRoster();
	void MarkOperatorKIA(const struct FGBOperatorDetails& OperatorDetails);
	void ResetCampaign();
	void ResetCompletionDetailsForHotspot(const class FName& InHotspotCodename);
	void ResetCompletionDetailsForMission(const class FName& InHotspotCodename, const int32 InMissionSequenceNumber);
	void SetCompletionDetailsForMission(const class FName& InHotspotCodename, const int32 InMissionSequenceNumber, const bool bSinglePlayer, const float CompletionAmount);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GBCampaignSettings">();
	}
	static class UGBCampaignSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGBCampaignSettings>();
	}
};
static_assert(alignof(UGBCampaignSettings) == 0x000008, "Wrong alignment on UGBCampaignSettings");
static_assert(sizeof(UGBCampaignSettings) == 0x000078, "Wrong size on UGBCampaignSettings");
static_assert(offsetof(UGBCampaignSettings, RosterSize) == 0x000028, "Member 'UGBCampaignSettings::RosterSize' has a wrong offset!");
static_assert(offsetof(UGBCampaignSettings, OperatorRoster) == 0x000030, "Member 'UGBCampaignSettings::OperatorRoster' has a wrong offset!");
static_assert(offsetof(UGBCampaignSettings, KIAList) == 0x000040, "Member 'UGBCampaignSettings::KIAList' has a wrong offset!");
static_assert(offsetof(UGBCampaignSettings, MissionCompletionDetails) == 0x000050, "Member 'UGBCampaignSettings::MissionCompletionDetails' has a wrong offset!");
static_assert(offsetof(UGBCampaignSettings, AvailableCodenames) == 0x000060, "Member 'UGBCampaignSettings::AvailableCodenames' has a wrong offset!");
static_assert(offsetof(UGBCampaignSettings, bGeneratedAvailableCodenames) == 0x000070, "Member 'UGBCampaignSettings::bGeneratedAvailableCodenames' has a wrong offset!");
static_assert(offsetof(UGBCampaignSettings, bLoadedConfig) == 0x000071, "Member 'UGBCampaignSettings::bLoadedConfig' has a wrong offset!");

// Class GroundBranch.GBAbilityTask_WaitActionRelease
// 0x0030 (0x00B0 - 0x0080)
class UGBAbilityTask_WaitActionRelease final : public UAbilityTask
{
public:
