#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KytheraPlugin

#include "Basic.hpp"

#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"
#include "KytheraPlugin_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class KytheraPlugin.KytNavCost
// 0x0060 (0x0110 - 0x00B0)
class UKytNavCost final : public UActorComponent
{
public:
	class FString                                 AreaLabel;                                         // 0x00B0(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UKytNavMeshAgentGroup*                  AgentTypesData;                                    // 0x00C0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FHashData                              SerializationData;                                 // 0x00C8(0x0020)(NativeAccessSpecifierPrivate)
	uint8                                         Pad_E8[0x8];                                       // 0x00E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBox                                   CurrentBoundingBox;                                // 0x00F0(0x001C)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KytNavCost">();
	}
	static class UKytNavCost* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKytNavCost>();
	}
};
static_assert(alignof(UKytNavCost) == 0x000008, "Wrong alignment on UKytNavCost");
static_assert(sizeof(UKytNavCost) == 0x000110, "Wrong size on UKytNavCost");
static_assert(offsetof(UKytNavCost, AreaLabel) == 0x0000B0, "Member 'UKytNavCost::AreaLabel' has a wrong offset!");
static_assert(offsetof(UKytNavCost, AgentTypesData) == 0x0000C0, "Member 'UKytNavCost::AgentTypesData' has a wrong offset!");
static_assert(offsetof(UKytNavCost, SerializationData) == 0x0000C8, "Member 'UKytNavCost::SerializationData' has a wrong offset!");
static_assert(offsetof(UKytNavCost, CurrentBoundingBox) == 0x0000F0, "Member 'UKytNavCost::CurrentBoundingBox' has a wrong offset!");

// Class KytheraPlugin.EnvQueryGenerator_KytBase
// 0x0000 (0x0050 - 0x0050)
class UEnvQueryGenerator_KytBase : public UEnvQueryGenerator
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EnvQueryGenerator_KytBase">();
	}
	static class UEnvQueryGenerator_KytBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEnvQueryGenerator_KytBase>();
	}
};
static_assert(alignof(UEnvQueryGenerator_KytBase) == 0x000008, "Wrong alignment on UEnvQueryGenerator_KytBase");
static_assert(sizeof(UEnvQueryGenerator_KytBase) == 0x000050, "Wrong size on UEnvQueryGenerator_KytBase");

// Class KytheraPlugin.KytCSNComponent
// 0x0010 (0x00C0 - 0x00B0)
class UKytCSNComponent final : public UActorComponent
{
public:
	class UKytCSNNetworkData*                     CSNNetworkData;                                    // 0x00B0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForceDefaultDensities;                            // 0x00B8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         DefaultVehicleDensityPercentage;                   // 0x00B9(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         DefaultPedestrianDensityPercentage;                // 0x00BA(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_BB[0x5];                                       // 0x00BB(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetPedestrianSpawnDensityMultiplier(float Multiplier);
	void SetVehicleSpawnDensityMultiplier(float Multiplier);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KytCSNComponent">();
	}
	static class UKytCSNComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKytCSNComponent>();
	}
};
static_assert(alignof(UKytCSNComponent) == 0x000008, "Wrong alignment on UKytCSNComponent");
static_assert(sizeof(UKytCSNComponent) == 0x0000C0, "Wrong size on UKytCSNComponent");
static_assert(offsetof(UKytCSNComponent, CSNNetworkData) == 0x0000B0, "Member 'UKytCSNComponent::CSNNetworkData' has a wrong offset!");
static_assert(offsetof(UKytCSNComponent, bForceDefaultDensities) == 0x0000B8, "Member 'UKytCSNComponent::bForceDefaultDensities' has a wrong offset!");
static_assert(offsetof(UKytCSNComponent, DefaultVehicleDensityPercentage) == 0x0000B9, "Member 'UKytCSNComponent::DefaultVehicleDensityPercentage' has a wrong offset!");
static_assert(offsetof(UKytCSNComponent, DefaultPedestrianDensityPercentage) == 0x0000BA, "Member 'UKytCSNComponent::DefaultPedestrianDensityPercentage' has a wrong offset!");

// Class KytheraPlugin.EnvQueryGenerator_KytCoverRail
// 0x00E0 (0x0130 - 0x0050)
class UEnvQueryGenerator_KytCoverRail final : public UEnvQueryGenerator_KytBase
{
public:
	struct FAIDataProviderFloatValue              Radius;                                            // 0x0050(0x0038)(Edit, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FAIDataProviderFloatValue              Density;                                           // 0x0088(0x0038)(Edit, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TMap<class FString, bool>                     CoverTypes;                                        // 0x00C0(0x0050)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TSubclassOf<class UEnvQueryContext>           Origin;                                            // 0x0110(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIncludeClaimed;                                   // 0x0118(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_119[0x17];                                     // 0x0119(0x0017)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EnvQueryGenerator_KytCoverRail">();
	}
	static class UEnvQueryGenerator_KytCoverRail* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEnvQueryGenerator_KytCoverRail>();
	}
};
static_assert(alignof(UEnvQueryGenerator_KytCoverRail) == 0x000008, "Wrong alignment on UEnvQueryGenerator_KytCoverRail");
static_assert(sizeof(UEnvQueryGenerator_KytCoverRail) == 0x000130, "Wrong size on UEnvQueryGenerator_KytCoverRail");
static_assert(offsetof(UEnvQueryGenerator_KytCoverRail, Radius) == 0x000050, "Member 'UEnvQueryGenerator_KytCoverRail::Radius' has a wrong offset!");
static_assert(offsetof(UEnvQueryGenerator_KytCoverRail, Density) == 0x000088, "Member 'UEnvQueryGenerator_KytCoverRail::Density' has a wrong offset!");
static_assert(offsetof(UEnvQueryGenerator_KytCoverRail, CoverTypes) == 0x0000C0, "Member 'UEnvQueryGenerator_KytCoverRail::CoverTypes' has a wrong offset!");
static_assert(offsetof(UEnvQueryGenerator_KytCoverRail, Origin) == 0x000110, "Member 'UEnvQueryGenerator_KytCoverRail::Origin' has a wrong offset!");
static_assert(offsetof(UEnvQueryGenerator_KytCoverRail, bIncludeClaimed) == 0x000118, "Member 'UEnvQueryGenerator_KytCoverRail::bIncludeClaimed' has a wrong offset!");

// Class KytheraPlugin.EnvQueryGenerator_KytGridPoint
// 0x0078 (0x00C8 - 0x0050)
class UEnvQueryGenerator_KytGridPoint final : public UEnvQueryGenerator_KytBase
{
public:
	struct FAIDataProviderFloatValue              GridSize;                                          // 0x0050(0x0038)(Edit, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FAIDataProviderFloatValue              SpaceBetween;                                      // 0x0088(0x0038)(Edit, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TSubclassOf<class UEnvQueryContext>           GenerateAround;                                    // 0x00C0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EnvQueryGenerator_KytGridPoint">();
	}
	static class UEnvQueryGenerator_KytGridPoint* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEnvQueryGenerator_KytGridPoint>();
	}
};
static_assert(alignof(UEnvQueryGenerator_KytGridPoint) == 0x000008, "Wrong alignment on UEnvQueryGenerator_KytGridPoint");
static_assert(sizeof(UEnvQueryGenerator_KytGridPoint) == 0x0000C8, "Wrong size on UEnvQueryGenerator_KytGridPoint");
static_assert(offsetof(UEnvQueryGenerator_KytGridPoint, GridSize) == 0x000050, "Member 'UEnvQueryGenerator_KytGridPoint::GridSize' has a wrong offset!");
static_assert(offsetof(UEnvQueryGenerator_KytGridPoint, SpaceBetween) == 0x000088, "Member 'UEnvQueryGenerator_KytGridPoint::SpaceBetween' has a wrong offset!");
static_assert(offsetof(UEnvQueryGenerator_KytGridPoint, GenerateAround) == 0x0000C0, "Member 'UEnvQueryGenerator_KytGridPoint::GenerateAround' has a wrong offset!");

// Class KytheraPlugin.KytBTWaitForSignalTask
// 0x0018 (0x00B0 - 0x0098)
class UKytBTWaitForSignalTask final : public UBTTask_BlackboardBase
{
public:
	class FString                                 SignalName;                                        // 0x0098(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A8[0x8];                                       // 0x00A8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KytBTWaitForSignalTask">();
	}
	static class UKytBTWaitForSignalTask* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKytBTWaitForSignalTask>();
	}
};
static_assert(alignof(UKytBTWaitForSignalTask) == 0x000008, "Wrong alignment on UKytBTWaitForSignalTask");
static_assert(sizeof(UKytBTWaitForSignalTask) == 0x0000B0, "Wrong size on UKytBTWaitForSignalTask");
static_assert(offsetof(UKytBTWaitForSignalTask, SignalName) == 0x000098, "Member 'UKytBTWaitForSignalTask::SignalName' has a wrong offset!");

// Class KytheraPlugin.EnvQueryGenerator_KytOctreeGrid
// 0x0190 (0x01E0 - 0x0050)
class UEnvQueryGenerator_KytOctreeGrid final : public UEnvQueryGenerator_KytBase
{
public:
	struct FAIDataProviderFloatValue              Density;                                           // 0x0050(0x0038)(Edit, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FAIDataProviderFloatValue              MinRadius;                                         // 0x0088(0x0038)(Edit, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FAIDataProviderFloatValue              MaxRadius;                                         // 0x00C0(0x0038)(Edit, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FAIDataProviderBoolValue               AvoidDynamicObstacles;                             // 0x00F8(0x0038)(Edit, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FAIDataProviderBoolValue               OpenAreasOnly;                                     // 0x0130(0x0038)(Edit, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FAIDataProviderFloatValue              PointRadius;                                       // 0x0168(0x0038)(Edit, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	ERadiusSourceEnum                             RadiusSource;                                      // 0x01A0(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1A1[0x7];                                      // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAIDataProviderFloatValue              ShipRadius;                                        // 0x01A8(0x0038)(Edit, ContainsInstancedReference, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EnvQueryGenerator_KytOctreeGrid">();
	}
	static class UEnvQueryGenerator_KytOctreeGrid* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEnvQueryGenerator_KytOctreeGrid>();
	}
};
static_assert(alignof(UEnvQueryGenerator_KytOctreeGrid) == 0x000008, "Wrong alignment on UEnvQueryGenerator_KytOctreeGrid");
static_assert(sizeof(UEnvQueryGenerator_KytOctreeGrid) == 0x0001E0, "Wrong size on UEnvQueryGenerator_KytOctreeGrid");
static_assert(offsetof(UEnvQueryGenerator_KytOctreeGrid, Density) == 0x000050, "Member 'UEnvQueryGenerator_KytOctreeGrid::Density' has a wrong offset!");
static_assert(offsetof(UEnvQueryGenerator_KytOctreeGrid, MinRadius) == 0x000088, "Member 'UEnvQueryGenerator_KytOctreeGrid::MinRadius' has a wrong offset!");
static_assert(offsetof(UEnvQueryGenerator_KytOctreeGrid, MaxRadius) == 0x0000C0, "Member 'UEnvQueryGenerator_KytOctreeGrid::MaxRadius' has a wrong offset!");
static_assert(offsetof(UEnvQueryGenerator_KytOctreeGrid, AvoidDynamicObstacles) == 0x0000F8, "Member 'UEnvQueryGenerator_KytOctreeGrid::AvoidDynamicObstacles' has a wrong offset!");
static_assert(offsetof(UEnvQueryGenerator_KytOctreeGrid, OpenAreasOnly) == 0x000130, "Member 'UEnvQueryGenerator_KytOctreeGrid::OpenAreasOnly' has a wrong offset!");
static_assert(offsetof(UEnvQueryGenerator_KytOctreeGrid, PointRadius) == 0x000168, "Member 'UEnvQueryGenerator_KytOctreeGrid::PointRadius' has a wrong offset!");
static_assert(offsetof(UEnvQueryGenerator_KytOctreeGrid, RadiusSource) == 0x0001A0, "Member 'UEnvQueryGenerator_KytOctreeGrid::RadiusSource' has a wrong offset!");
static_assert(offsetof(UEnvQueryGenerator_KytOctreeGrid, ShipRadius) == 0x0001A8, "Member 'UEnvQueryGenerator_KytOctreeGrid::ShipRadius' has a wrong offset!");

// Class KytheraPlugin.KytBlackboardBase
// 0x0008 (0x0038 - 0x0030)
class UKytBlackboardBase : public UPrimaryDataAsset
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KytBlackboardBase">();
	}
	static class UKytBlackboardBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKytBlackboardBase>();
	}
};
static_assert(alignof(UKytBlackboardBase) == 0x000008, "Wrong alignment on UKytBlackboardBase");
static_assert(sizeof(UKytBlackboardBase) == 0x000038, "Wrong size on UKytBlackboardBase");

// Class KytheraPlugin.KytBlackboardImportable
// 0x0000 (0x0038 - 0x0038)
class UKytBlackboardImportable : public UKytBlackboardBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KytBlackboardImportable">();
	}
	static class UKytBlackboardImportable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKytBlackboardImportable>();
	}
};
static_assert(alignof(UKytBlackboardImportable) == 0x000008, "Wrong alignment on UKytBlackboardImportable");
static_assert(sizeof(UKytBlackboardImportable) == 0x000038, "Wrong size on UKytBlackboardImportable");

// Class KytheraPlugin.KytFormation2dProfile
// 0x0030 (0x0068 - 0x0038)
class UKytFormation2dProfile final : public UKytBlackboardImportable
{
public:
	class FString                                 DesiredBehavior;                                   // 0x0038(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 TargetSelector;                                    // 0x0048(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WalkSpeed;                                         // 0x0058(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RunSpeed;                                          // 0x005C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TurnRate;                                          // 0x0060(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ChokepointSlotCullDistance;                        // 0x0064(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KytFormation2dProfile">();
	}
	static class UKytFormation2dProfile* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKytFormation2dProfile>();
	}
};
static_assert(alignof(UKytFormation2dProfile) == 0x000008, "Wrong alignment on UKytFormation2dProfile");
static_assert(sizeof(UKytFormation2dProfile) == 0x000068, "Wrong size on UKytFormation2dProfile");
static_assert(offsetof(UKytFormation2dProfile, DesiredBehavior) == 0x000038, "Member 'UKytFormation2dProfile::DesiredBehavior' has a wrong offset!");
static_assert(offsetof(UKytFormation2dProfile, TargetSelector) == 0x000048, "Member 'UKytFormation2dProfile::TargetSelector' has a wrong offset!");
static_assert(offsetof(UKytFormation2dProfile, WalkSpeed) == 0x000058, "Member 'UKytFormation2dProfile::WalkSpeed' has a wrong offset!");
static_assert(offsetof(UKytFormation2dProfile, RunSpeed) == 0x00005C, "Member 'UKytFormation2dProfile::RunSpeed' has a wrong offset!");
static_assert(offsetof(UKytFormation2dProfile, TurnRate) == 0x000060, "Member 'UKytFormation2dProfile::TurnRate' has a wrong offset!");
static_assert(offsetof(UKytFormation2dProfile, ChokepointSlotCullDistance) == 0x000064, "Member 'UKytFormation2dProfile::ChokepointSlotCullDistance' has a wrong offset!");

// Class KytheraPlugin.EnvQueryGenerator_KytOctreeGridNavigable
// 0x0210 (0x0260 - 0x0050)
class UEnvQueryGenerator_KytOctreeGridNavigable final : public UEnvQueryGenerator_KytBase
{
public:
	struct FAIDataProviderFloatValue              Density;                                           // 0x0050(0x0038)(Edit, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FAIDataProviderFloatValue              MinRadius;                                         // 0x0088(0x0038)(Edit, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FAIDataProviderFloatValue              MaxRadius;                                         // 0x00C0(0x0038)(Edit, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FAIDataProviderFloatValue              PathDistanceRatio;                                 // 0x00F8(0x0038)(Edit, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FAIDataProviderFloatValue              Angle;                                             // 0x0130(0x0038)(Edit, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FVector                                ConeDirection;                                     // 0x0168(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_174[0x4];                                      // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAIDataProviderBoolValue               AvoidDynamicObstacles;                             // 0x0178(0x0038)(Edit, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FAIDataProviderBoolValue               OpenAreasOnly;                                     // 0x01B0(0x0038)(Edit, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FAIDataProviderFloatValue              PointRadius;                                       // 0x01E8(0x0038)(Edit, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	ERadiusSourceEnum                             RadiusSource;                                      // 0x0220(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_221[0x7];                                      // 0x0221(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAIDataProviderFloatValue              ShipRadius;                                        // 0x0228(0x0038)(Edit, ContainsInstancedReference, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EnvQueryGenerator_KytOctreeGridNavigable">();
	}
	static class UEnvQueryGenerator_KytOctreeGridNavigable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEnvQueryGenerator_KytOctreeGridNavigable>();
	}
};
static_assert(alignof(UEnvQueryGenerator_KytOctreeGridNavigable) == 0x000008, "Wrong alignment on UEnvQueryGenerator_KytOctreeGridNavigable");
static_assert(sizeof(UEnvQueryGenerator_KytOctreeGridNavigable) == 0x000260, "Wrong size on UEnvQueryGenerator_KytOctreeGridNavigable");
static_assert(offsetof(UEnvQueryGenerator_KytOctreeGridNavigable, Density) == 0x000050, "Member 'UEnvQueryGenerator_KytOctreeGridNavigable::Density' has a wrong offset!");
static_assert(offsetof(UEnvQueryGenerator_KytOctreeGridNavigable, MinRadius) == 0x000088, "Member 'UEnvQueryGenerator_KytOctreeGridNavigable::MinRadius' has a wrong offset!");
static_assert(offsetof(UEnvQueryGenerator_KytOctreeGridNavigable, MaxRadius) == 0x0000C0, "Member 'UEnvQueryGenerator_KytOctreeGridNavigable::MaxRadius' has a wrong offset!");
static_assert(offsetof(UEnvQueryGenerator_KytOctreeGridNavigable, PathDistanceRatio) == 0x0000F8, "Member 'UEnvQueryGenerator_KytOctreeGridNavigable::PathDistanceRatio' has a wrong offset!");
static_assert(offsetof(UEnvQueryGenerator_KytOctreeGridNavigable, Angle) == 0x000130, "Member 'UEnvQueryGenerator_KytOctreeGridNavigable::Angle' has a wrong offset!");
static_assert(offsetof(UEnvQueryGenerator_KytOctreeGridNavigable, ConeDirection) == 0x000168, "Member 'UEnvQueryGenerator_KytOctreeGridNavigable::ConeDirection' has a wrong offset!");
static_assert(offsetof(UEnvQueryGenerator_KytOctreeGridNavigable, AvoidDynamicObstacles) == 0x000178, "Member 'UEnvQueryGenerator_KytOctreeGridNavigable::AvoidDynamicObstacles' has a wrong offset!");
static_assert(offsetof(UEnvQueryGenerator_KytOctreeGridNavigable, OpenAreasOnly) == 0x0001B0, "Member 'UEnvQueryGenerator_KytOctreeGridNavigable::OpenAreasOnly' has a wrong offset!");
static_assert(offsetof(UEnvQueryGenerator_KytOctreeGridNavigable, PointRadius) == 0x0001E8, "Member 'UEnvQueryGenerator_KytOctreeGridNavigable::PointRadius' has a wrong offset!");
static_assert(offsetof(UEnvQueryGenerator_KytOctreeGridNavigable, RadiusSource) == 0x000220, "Member 'UEnvQueryGenerator_KytOctreeGridNavigable::RadiusSource' has a wrong offset!");
static_assert(offsetof(UEnvQueryGenerator_KytOctreeGridNavigable, ShipRadius) == 0x000228, "Member 'UEnvQueryGenerator_KytOctreeGridNavigable::ShipRadius' has a wrong offset!");

// Class KytheraPlugin.EnvQueryGenerator_KytOctreeRandom
// 0x0030 (0x0080 - 0x0050)
class UEnvQueryGenerator_KytOctreeRandom final : public UEnvQueryGenerator_KytBase
{
public:
	float                                         MinRadius;                                         // 0x0050(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MaxRadius;                                         // 0x0054(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         Angle;                                             // 0x0058(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                                ConeDirection;                                     // 0x005C(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          AvoidDynamicObstacles;                             // 0x0068(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          OpenAreasOnly;                                     // 0x0069(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_6A[0x2];                                       // 0x006A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PointRadius;                                       // 0x006C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	ERadiusSourceEnum                             RadiusSource;                                      // 0x0070(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ShipRadius;                                        // 0x0074(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint32                                        RequestedPoints;                                   // 0x0078(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EnvQueryGenerator_KytOctreeRandom">();
	}
	static class UEnvQueryGenerator_KytOctreeRandom* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEnvQueryGenerator_KytOctreeRandom>();
	}
};
static_assert(alignof(UEnvQueryGenerator_KytOctreeRandom) == 0x000008, "Wrong alignment on UEnvQueryGenerator_KytOctreeRandom");
static_assert(sizeof(UEnvQueryGenerator_KytOctreeRandom) == 0x000080, "Wrong size on UEnvQueryGenerator_KytOctreeRandom");
static_assert(offsetof(UEnvQueryGenerator_KytOctreeRandom, MinRadius) == 0x000050, "Member 'UEnvQueryGenerator_KytOctreeRandom::MinRadius' has a wrong offset!");
static_assert(offsetof(UEnvQueryGenerator_KytOctreeRandom, MaxRadius) == 0x000054, "Member 'UEnvQueryGenerator_KytOctreeRandom::MaxRadius' has a wrong offset!");
static_assert(offsetof(UEnvQueryGenerator_KytOctreeRandom, Angle) == 0x000058, "Member 'UEnvQueryGenerator_KytOctreeRandom::Angle' has a wrong offset!");
static_assert(offsetof(UEnvQueryGenerator_KytOctreeRandom, ConeDirection) == 0x00005C, "Member 'UEnvQueryGenerator_KytOctreeRandom::ConeDirection' has a wrong offset!");
static_assert(offsetof(UEnvQueryGenerator_KytOctreeRandom, AvoidDynamicObstacles) == 0x000068, "Member 'UEnvQueryGenerator_KytOctreeRandom::AvoidDynamicObstacles' has a wrong offset!");
static_assert(offsetof(UEnvQueryGenerator_KytOctreeRandom, OpenAreasOnly) == 0x000069, "Member 'UEnvQueryGenerator_KytOctreeRandom::OpenAreasOnly' has a wrong offset!");
static_assert(offsetof(UEnvQueryGenerator_KytOctreeRandom, PointRadius) == 0x00006C, "Member 'UEnvQueryGenerator_KytOctreeRandom::PointRadius' has a wrong offset!");
static_assert(offsetof(UEnvQueryGenerator_KytOctreeRandom, RadiusSource) == 0x000070, "Member 'UEnvQueryGenerator_KytOctreeRandom::RadiusSource' has a wrong offset!");
static_assert(offsetof(UEnvQueryGenerator_KytOctreeRandom, ShipRadius) == 0x000074, "Member 'UEnvQueryGenerator_KytOctreeRandom::ShipRadius' has a wrong offset!");
static_assert(offsetof(UEnvQueryGenerator_KytOctreeRandom, RequestedPoints) == 0x000078, "Member 'UEnvQueryGenerator_KytOctreeRandom::RequestedPoints' has a wrong offset!");

// Class KytheraPlugin.EnvQueryGenerator_KytOctreeRandomNavigable
// 0x0208 (0x0258 - 0x0050)
class UEnvQueryGenerator_KytOctreeRandomNavigable final : public UEnvQueryGenerator_KytBase
{
public:
	struct FAIDataProviderFloatValue              MinRadius;                                         // 0x0050(0x0038)(Edit, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FAIDataProviderFloatValue              MaxRadius;                                         // 0x0088(0x0038)(Edit, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FAIDataProviderFloatValue              PathDistanceRatio;                                 // 0x00C0(0x0038)(Edit, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FAIDataProviderFloatValue              Angle;                                             // 0x00F8(0x0038)(Edit, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FVector                                ConeDirection;                                     // 0x0130(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAIDataProviderBoolValue               AvoidDynamicObstacles;                             // 0x0140(0x0038)(Edit, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FAIDataProviderBoolValue               OpenAreasOnly;                                     // 0x0178(0x0038)(Edit, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FAIDataProviderFloatValue              PointRadius;                                       // 0x01B0(0x0038)(Edit, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FAIDataProviderFloatValue              ShipRadius;                                        // 0x01E8(0x0038)(Edit, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FAIDataProviderIntValue                RequestedPoints;                                   // 0x0220(0x0038)(Edit, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EnvQueryGenerator_KytOctreeRandomNavigable">();
	}
	static class UEnvQueryGenerator_KytOctreeRandomNavigable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEnvQueryGenerator_KytOctreeRandomNavigable>();
	}
};
static_assert(alignof(UEnvQueryGenerator_KytOctreeRandomNavigable) == 0x000008, "Wrong alignment on UEnvQueryGenerator_KytOctreeRandomNavigable");
static_assert(sizeof(UEnvQueryGenerator_KytOctreeRandomNavigable) == 0x000258, "Wrong size on UEnvQueryGenerator_KytOctreeRandomNavigable");
static_assert(offsetof(UEnvQueryGenerator_KytOctreeRandomNavigable, MinRadius) == 0x000050, "Member 'UEnvQueryGenerator_KytOctreeRandomNavigable::MinRadius' has a wrong offset!");
static_assert(offsetof(UEnvQueryGenerator_KytOctreeRandomNavigable, MaxRadius) == 0x000088, "Member 'UEnvQueryGenerator_KytOctreeRandomNavigable::MaxRadius' has a wrong offset!");
static_assert(offsetof(UEnvQueryGenerator_KytOctreeRandomNavigable, PathDistanceRatio) == 0x0000C0, "Member 'UEnvQueryGenerator_KytOctreeRandomNavigable::PathDistanceRatio' has a wrong offset!");
static_assert(offsetof(UEnvQueryGenerator_KytOctreeRandomNavigable, Angle) == 0x0000F8, "Member 'UEnvQueryGenerator_KytOctreeRandomNavigable::Angle' has a wrong offset!");
static_assert(offsetof(UEnvQueryGenerator_KytOctreeRandomNavigable, ConeDirection) == 0x000130, "Member 'UEnvQueryGenerator_KytOctreeRandomNavigable::ConeDirection' has a wrong offset!");
static_assert(offsetof(UEnvQueryGenerator_KytOctreeRandomNavigable, AvoidDynamicObstacles) == 0x000140, "Member 'UEnvQueryGenerator_KytOctreeRandomNavigable::AvoidDynamicObstacles' has a wrong offset!");
static_assert(offsetof(UEnvQueryGenerator_KytOctreeRandomNavigable, OpenAreasOnly) == 0x000178, "Member 'UEnvQueryGenerator_KytOctreeRandomNavigable::OpenAreasOnly' has a wrong offset!");
static_assert(offsetof(UEnvQueryGenerator_KytOctreeRandomNavigable, PointRadius) == 0x0001B0, "Member 'UEnvQueryGenerator_KytOctreeRandomNavigable::PointRadius' has a wrong offset!");
static_assert(offsetof(UEnvQueryGenerator_KytOctreeRandomNavigable, ShipRadius) == 0x0001E8, "Member 'UEnvQueryGenerator_KytOctreeRandomNavigable::ShipRadius' has a wrong offset!");
static_assert(offsetof(UEnvQueryGenerator_KytOctreeRandomNavigable, RequestedPoints) == 0x000220, "Member 'UEnvQueryGenerator_KytOctreeRandomNavigable::RequestedPoints' has a wrong offset!");

// Class KytheraPlugin.KytCostRanking
// 0x0010 (0x0040 - 0x0030)
class UKytCostRanking final : public UDataAsset
{
public:
	TArray<struct FAreaCostLabelData>             AreaCostRanking;                                   // 0x0030(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, ZeroConstructor, DisableEditOnTemplate, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KytCostRanking">();
	}
	static class UKytCostRanking* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKytCostRanking>();
	}
};
static_assert(alignof(UKytCostRanking) == 0x000008, "Wrong alignment on UKytCostRanking");
static_assert(sizeof(UKytCostRanking) == 0x000040, "Wrong size on UKytCostRanking");
static_assert(offsetof(UKytCostRanking, AreaCostRanking) == 0x000030, "Member 'UKytCostRanking::AreaCostRanking' has a wrong offset!");

// Class KytheraPlugin.EnvQueryGenerator_KytRadialPoint
// 0x0120 (0x0170 - 0x0050)
class UEnvQueryGenerator_KytRadialPoint final : public UEnvQueryGenerator_KytBase
{
public:
	struct FAIDataProviderFloatValue              Density;                                           // 0x0050(0x0038)(Edit, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FAIDataProviderFloatValue              Radius;                                            // 0x0088(0x0038)(Edit, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FAIDataProviderIntValue                Spokes;                                            // 0x00C0(0x0038)(Edit, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FAIDataProviderIntValue                NumberOfRings;                                     // 0x00F8(0x0038)(Edit, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TSubclassOf<class UEnvQueryContext>           Origin;                                            // 0x0130(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAIDataProviderBoolValue               Reachable;                                         // 0x0138(0x0038)(Edit, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EnvQueryGenerator_KytRadialPoint">();
	}
	static class UEnvQueryGenerator_KytRadialPoint* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEnvQueryGenerator_KytRadialPoint>();
	}
};
static_assert(alignof(UEnvQueryGenerator_KytRadialPoint) == 0x000008, "Wrong alignment on UEnvQueryGenerator_KytRadialPoint");
static_assert(sizeof(UEnvQueryGenerator_KytRadialPoint) == 0x000170, "Wrong size on UEnvQueryGenerator_KytRadialPoint");
static_assert(offsetof(UEnvQueryGenerator_KytRadialPoint, Density) == 0x000050, "Member 'UEnvQueryGenerator_KytRadialPoint::Density' has a wrong offset!");
static_assert(offsetof(UEnvQueryGenerator_KytRadialPoint, Radius) == 0x000088, "Member 'UEnvQueryGenerator_KytRadialPoint::Radius' has a wrong offset!");
static_assert(offsetof(UEnvQueryGenerator_KytRadialPoint, Spokes) == 0x0000C0, "Member 'UEnvQueryGenerator_KytRadialPoint::Spokes' has a wrong offset!");
static_assert(offsetof(UEnvQueryGenerator_KytRadialPoint, NumberOfRings) == 0x0000F8, "Member 'UEnvQueryGenerator_KytRadialPoint::NumberOfRings' has a wrong offset!");
static_assert(offsetof(UEnvQueryGenerator_KytRadialPoint, Origin) == 0x000130, "Member 'UEnvQueryGenerator_KytRadialPoint::Origin' has a wrong offset!");
static_assert(offsetof(UEnvQueryGenerator_KytRadialPoint, Reachable) == 0x000138, "Member 'UEnvQueryGenerator_KytRadialPoint::Reachable' has a wrong offset!");

// Class KytheraPlugin.EnvQueryGenerator_KytRandomPoint
// 0x00B0 (0x0100 - 0x0050)
class UEnvQueryGenerator_KytRandomPoint final : public UEnvQueryGenerator_KytBase
{
public:
	struct FAIDataProviderFloatValue              Radius;                                            // 0x0050(0x0038)(Edit, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FAIDataProviderIntValue                NumPoints;                                         // 0x0088(0x0038)(Edit, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FAIDataProviderBoolValue               Reachable;                                         // 0x00C0(0x0038)(Edit, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TSubclassOf<class UEnvQueryContext>           Origin;                                            // 0x00F8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EnvQueryGenerator_KytRandomPoint">();
	}
	static class UEnvQueryGenerator_KytRandomPoint* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEnvQueryGenerator_KytRandomPoint>();
	}
};
static_assert(alignof(UEnvQueryGenerator_KytRandomPoint) == 0x000008, "Wrong alignment on UEnvQueryGenerator_KytRandomPoint");
static_assert(sizeof(UEnvQueryGenerator_KytRandomPoint) == 0x000100, "Wrong size on UEnvQueryGenerator_KytRandomPoint");
static_assert(offsetof(UEnvQueryGenerator_KytRandomPoint, Radius) == 0x000050, "Member 'UEnvQueryGenerator_KytRandomPoint::Radius' has a wrong offset!");
static_assert(offsetof(UEnvQueryGenerator_KytRandomPoint, NumPoints) == 0x000088, "Member 'UEnvQueryGenerator_KytRandomPoint::NumPoints' has a wrong offset!");
static_assert(offsetof(UEnvQueryGenerator_KytRandomPoint, Reachable) == 0x0000C0, "Member 'UEnvQueryGenerator_KytRandomPoint::Reachable' has a wrong offset!");
static_assert(offsetof(UEnvQueryGenerator_KytRandomPoint, Origin) == 0x0000F8, "Member 'UEnvQueryGenerator_KytRandomPoint::Origin' has a wrong offset!");

// Class KytheraPlugin.KytCSNNetworkData
// 0x0010 (0x0038 - 0x0028)
class UKytCSNNetworkData final : public UObject
{
public:
	TArray<uint8>                                 Content;                                           // 0x0028(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KytCSNNetworkData">();
	}
	static class UKytCSNNetworkData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKytCSNNetworkData>();
	}
};
static_assert(alignof(UKytCSNNetworkData) == 0x000008, "Wrong alignment on UKytCSNNetworkData");
static_assert(sizeof(UKytCSNNetworkData) == 0x000038, "Wrong size on UKytCSNNetworkData");
static_assert(offsetof(UKytCSNNetworkData, Content) == 0x000028, "Member 'UKytCSNNetworkData::Content' has a wrong offset!");

// Class KytheraPlugin.EnvQueryTest_KytCoverIsCloseToEdge
// 0x0000 (0x01F8 - 0x01F8)
class UEnvQueryTest_KytCoverIsCloseToEdge final : public UEnvQueryTest
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EnvQueryTest_KytCoverIsCloseToEdge">();
	}
	static class UEnvQueryTest_KytCoverIsCloseToEdge* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEnvQueryTest_KytCoverIsCloseToEdge>();
	}
};
static_assert(alignof(UEnvQueryTest_KytCoverIsCloseToEdge) == 0x000008, "Wrong alignment on UEnvQueryTest_KytCoverIsCloseToEdge");
static_assert(sizeof(UEnvQueryTest_KytCoverIsCloseToEdge) == 0x0001F8, "Wrong size on UEnvQueryTest_KytCoverIsCloseToEdge");

// Class KytheraPlugin.CSNBubble
// 0x0030 (0x0250 - 0x0220)
class ACSNBubble final : public AActor
{
public:
	class UKytCSNBubbleType*                      BubblePresets;                                     // 0x0220(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ActivePreset;                                      // 0x0228(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMeshComponent*                   Mesh;                                              // 0x0238(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_240[0x10];                                     // 0x0240(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CSNBubble">();
	}
	static class ACSNBubble* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACSNBubble>();
	}
};
static_assert(alignof(ACSNBubble) == 0x000008, "Wrong alignment on ACSNBubble");
static_assert(sizeof(ACSNBubble) == 0x000250, "Wrong size on ACSNBubble");
static_assert(offsetof(ACSNBubble, BubblePresets) == 0x000220, "Member 'ACSNBubble::BubblePresets' has a wrong offset!");
static_assert(offsetof(ACSNBubble, ActivePreset) == 0x000228, "Member 'ACSNBubble::ActivePreset' has a wrong offset!");
static_assert(offsetof(ACSNBubble, Mesh) == 0x000238, "Member 'ACSNBubble::Mesh' has a wrong offset!");

// Class KytheraPlugin.EnvQueryTest_KytIsCoverInUse
// 0x0008 (0x0200 - 0x01F8)
class UEnvQueryTest_KytIsCoverInUse final : public UEnvQueryTest
{
public:
	EPointIsOccupied                              SearchType;                                        // 0x01F8(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EnvQueryTest_KytIsCoverInUse">();
	}
	static class UEnvQueryTest_KytIsCoverInUse* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEnvQueryTest_KytIsCoverInUse>();
	}
};
static_assert(alignof(UEnvQueryTest_KytIsCoverInUse) == 0x000008, "Wrong alignment on UEnvQueryTest_KytIsCoverInUse");
static_assert(sizeof(UEnvQueryTest_KytIsCoverInUse) == 0x000200, "Wrong size on UEnvQueryTest_KytIsCoverInUse");
static_assert(offsetof(UEnvQueryTest_KytIsCoverInUse, SearchType) == 0x0001F8, "Member 'UEnvQueryTest_KytIsCoverInUse::SearchType' has a wrong offset!");

// Class KytheraPlugin.EnvQueryTest_KytIsRailBlocked
// 0x0000 (0x01F8 - 0x01F8)
class UEnvQueryTest_KytIsRailBlocked final : public UEnvQueryTest
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EnvQueryTest_KytIsRailBlocked">();
	}
	static class UEnvQueryTest_KytIsRailBlocked* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEnvQueryTest_KytIsRailBlocked>();
	}
};
static_assert(alignof(UEnvQueryTest_KytIsRailBlocked) == 0x000008, "Wrong alignment on UEnvQueryTest_KytIsRailBlocked");
static_assert(sizeof(UEnvQueryTest_KytIsRailBlocked) == 0x0001F8, "Wrong size on UEnvQueryTest_KytIsRailBlocked");

// Class KytheraPlugin.EnvQueryTest_KytOctreePathfind
// 0x0088 (0x0280 - 0x01F8)
class UEnvQueryTest_KytOctreePathfind final : public UEnvQueryTest
{
public:
	EEnvTestPathfinding                           TestMode;                                          // 0x01F8(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UEnvQueryContext>           Context;                                           // 0x0200(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAIDataProviderBoolValue               PathFromContext;                                   // 0x0208(0x0038)(Edit, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FAIDataProviderBoolValue               SkipUnreachable;                                   // 0x0240(0x0038)(Edit, DisableEditOnInstance, ContainsInstancedReference, AdvancedDisplay, NativeAccessSpecifierPublic)
	float                                         MaxNavigationRadius;                               // 0x0278(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_27C[0x4];                                      // 0x027C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EnvQueryTest_KytOctreePathfind">();
	}
	static class UEnvQueryTest_KytOctreePathfind* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEnvQueryTest_KytOctreePathfind>();
	}
};
static_assert(alignof(UEnvQueryTest_KytOctreePathfind) == 0x000008, "Wrong alignment on UEnvQueryTest_KytOctreePathfind");
static_assert(sizeof(UEnvQueryTest_KytOctreePathfind) == 0x000280, "Wrong size on UEnvQueryTest_KytOctreePathfind");
static_assert(offsetof(UEnvQueryTest_KytOctreePathfind, TestMode) == 0x0001F8, "Member 'UEnvQueryTest_KytOctreePathfind::TestMode' has a wrong offset!");
static_assert(offsetof(UEnvQueryTest_KytOctreePathfind, Context) == 0x000200, "Member 'UEnvQueryTest_KytOctreePathfind::Context' has a wrong offset!");
static_assert(offsetof(UEnvQueryTest_KytOctreePathfind, PathFromContext) == 0x000208, "Member 'UEnvQueryTest_KytOctreePathfind::PathFromContext' has a wrong offset!");
static_assert(offsetof(UEnvQueryTest_KytOctreePathfind, SkipUnreachable) == 0x000240, "Member 'UEnvQueryTest_KytOctreePathfind::SkipUnreachable' has a wrong offset!");
static_assert(offsetof(UEnvQueryTest_KytOctreePathfind, MaxNavigationRadius) == 0x000278, "Member 'UEnvQueryTest_KytOctreePathfind::MaxNavigationRadius' has a wrong offset!");

// Class KytheraPlugin.EnvQueryTest_KytPathfinding
// 0x0080 (0x0278 - 0x01F8)
class UEnvQueryTest_KytPathfinding final : public UEnvQueryTest
{
public:
	EEnvTestPathfinding                           TestMode;                                          // 0x01F8(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UEnvQueryContext>           Context;                                           // 0x0200(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAIDataProviderBoolValue               PathFromContext;                                   // 0x0208(0x0038)(Edit, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FAIDataProviderBoolValue               SkipUnreachable;                                   // 0x0240(0x0038)(Edit, DisableEditOnInstance, ContainsInstancedReference, AdvancedDisplay, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EnvQueryTest_KytPathfinding">();
	}
	static class UEnvQueryTest_KytPathfinding* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEnvQueryTest_KytPathfinding>();
	}
};
static_assert(alignof(UEnvQueryTest_KytPathfinding) == 0x000008, "Wrong alignment on UEnvQueryTest_KytPathfinding");
static_assert(sizeof(UEnvQueryTest_KytPathfinding) == 0x000278, "Wrong size on UEnvQueryTest_KytPathfinding");
static_assert(offsetof(UEnvQueryTest_KytPathfinding, TestMode) == 0x0001F8, "Member 'UEnvQueryTest_KytPathfinding::TestMode' has a wrong offset!");
static_assert(offsetof(UEnvQueryTest_KytPathfinding, Context) == 0x000200, "Member 'UEnvQueryTest_KytPathfinding::Context' has a wrong offset!");
static_assert(offsetof(UEnvQueryTest_KytPathfinding, PathFromContext) == 0x000208, "Member 'UEnvQueryTest_KytPathfinding::PathFromContext' has a wrong offset!");
static_assert(offsetof(UEnvQueryTest_KytPathfinding, SkipUnreachable) == 0x000240, "Member 'UEnvQueryTest_KytPathfinding::SkipUnreachable' has a wrong offset!");

// Class KytheraPlugin.KytCSNObstacleComponent
// 0x0030 (0x00E0 - 0x00B0)
class UKytCSNObstacleComponent final : public UActorComponent
{
public:
	uint8                                         Pad_B0[0x28];                                      // 0x00B0(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Radius;                                            // 0x00D8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KytCSNObstacleComponent">();
	}
	static class UKytCSNObstacleComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKytCSNObstacleComponent>();
	}
};
static_assert(alignof(UKytCSNObstacleComponent) == 0x000008, "Wrong alignment on UKytCSNObstacleComponent");
static_assert(sizeof(UKytCSNObstacleComponent) == 0x0000E0, "Wrong size on UKytCSNObstacleComponent");
static_assert(offsetof(UKytCSNObstacleComponent, Radius) == 0x0000D8, "Member 'UKytCSNObstacleComponent::Radius' has a wrong offset!");

// Class KytheraPlugin.EnvQueryTest_KytProject
// 0x0018 (0x0210 - 0x01F8)
class UEnvQueryTest_KytProject final : public UEnvQueryTest
{
public:
	TSubclassOf<class UEnvQueryContext>           Context;                                           // 0x01F8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                Tolerance;                                         // 0x0200(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_20C[0x4];                                      // 0x020C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EnvQueryTest_KytProject">();
	}
	static class UEnvQueryTest_KytProject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEnvQueryTest_KytProject>();
	}
};
static_assert(alignof(UEnvQueryTest_KytProject) == 0x000008, "Wrong alignment on UEnvQueryTest_KytProject");
static_assert(sizeof(UEnvQueryTest_KytProject) == 0x000210, "Wrong size on UEnvQueryTest_KytProject");
static_assert(offsetof(UEnvQueryTest_KytProject, Context) == 0x0001F8, "Member 'UEnvQueryTest_KytProject::Context' has a wrong offset!");
static_assert(offsetof(UEnvQueryTest_KytProject, Tolerance) == 0x000200, "Member 'UEnvQueryTest_KytProject::Tolerance' has a wrong offset!");

// Class KytheraPlugin.KytBTTask_ShipPathTo
// 0x0020 (0x00B8 - 0x0098)
class UKytBTTask_ShipPathTo final : public UBTTask_BlackboardBase
{
public:
	float                                         AbsoluteSpeed;                                     // 0x0098(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RelativeSpeed;                                     // 0x009C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EndDistance;                                       // 0x00A0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AbsoluteSpeedAtDestination;                        // 0x00A4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RelativeSpeedAtDestination;                        // 0x00A8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxDistanceFromSurface;                            // 0x00AC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxAvoidanceStuckTime;                             // 0x00B0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KytBTTask_ShipPathTo">();
	}
	static class UKytBTTask_ShipPathTo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKytBTTask_ShipPathTo>();
	}
};
static_assert(alignof(UKytBTTask_ShipPathTo) == 0x000008, "Wrong alignment on UKytBTTask_ShipPathTo");
static_assert(sizeof(UKytBTTask_ShipPathTo) == 0x0000B8, "Wrong size on UKytBTTask_ShipPathTo");
static_assert(offsetof(UKytBTTask_ShipPathTo, AbsoluteSpeed) == 0x000098, "Member 'UKytBTTask_ShipPathTo::AbsoluteSpeed' has a wrong offset!");
static_assert(offsetof(UKytBTTask_ShipPathTo, RelativeSpeed) == 0x00009C, "Member 'UKytBTTask_ShipPathTo::RelativeSpeed' has a wrong offset!");
static_assert(offsetof(UKytBTTask_ShipPathTo, EndDistance) == 0x0000A0, "Member 'UKytBTTask_ShipPathTo::EndDistance' has a wrong offset!");
static_assert(offsetof(UKytBTTask_ShipPathTo, AbsoluteSpeedAtDestination) == 0x0000A4, "Member 'UKytBTTask_ShipPathTo::AbsoluteSpeedAtDestination' has a wrong offset!");
static_assert(offsetof(UKytBTTask_ShipPathTo, RelativeSpeedAtDestination) == 0x0000A8, "Member 'UKytBTTask_ShipPathTo::RelativeSpeedAtDestination' has a wrong offset!");
static_assert(offsetof(UKytBTTask_ShipPathTo, MaxDistanceFromSurface) == 0x0000AC, "Member 'UKytBTTask_ShipPathTo::MaxDistanceFromSurface' has a wrong offset!");
static_assert(offsetof(UKytBTTask_ShipPathTo, MaxAvoidanceStuckTime) == 0x0000B0, "Member 'UKytBTTask_ShipPathTo::MaxAvoidanceStuckTime' has a wrong offset!");

// Class KytheraPlugin.EnvQueryTest_KytSameRail
// 0x0000 (0x01F8 - 0x01F8)
class UEnvQueryTest_KytSameRail final : public UEnvQueryTest
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EnvQueryTest_KytSameRail">();
	}
	static class UEnvQueryTest_KytSameRail* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEnvQueryTest_KytSameRail>();
	}
};
static_assert(alignof(UEnvQueryTest_KytSameRail) == 0x000008, "Wrong alignment on UEnvQueryTest_KytSameRail");
static_assert(sizeof(UEnvQueryTest_KytSameRail) == 0x0001F8, "Wrong size on UEnvQueryTest_KytSameRail");

// Class KytheraPlugin.EnvQueryTest_KytTags
// 0x0018 (0x0210 - 0x01F8)
class UEnvQueryTest_KytTags final : public UEnvQueryTest
{
public:
	TArray<class FName>                           TagToSearch;                                       // 0x01F8(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	ETagMatchType                                 TagMatchType;                                      // 0x0208(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_209[0x7];                                      // 0x0209(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EnvQueryTest_KytTags">();
	}
	static class UEnvQueryTest_KytTags* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEnvQueryTest_KytTags>();
	}
};
static_assert(alignof(UEnvQueryTest_KytTags) == 0x000008, "Wrong alignment on UEnvQueryTest_KytTags");
static_assert(sizeof(UEnvQueryTest_KytTags) == 0x000210, "Wrong size on UEnvQueryTest_KytTags");
static_assert(offsetof(UEnvQueryTest_KytTags, TagToSearch) == 0x0001F8, "Member 'UEnvQueryTest_KytTags::TagToSearch' has a wrong offset!");
static_assert(offsetof(UEnvQueryTest_KytTags, TagMatchType) == 0x000208, "Member 'UEnvQueryTest_KytTags::TagMatchType' has a wrong offset!");

// Class KytheraPlugin.KytBTFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UKytBTFunctionLibrary final : public UBTFunctionLibrary
{
public:
	static class UKytBlackboard* GetBlackboardValueAsKytBlackBoard(class UBTNode* NodeOwner, const struct FBlackboardKeySelector& Key);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KytBTFunctionLibrary">();
	}
	static class UKytBTFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKytBTFunctionLibrary>();
	}
};
static_assert(alignof(UKytBTFunctionLibrary) == 0x000008, "Wrong alignment on UKytBTFunctionLibrary");
static_assert(sizeof(UKytBTFunctionLibrary) == 0x000028, "Wrong size on UKytBTFunctionLibrary");

// Class KytheraPlugin.KytNavOctree
// 0x0060 (0x0280 - 0x0220)
class AKytNavOctree final : public AActor
{
public:
	float                                         CellSize;                                          // 0x0220(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
