#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Campaign_InGameMapMissionImage

#include "Basic.hpp"

#include "GroundBranch_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_Campaign_InGameMapMissionImage.WBP_Campaign_InGameMapMissionImage_C.ExecuteUbergraph_WBP_Campaign_InGameMapMissionImage
// 0x02E8 (0x02E8 - 0x0000)
struct WBP_Campaign_InGameMapMissionImage_C_ExecuteUbergraph_WBP_Campaign_InGameMapMissionImage final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSoftObjectPath                        CallFunc_MakeSoftObjectPath_ReturnValue;           // 0x0010(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UObject>                 CallFunc_Conv_SoftObjPathToSoftObjRef_ReturnValue; // 0x0028(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGBMapMarker                           K2Node_CustomEvent_MapMarkerInfo;                  // 0x0058(0x00B0)()
	int32                                         K2Node_CustomEvent_WidgetIndex;                    // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetMissionTitleFromSoftRef_MissionObjectiveTitle; // 0x0110(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetMissionTitleFromSoftRef_bPrimaryObjective; // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UObject>                    CallFunc_BlueprintSyncLoadClass_ReturnValue;       // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsWBP_ME_Map_Symbol;       // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_139[0x3];                                      // 0x0139(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_ME_MapSymbol_C*                    CallFunc_Create_ReturnValue;                       // 0x0140(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOverlaySlot*                           CallFunc_AddChildToOverlay_ReturnValue;            // 0x0148(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0154(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_155[0x3];                                      // 0x0155(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGBMapMarker                           CallFunc_Array_Get_Item;                           // 0x0158(0x00B0)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20C[0x4];                                      // 0x020C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_SoftObjectReferenceToString_ReturnValue; // 0x0210(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_221[0x7];                                      // 0x0221(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetBaseFilename_ReturnValue;              // 0x0228(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0239(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x023A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x023B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23C[0x4];                                      // 0x023C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetBaseFilename_ReturnValue_1;            // 0x0240(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0251(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_252[0x2];                                      // 0x0252(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0254(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0264(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_265[0x3];                                      // 0x0265(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable;                              // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_271[0x7];                                      // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0278(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_289[0x7];                                      // 0x0289(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0290(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A9[0x3];                                      // 0x02A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_NewScale;                       // 0x02AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x02B0(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_Array_Get_Item_1;                         // 0x02C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_ME_MapSymbol_C*                    K2Node_DynamicCast_AsWBP_ME_Map_Symbol;            // 0x02D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D9[0x3];                                      // 0x02D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x02DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Campaign_InGameMapMissionImage_C_ExecuteUbergraph_WBP_Campaign_InGameMapMissionImage) == 0x000008, "Wrong alignment on WBP_Campaign_InGameMapMissionImage_C_ExecuteUbergraph_WBP_Campaign_InGameMapMissionImage");
static_assert(sizeof(WBP_Campaign_InGameMapMissionImage_C_ExecuteUbergraph_WBP_Campaign_InGameMapMissionImage) == 0x0002E8, "Wrong size on WBP_Campaign_InGameMapMissionImage_C_ExecuteUbergraph_WBP_Campaign_InGameMapMissionImage");
static_assert(offsetof(WBP_Campaign_InGameMapMissionImage_C_ExecuteUbergraph_WBP_Campaign_InGameMapMissionImage, EntryPoint) == 0x000000, "Member 'WBP_Campaign_InGameMapMissionImage_C_ExecuteUbergraph_WBP_Campaign_InGameMapMissionImage::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Campaign_InGameMapMissionImage_C_ExecuteUbergraph_WBP_Campaign_InGameMapMissionImage, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_Campaign_InGameMapMissionImage_C_ExecuteUbergraph_WBP_Campaign_InGameMapMissionImage::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Campaign_InGameMapMissionImage_C_ExecuteUbergraph_WBP_Campaign_InGameMapMissionImage, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_Campaign_InGameMapMissionImage_C_ExecuteUbergraph_WBP_Campaign_InGameMapMissionImage::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Campaign_InGameMapMissionImage_C_ExecuteUbergraph_WBP_Campaign_InGameMapMissionImage, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'WBP_Campaign_InGameMapMissionImage_C_ExecuteUbergraph_WBP_Campaign_InGameMapMissionImage::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Campaign_InGameMapMissionImage_C_ExecuteUbergraph_WBP_Campaign_InGameMapMissionImage, CallFunc_MakeSoftObjectPath_ReturnValue) == 0x000010, "Member 'WBP_Campaign_InGameMapMissionImage_C_ExecuteUbergraph_WBP_Campaign_InGameMapMissionImage::CallFunc_MakeSoftObjectPath_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Campaign_InGameMapMissionImage_C_ExecuteUbergraph_WBP_Campaign_InGameMapMissionImage, CallFunc_Conv_SoftObjPathToSoftObjRef_ReturnValue) == 0x000028, "Member 'WBP_Campaign_InGameMapMissionImage_C_ExecuteUbergraph_WBP_Campaign_InGameMapMissionImage::CallFunc_Conv_SoftObjPathToSoftObjRef_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Campaign_InGameMapMissionImage_C_ExecuteUbergraph_WBP_Campaign_InGameMapMissionImage, Temp_int_Array_Index_Variable_1) == 0x000050, "Member 'WBP_Campaign_InGameMapMissionImage_C_ExecuteUbergraph_WBP_Campaign_InGameMapMissionImage::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Campaign_InGameMapMissionImage_C_ExecuteUbergraph_WBP_Campaign_InGameMapMissionImage, K2Node_CustomEvent_MapMarkerInfo) == 0x000058, "Member 'WBP_Campaign_InGameMapMissionImage_C_ExecuteUbergraph_WBP_Campaign_InGameMapMissionImage::K2Node_CustomEvent_MapMarkerInfo' has a wrong offset!");
static_assert(offsetof(WBP_Campaign_InGameMapMissionImage_C_ExecuteUbergraph_WBP_Campaign_InGameMapMissionImage, K2Node_CustomEvent_WidgetIndex) == 0x000108, "Member 'WBP_Campaign_InGameMapMissionImage_C_ExecuteUbergraph_WBP_Campaign_InGameMapMissionImage::K2Node_CustomEvent_WidgetIndex' has a wrong offset!");
static_assert(offsetof(WBP_Campaign_InGameMapMissionImage_C_ExecuteUbergraph_WBP_Campaign_InGameMapMissionImage, CallFunc_GetMissionTitleFromSoftRef_MissionObjectiveTitle) == 0x000110, "Member 'WBP_Campaign_InGameMapMissionImage_C_ExecuteUbergraph_WBP_Campaign_InGameMapMissionImage::CallFunc_GetMissionTitleFromSoftRef_MissionObjectiveTitle' has a wrong offset!");
static_assert(offsetof(WBP_Campaign_InGameMapMissionImage_C_ExecuteUbergraph_WBP_Campaign_InGameMapMissionImage, CallFunc_GetMissionTitleFromSoftRef_bPrimaryObjective) == 0x000120, "Member 'WBP_Campaign_InGameMapMissionImage_C_ExecuteUbergraph_WBP_Campaign_InGameMapMissionImage::CallFunc_GetMissionTitleFromSoftRef_bPrimaryObjective' has a wrong offset!");
static_assert(offsetof(WBP_Campaign_InGameMapMissionImage_C_ExecuteUbergraph_WBP_Campaign_InGameMapMissionImage, CallFunc_BlueprintSyncLoadClass_ReturnValue) == 0x000128, "Member 'WBP_Campaign_InGameMapMissionImage_C_ExecuteUbergraph_WBP_Campaign_InGameMapMissionImage::CallFunc_BlueprintSyncLoadClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Campaign_InGameMapMissionImage_C_ExecuteUbergraph_WBP_Campaign_InGameMapMissionImage, K2Node_ClassDynamicCast_AsWBP_ME_Map_Symbol) == 0x000130, "Member 'WBP_Campaign_InGameMapMissionImage_C_ExecuteUbergraph_WBP_Campaign_InGameMapMissionImage::K2Node_ClassDynamicCast_AsWBP_ME_Map_Symbol' has a wrong offset!");
static_assert(offsetof(WBP_Campaign_InGameMapMissionImage_C_ExecuteUbergraph_WBP_Campaign_InGameMapMissionImage, K2Node_ClassDynamicCast_bSuccess) == 0x000138, "Member 'WBP_Campaign_InGameMapMissionImage_C_ExecuteUbergraph_WBP_Campaign_InGameMapMissionImage::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Campaign_InGameMapMissionImage_C_ExecuteUbergraph_WBP_Campaign_InGameMapMissionImage, Temp_int_Loop_Counter_Variable_1) == 0x00013C, "Member 'WBP_Campaign_InGameMapMissionImage_C_ExecuteUbergraph_WBP_Campaign_InGameMapMissionImage::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Campaign_InGameMapMissionImage_C_ExecuteUbergraph_WBP_Campaign_InGameMapMissionImage, CallFunc_Create_ReturnValue) == 0x000140, "Member 'WBP_Campaign_InGameMapMissionImage_C_ExecuteUbergraph_WBP_Campaign_InGameMapMissionImage::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Campaign_InGameMapMissionImage_C_ExecuteUbergraph_WBP_Campaign_InGameMapMissionImage, CallFunc_AddChildToOverlay_ReturnValue) == 0x000148, "Member 'WBP_Campaign_InGameMapMissionImage_C_ExecuteUbergraph_WBP_Campaign_InGameMapMissionImage::CallFunc_AddChildToOverlay_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Campaign_InGameMapMissionImage_C_ExecuteUbergraph_WBP_Campaign_InGameMapMissionImage, CallFunc_Add_IntInt_ReturnValue_1) == 0x000150, "Member 'WBP_Campaign_InGameMapMissionImage_C_ExecuteUbergraph_WBP_Campaign_InGameMapMissionImage::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Campaign_InGameMapMissionImage_C_ExecuteUbergraph_WBP_Campaign_InGameMapMissionImage, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000154, "Member 'WBP_Campaign_InGameMapMissionImage_C_ExecuteUbergraph_WBP_Campaign_InGameMapMissionImage::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Campaign_InGameMapMissionImage_C_ExecuteUbergraph_WBP_Campaign_InGameMapMissionImage, CallFunc_Array_Get_Item) == 0x000158, "Member 'WBP_Campaign_InGameMapMissionImage_C_ExecuteUbergraph_WBP_Campaign_InGameMapMissionImage::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Campaign_InGameMapMissionImage_C_ExecuteUbergraph_WBP_Campaign_InGameMapMissionImage, CallFunc_Array_Length_ReturnValue) == 0x000208, "Member 'WBP_Campaign_InGameMapMissionImage_C_ExecuteUbergraph_WBP_Campaign_InGameMapMissionImage::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Campaign_InGameMapMissionImage_C_ExecuteUbergraph_WBP_Campaign_InGameMapMissionImage, CallFunc_Conv_SoftObjectReferenceToString_ReturnValue) == 0x000210, "Member 'WBP_Campaign_InGameMapMissionImage_C_ExecuteUbergraph_WBP_Campaign_InGameMapMissionImage::CallFunc_Conv_SoftObjectReferenceToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Campaign_InGameMapMissionImage_C_ExecuteUbergraph_WBP_Campaign_InGameMapMissionImage, CallFunc_Less_IntInt_ReturnValue) == 0x000220, "Member 'WBP_Campaign_InGameMapMissionImage_C_ExecuteUbergraph_WBP_Campaign_InGameMapMissionImage::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Campaign_InGameMapMissionImage_C_ExecuteUbergraph_WBP_Campaign_InGameMapMissionImage, CallFunc_GetBaseFilename_ReturnValue) == 0x000228, "Member 'WBP_Campaign_InGameMapMissionImage_C_ExecuteUbergraph_WBP_Campaign_InGameMapMissionImage::CallFunc_GetBaseFilename_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Campaign_InGameMapMissionImage_C_ExecuteUbergraph_WBP_Campaign_InGameMapMissionImage, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000238, "Member 'WBP_Campaign_InGameMapMissionImage_C_ExecuteUbergraph_WBP_Campaign_InGameMapMissionImage::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Campaign_InGameMapMissionImage_C_ExecuteUbergraph_WBP_Campaign_InGameMapMissionImage, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x000239, "Member 'WBP_Campaign_InGameMapMissionImage_C_ExecuteUbergraph_WBP_Campaign_InGameMapMissionImage::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Campaign_InGameMapMissionImage_C_ExecuteUbergraph_WBP_Campaign_InGameMapMissionImage, CallFunc_BooleanOR_ReturnValue) == 0x00023A, "Member 'WBP_Campaign_InGameMapMissionImage_C_ExecuteUbergraph_WBP_Campaign_InGameMapMissionImage::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Campaign_InGameMapMissionImage_C_ExecuteUbergraph_WBP_Campaign_InGameMapMissionImage, CallFunc_BooleanOR_ReturnValue_1) == 0x00023B, "Member 'WBP_Campaign_InGameMapMissionImage_C_ExecuteUbergraph_WBP_Campaign_InGameMapMissionImage::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Campaign_InGameMapMissionImage_C_ExecuteUbergraph_WBP_Campaign_InGameMapMissionImage, CallFunc_GetBaseFilename_ReturnValue_1) == 0x000240, "Member 'WBP_Campaign_InGameMapMissionImage_C_ExecuteUbergraph_WBP_Campaign_InGameMapMissionImage::CallFunc_GetBaseFilename_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Campaign_InGameMapMissionImage_C_ExecuteUbergraph_WBP_Campaign_InGameMapMissionImage, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000250, "Member 'WBP_Campaign_InGameMapMissionImage_C_ExecuteUbergraph_WBP_Campaign_InGameMapMissionImage::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Campaign_InGameMapMissionImage_C_ExecuteUbergraph_WBP_Campaign_InGameMapMissionImage, CallFunc_BooleanAND_ReturnValue) == 0x000251, "Member 'WBP_Campaign_InGameMapMissionImage_C_ExecuteUbergraph_WBP_Campaign_InGameMapMissionImage::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Campaign_InGameMapMissionImage_C_ExecuteUbergraph_WBP_Campaign_InGameMapMissionImage, K2Node_CreateDelegate_OutputDelegate) == 0x000254, "Member 'WBP_Campaign_InGameMapMissionImage_C_ExecuteUbergraph_WBP_Campaign_InGameMapMissionImage::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Campaign_InGameMapMissionImage_C_ExecuteUbergraph_WBP_Campaign_InGameMapMissionImage, CallFunc_Not_PreBool_ReturnValue) == 0x000264, "Member 'WBP_Campaign_InGameMapMissionImage_C_ExecuteUbergraph_WBP_Campaign_InGameMapMissionImage::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Campaign_InGameMapMissionImage_C_ExecuteUbergraph_WBP_Campaign_InGameMapMissionImage, Temp_object_Variable) == 0x000268, "Member 'WBP_Campaign_InGameMapMissionImage_C_ExecuteUbergraph_WBP_Campaign_InGameMapMissionImage::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Campaign_InGameMapMissionImage_C_ExecuteUbergraph_WBP_Campaign_InGameMapMissionImage, CallFunc_BooleanOR_ReturnValue_2) == 0x000270, "Member 'WBP_Campaign_InGameMapMissionImage_C_ExecuteUbergraph_WBP_Campaign_InGameMapMissionImage::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Campaign_InGameMapMissionImage_C_ExecuteUbergraph_WBP_Campaign_InGameMapMissionImage, CallFunc_GetDisplayName_ReturnValue) == 0x000278, "Member 'WBP_Campaign_InGameMapMissionImage_C_ExecuteUbergraph_WBP_Campaign_InGameMapMissionImage::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Campaign_InGameMapMissionImage_C_ExecuteUbergraph_WBP_Campaign_InGameMapMissionImage, CallFunc_BooleanAND_ReturnValue_1) == 0x000288, "Member 'WBP_Campaign_InGameMapMissionImage_C_ExecuteUbergraph_WBP_Campaign_InGameMapMissionImage::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Campaign_InGameMapMissionImage_C_ExecuteUbergraph_WBP_Campaign_InGameMapMissionImage, CallFunc_Concat_StrStr_ReturnValue) == 0x000290, "Member 'WBP_Campaign_InGameMapMissionImage_C_ExecuteUbergraph_WBP_Campaign_InGameMapMissionImage::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Campaign_InGameMapMissionImage_C_ExecuteUbergraph_WBP_Campaign_InGameMapMissionImage, K2Node_DynamicCast_AsTexture_2D) == 0x0002A0, "Member 'WBP_Campaign_InGameMapMissionImage_C_ExecuteUbergraph_WBP_Campaign_InGameMapMissionImage::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(WBP_Campaign_InGameMapMissionImage_C_ExecuteUbergraph_WBP_Campaign_InGameMapMissionImage, K2Node_DynamicCast_bSuccess) == 0x0002A8, "Member 'WBP_Campaign_InGameMapMissionImage_C_ExecuteUbergraph_WBP_Campaign_InGameMapMissionImage::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Campaign_InGameMapMissionImage_C_ExecuteUbergraph_WBP_Campaign_InGameMapMissionImage, K2Node_CustomEvent_NewScale) == 0x0002AC, "Member 'WBP_Campaign_InGameMapMissionImage_C_ExecuteUbergraph_WBP_Campaign_InGameMapMissionImage::K2Node_CustomEvent_NewScale' has a wrong offset!");
static_assert(offsetof(WBP_Campaign_InGameMapMissionImage_C_ExecuteUbergraph_WBP_Campaign_InGameMapMissionImage, CallFunc_GetAllChildren_ReturnValue) == 0x0002B0, "Member 'WBP_Campaign_InGameMapMissionImage_C_ExecuteUbergraph_WBP_Campaign_InGameMapMissionImage::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Campaign_InGameMapMissionImage_C_ExecuteUbergraph_WBP_Campaign_InGameMapMissionImage, K2Node_CustomEvent_Loaded) == 0x0002C0, "Member 'WBP_Campaign_InGameMapMissionImage_C_ExecuteUbergraph_WBP_Campaign_InGameMapMissionImage::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(WBP_Campaign_InGameMapMissionImage_C_ExecuteUbergraph_WBP_Campaign_InGameMapMissionImage, CallFunc_Array_Get_Item_1) == 0x0002C8, "Member 'WBP_Campaign_InGameMapMissionImage_C_ExecuteUbergraph_WBP_Campaign_InGameMapMissionImage::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_Campaign_InGameMapMissionImage_C_ExecuteUbergraph_WBP_Campaign_InGameMapMissionImage, K2Node_DynamicCast_AsWBP_ME_Map_Symbol) == 0x0002D0, "Member 'WBP_Campaign_InGameMapMissionImage_C_ExecuteUbergraph_WBP_Campaign_InGameMapMissionImage::K2Node_DynamicCast_AsWBP_ME_Map_Symbol' has a wrong offset!");
static_assert(offsetof(WBP_Campaign_InGameMapMissionImage_C_ExecuteUbergraph_WBP_Campaign_InGameMapMissionImage, K2Node_DynamicCast_bSuccess_1) == 0x0002D8, "Member 'WBP_Campaign_InGameMapMissionImage_C_ExecuteUbergraph_WBP_Campaign_InGameMapMissionImage::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_Campaign_InGameMapMissionImage_C_ExecuteUbergraph_WBP_Campaign_InGameMapMissionImage, CallFunc_Array_Length_ReturnValue_1) == 0x0002DC, "Member 'WBP_Campaign_InGameMapMissionImage_C_ExecuteUbergraph_WBP_Campaign_InGameMapMissionImage::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Campaign_InGameMapMissionImage_C_ExecuteUbergraph_WBP_Campaign_InGameMapMissionImage, CallFunc_Less_IntInt_ReturnValue_1) == 0x0002E0, "Member 'WBP_Campaign_InGameMapMissionImage_C_ExecuteUbergraph_WBP_Campaign_InGameMapMissionImage::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");

// Function WBP_Campaign_InGameMapMissionImage.WBP_Campaign_InGameMapMissionImage_C.ResizeAllWidgets
// 0x0004 (0x0004 - 0x0000)
struct WBP_Campaign_InGameMapMissionImage_C_ResizeAllWidgets final
{
public:
	float                                         NewScale;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Campaign_InGameMapMissionImage_C_ResizeAllWidgets) == 0x000004, "Wrong alignment on WBP_Campaign_InGameMapMissionImage_C_ResizeAllWidgets");
static_assert(sizeof(WBP_Campaign_InGameMapMissionImage_C_ResizeAllWidgets) == 0x000004, "Wrong size on WBP_Campaign_InGameMapMissionImage_C_ResizeAllWidgets");
static_assert(offsetof(WBP_Campaign_InGameMapMissionImage_C_ResizeAllWidgets, NewScale) == 0x000000, "Member 'WBP_Campaign_InGameMapMissionImage_C_ResizeAllWidgets::NewScale' has a wrong offset!");

// Function WBP_Campaign_InGameMapMissionImage.WBP_Campaign_InGameMapMissionImage_C.SpawnMapWidget
// 0x00B8 (0x00B8 - 0x0000)
struct WBP_Campaign_InGameMapMissionImage_C_SpawnMapWidget final
{
public:
	struct FGBMapMarker                           MapMarkerInfo;                                     // 0x0000(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
	int32                                         WidgetIndex;                                       // 0x00B0(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Campaign_InGameMapMissionImage_C_SpawnMapWidget) == 0x000008, "Wrong alignment on WBP_Campaign_InGameMapMissionImage_C_SpawnMapWidget");
static_assert(sizeof(WBP_Campaign_InGameMapMissionImage_C_SpawnMapWidget) == 0x0000B8, "Wrong size on WBP_Campaign_InGameMapMissionImage_C_SpawnMapWidget");
static_assert(offsetof(WBP_Campaign_InGameMapMissionImage_C_SpawnMapWidget, MapMarkerInfo) == 0x000000, "Member 'WBP_Campaign_InGameMapMissionImage_C_SpawnMapWidget::MapMarkerInfo' has a wrong offset!");
static_assert(offsetof(WBP_Campaign_InGameMapMissionImage_C_SpawnMapWidget, WidgetIndex) == 0x0000B0, "Member 'WBP_Campaign_InGameMapMissionImage_C_SpawnMapWidget::WidgetIndex' has a wrong offset!");

// Function WBP_Campaign_InGameMapMissionImage.WBP_Campaign_InGameMapMissionImage_C.OnLoaded_408F25D74633A288D4801486CE2497E2
// 0x0008 (0x0008 - 0x0000)
struct WBP_Campaign_InGameMapMissionImage_C_OnLoaded_408F25D74633A288D4801486CE2497E2 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Campaign_InGameMapMissionImage_C_OnLoaded_408F25D74633A288D4801486CE2497E2) == 0x000008, "Wrong alignment on WBP_Campaign_InGameMapMissionImage_C_OnLoaded_408F25D74633A288D4801486CE2497E2");
static_assert(sizeof(WBP_Campaign_InGameMapMissionImage_C_OnLoaded_408F25D74633A288D4801486CE2497E2) == 0x000008, "Wrong size on WBP_Campaign_InGameMapMissionImage_C_OnLoaded_408F25D74633A288D4801486CE2497E2");
static_assert(offsetof(WBP_Campaign_InGameMapMissionImage_C_OnLoaded_408F25D74633A288D4801486CE2497E2, Loaded) == 0x000000, "Member 'WBP_Campaign_InGameMapMissionImage_C_OnLoaded_408F25D74633A288D4801486CE2497E2::Loaded' has a wrong offset!");

// Function WBP_Campaign_InGameMapMissionImage.WBP_Campaign_InGameMapMissionImage_C.GetMissionTitleFromSoftRef
// 0x0158 (0x0158 - 0x0000)
struct WBP_Campaign_InGameMapMissionImage_C_GetMissionTitleFromSoftRef final
{
public:
	TSoftObjectPtr<class AGBMissionObjective>     MissionObjectiveSoftRef;                           // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class FString                                 MissionObjectiveTitle;                             // 0x0028(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          bPrimaryObjective;                                 // 0x0038(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGBMissionObjective*                    K2Node_DynamicCast_AsGBMission_Objective;          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetIsPrimaryObjective_ReturnValue;        // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetObjectiveTitle_ReturnValue;            // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_SoftObjectReferenceToString_ReturnValue; // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetActorNameWithoutSuffix_NameWithoutSuffix; // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGBSingleObjectiveData                 CallFunc_Array_Get_Item;                           // 0x00B8(0x0030)()
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetActorNameWithoutSuffix_NameWithoutSuffix_1; // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StriStri_ReturnValue;          // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGBSingleObjectiveData                 CallFunc_Array_Get_Item_1;                         // 0x0110(0x0030)()
	class FString                                 CallFunc_GetActorNameWithoutSuffix_NameWithoutSuffix_2; // 0x0140(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StriStri_ReturnValue_1;        // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Campaign_InGameMapMissionImage_C_GetMissionTitleFromSoftRef) == 0x000008, "Wrong alignment on WBP_Campaign_InGameMapMissionImage_C_GetMissionTitleFromSoftRef");
static_assert(sizeof(WBP_Campaign_InGameMapMissionImage_C_GetMissionTitleFromSoftRef) == 0x000158, "Wrong size on WBP_Campaign_InGameMapMissionImage_C_GetMissionTitleFromSoftRef");
static_assert(offsetof(WBP_Campaign_InGameMapMissionImage_C_GetMissionTitleFromSoftRef, MissionObjectiveSoftRef) == 0x000000, "Member 'WBP_Campaign_InGameMapMissionImage_C_GetMissionTitleFromSoftRef::MissionObjectiveSoftRef' has a wrong offset!");
static_assert(offsetof(WBP_Campaign_InGameMapMissionImage_C_GetMissionTitleFromSoftRef, MissionObjectiveTitle) == 0x000028, "Member 'WBP_Campaign_InGameMapMissionImage_C_GetMissionTitleFromSoftRef::MissionObjectiveTitle' has a wrong offset!");
static_assert(offsetof(WBP_Campaign_InGameMapMissionImage_C_GetMissionTitleFromSoftRef, bPrimaryObjective) == 0x000038, "Member 'WBP_Campaign_InGameMapMissionImage_C_GetMissionTitleFromSoftRef::bPrimaryObjective' has a wrong offset!");
static_assert(offsetof(WBP_Campaign_InGameMapMissionImage_C_GetMissionTitleFromSoftRef, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000040, "Member 'WBP_Campaign_InGameMapMissionImage_C_GetMissionTitleFromSoftRef::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Campaign_InGameMapMissionImage_C_GetMissionTitleFromSoftRef, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x000048, "Member 'WBP_Campaign_InGameMapMissionImage_C_GetMissionTitleFromSoftRef::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Campaign_InGameMapMissionImage_C_GetMissionTitleFromSoftRef, K2Node_DynamicCast_AsGBMission_Objective) == 0x000050, "Member 'WBP_Campaign_InGameMapMissionImage_C_GetMissionTitleFromSoftRef::K2Node_DynamicCast_AsGBMission_Objective' has a wrong offset!");
static_assert(offsetof(WBP_Campaign_InGameMapMissionImage_C_GetMissionTitleFromSoftRef, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'WBP_Campaign_InGameMapMissionImage_C_GetMissionTitleFromSoftRef::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Campaign_InGameMapMissionImage_C_GetMissionTitleFromSoftRef, CallFunc_GetIsPrimaryObjective_ReturnValue) == 0x000059, "Member 'WBP_Campaign_InGameMapMissionImage_C_GetMissionTitleFromSoftRef::CallFunc_GetIsPrimaryObjective_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Campaign_InGameMapMissionImage_C_GetMissionTitleFromSoftRef, CallFunc_GetObjectiveTitle_ReturnValue) == 0x000060, "Member 'WBP_Campaign_InGameMapMissionImage_C_GetMissionTitleFromSoftRef::CallFunc_GetObjectiveTitle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Campaign_InGameMapMissionImage_C_GetMissionTitleFromSoftRef, CallFunc_IsValid_ReturnValue) == 0x000070, "Member 'WBP_Campaign_InGameMapMissionImage_C_GetMissionTitleFromSoftRef::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Campaign_InGameMapMissionImage_C_GetMissionTitleFromSoftRef, CallFunc_Conv_SoftObjectReferenceToString_ReturnValue) == 0x000078, "Member 'WBP_Campaign_InGameMapMissionImage_C_GetMissionTitleFromSoftRef::CallFunc_Conv_SoftObjectReferenceToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Campaign_InGameMapMissionImage_C_GetMissionTitleFromSoftRef, Temp_int_Loop_Counter_Variable) == 0x000088, "Member 'WBP_Campaign_InGameMapMissionImage_C_GetMissionTitleFromSoftRef::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Campaign_InGameMapMissionImage_C_GetMissionTitleFromSoftRef, CallFunc_GetActorNameWithoutSuffix_NameWithoutSuffix) == 0x000090, "Member 'WBP_Campaign_InGameMapMissionImage_C_GetMissionTitleFromSoftRef::CallFunc_GetActorNameWithoutSuffix_NameWithoutSuffix' has a wrong offset!");
static_assert(offsetof(WBP_Campaign_InGameMapMissionImage_C_GetMissionTitleFromSoftRef, CallFunc_Add_IntInt_ReturnValue) == 0x0000A0, "Member 'WBP_Campaign_InGameMapMissionImage_C_GetMissionTitleFromSoftRef::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Campaign_InGameMapMissionImage_C_GetMissionTitleFromSoftRef, Temp_int_Array_Index_Variable) == 0x0000A4, "Member 'WBP_Campaign_InGameMapMissionImage_C_GetMissionTitleFromSoftRef::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Campaign_InGameMapMissionImage_C_GetMissionTitleFromSoftRef, Temp_int_Loop_Counter_Variable_1) == 0x0000A8, "Member 'WBP_Campaign_InGameMapMissionImage_C_GetMissionTitleFromSoftRef::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Campaign_InGameMapMissionImage_C_GetMissionTitleFromSoftRef, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000AC, "Member 'WBP_Campaign_InGameMapMissionImage_C_GetMissionTitleFromSoftRef::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Campaign_InGameMapMissionImage_C_GetMissionTitleFromSoftRef, Temp_int_Array_Index_Variable_1) == 0x0000B0, "Member 'WBP_Campaign_InGameMapMissionImage_C_GetMissionTitleFromSoftRef::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Campaign_InGameMapMissionImage_C_GetMissionTitleFromSoftRef, CallFunc_Array_Length_ReturnValue) == 0x0000B4, "Member 'WBP_Campaign_InGameMapMissionImage_C_GetMissionTitleFromSoftRef::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Campaign_InGameMapMissionImage_C_GetMissionTitleFromSoftRef, CallFunc_Array_Get_Item) == 0x0000B8, "Member 'WBP_Campaign_InGameMapMissionImage_C_GetMissionTitleFromSoftRef::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Campaign_InGameMapMissionImage_C_GetMissionTitleFromSoftRef, CallFunc_Less_IntInt_ReturnValue) == 0x0000E8, "Member 'WBP_Campaign_InGameMapMissionImage_C_GetMissionTitleFromSoftRef::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Campaign_InGameMapMissionImage_C_GetMissionTitleFromSoftRef, CallFunc_GetActorNameWithoutSuffix_NameWithoutSuffix_1) == 0x0000F0, "Member 'WBP_Campaign_InGameMapMissionImage_C_GetMissionTitleFromSoftRef::CallFunc_GetActorNameWithoutSuffix_NameWithoutSuffix_1' has a wrong offset!");
static_assert(offsetof(WBP_Campaign_InGameMapMissionImage_C_GetMissionTitleFromSoftRef, CallFunc_EqualEqual_StriStri_ReturnValue) == 0x000100, "Member 'WBP_Campaign_InGameMapMissionImage_C_GetMissionTitleFromSoftRef::CallFunc_EqualEqual_StriStri_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Campaign_InGameMapMissionImage_C_GetMissionTitleFromSoftRef, CallFunc_Array_Length_ReturnValue_1) == 0x000104, "Member 'WBP_Campaign_InGameMapMissionImage_C_GetMissionTitleFromSoftRef::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Campaign_InGameMapMissionImage_C_GetMissionTitleFromSoftRef, CallFunc_Less_IntInt_ReturnValue_1) == 0x000108, "Member 'WBP_Campaign_InGameMapMissionImage_C_GetMissionTitleFromSoftRef::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Campaign_InGameMapMissionImage_C_GetMissionTitleFromSoftRef, CallFunc_Array_Get_Item_1) == 0x000110, "Member 'WBP_Campaign_InGameMapMissionImage_C_GetMissionTitleFromSoftRef::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_Campaign_InGameMapMissionImage_C_GetMissionTitleFromSoftRef, CallFunc_GetActorNameWithoutSuffix_NameWithoutSuffix_2) == 0x000140, "Member 'WBP_Campaign_InGameMapMissionImage_C_GetMissionTitleFromSoftRef::CallFunc_GetActorNameWithoutSuffix_NameWithoutSuffix_2' has a wrong offset!");
static_assert(offsetof(WBP_Campaign_InGameMapMissionImage_C_GetMissionTitleFromSoftRef, CallFunc_EqualEqual_StriStri_ReturnValue_1) == 0x000150, "Member 'WBP_Campaign_InGameMapMissionImage_C_GetMissionTitleFromSoftRef::CallFunc_EqualEqual_StriStri_ReturnValue_1' has a wrong offset!");

// Function WBP_Campaign_InGameMapMissionImage.WBP_Campaign_InGameMapMissionImage_C.GetActorNameWithoutSuffix
// 0x0078 (0x0078 - 0x0000)
struct WBP_Campaign_InGameMapMissionImage_C_GetActorNameWithoutSuffix final
{
public:
	class FString                                 InActorName;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 NameWithoutSuffix;                                 // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_FindSubstring_ReturnValue;                // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_RightChop_ReturnValue;                    // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_SelectString_ReturnValue;                 // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_FindSubstring_ReturnValue_1;              // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Left_ReturnValue;                         // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_SelectString_ReturnValue_1;               // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Campaign_InGameMapMissionImage_C_GetActorNameWithoutSuffix) == 0x000008, "Wrong alignment on WBP_Campaign_InGameMapMissionImage_C_GetActorNameWithoutSuffix");
static_assert(sizeof(WBP_Campaign_InGameMapMissionImage_C_GetActorNameWithoutSuffix) == 0x000078, "Wrong size on WBP_Campaign_InGameMapMissionImage_C_GetActorNameWithoutSuffix");
static_assert(offsetof(WBP_Campaign_InGameMapMissionImage_C_GetActorNameWithoutSuffix, InActorName) == 0x000000, "Member 'WBP_Campaign_InGameMapMissionImage_C_GetActorNameWithoutSuffix::InActorName' has a wrong offset!");
static_assert(offsetof(WBP_Campaign_InGameMapMissionImage_C_GetActorNameWithoutSuffix, NameWithoutSuffix) == 0x000010, "Member 'WBP_Campaign_InGameMapMissionImage_C_GetActorNameWithoutSuffix::NameWithoutSuffix' has a wrong offset!");
