#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Modding_MutatorOption_Entry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FMModdingPlugin_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Struct_Modding_MutatorInfo_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Modding_MutatorOption_Entry.WBP_Modding_MutatorOption_Entry_C
// 0x01B0 (0x0410 - 0x0260)
class UWBP_Modding_MutatorOption_Entry_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_ComboBox_C*                        ComboBox_Value_OneLine;                            // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ComboBox_C*                        ComboBox_Value_Vertical;                           // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SpinBox_C*                         SpinBox_Value_OneLine;                             // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SpinBox_C*                         SpinBox_Value_Vertical;                            // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_DisplayName_OneLine;                     // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_DisplayName_Vertical;                    // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_LayoutFormat;                       // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         MinValue;                                          // 0x02A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxValue;                                          // 0x02A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Value;                                             // 0x02A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AC[0x4];                                      // 0x02AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class FName OptionName, int32 NewValue)> OnSettingChanged;         // 0x02B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bUseConfigValue;                                   // 0x02C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_2C1[0x3];                                      // 0x02C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NewValue;                                          // 0x02C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 ComboValues;                                       // 0x02C8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         InitialValue;                                      // 0x02D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLuaScriptOption                       MutatorOption;                                     // 0x02DC(0x001C)(Edit, BlueprintVisible, NoDestructor, ExposeOnSpawn)
	struct FStruct_Modding_MutatorInfo            MutatorInfo;                                       // 0x02F8(0x0068)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FLuaScriptInfo                         MutatorLuaScriptInfo;                              // 0x0360(0x0080)(Edit, BlueprintVisible, ExposeOnSpawn)
	bool                                          bVerticalFormat;                                   // 0x03E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_3E1[0x7];                                      // 0x03E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            VerticalFormatTextColour;                          // 0x03E8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_WBP_Modding_MutatorOption_Entry(int32 EntryPoint);
	void CreateMutatorInfo();
	void ResetSpinBox();
	void SyncMissionSetting();
	void RevertMissionSetting();
	void OnValueChanged_Event_0(float Value_0);
	void ChangeValue(int32 Value_0);
	void OnIndexChanged_Event_0(int32 Index_0);
	void Construct();
	void GetValueFromTable(int32 InValue, class FText* OutText);
	void GenerateComboEntries();
	void FindEntryForDefaultValue(int32 DefaultValue, int32* EntryIndex);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Modding_MutatorOption_Entry_C">();
	}
	static class UWBP_Modding_MutatorOption_Entry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Modding_MutatorOption_Entry_C>();
	}
};
static_assert(alignof(UWBP_Modding_MutatorOption_Entry_C) == 0x000008, "Wrong alignment on UWBP_Modding_MutatorOption_Entry_C");
static_assert(sizeof(UWBP_Modding_MutatorOption_Entry_C) == 0x000410, "Wrong size on UWBP_Modding_MutatorOption_Entry_C");
static_assert(offsetof(UWBP_Modding_MutatorOption_Entry_C, UberGraphFrame) == 0x000260, "Member 'UWBP_Modding_MutatorOption_Entry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Modding_MutatorOption_Entry_C, ComboBox_Value_OneLine) == 0x000268, "Member 'UWBP_Modding_MutatorOption_Entry_C::ComboBox_Value_OneLine' has a wrong offset!");
static_assert(offsetof(UWBP_Modding_MutatorOption_Entry_C, ComboBox_Value_Vertical) == 0x000270, "Member 'UWBP_Modding_MutatorOption_Entry_C::ComboBox_Value_Vertical' has a wrong offset!");
static_assert(offsetof(UWBP_Modding_MutatorOption_Entry_C, SpinBox_Value_OneLine) == 0x000278, "Member 'UWBP_Modding_MutatorOption_Entry_C::SpinBox_Value_OneLine' has a wrong offset!");
static_assert(offsetof(UWBP_Modding_MutatorOption_Entry_C, SpinBox_Value_Vertical) == 0x000280, "Member 'UWBP_Modding_MutatorOption_Entry_C::SpinBox_Value_Vertical' has a wrong offset!");
static_assert(offsetof(UWBP_Modding_MutatorOption_Entry_C, TextBlock_DisplayName_OneLine) == 0x000288, "Member 'UWBP_Modding_MutatorOption_Entry_C::TextBlock_DisplayName_OneLine' has a wrong offset!");
static_assert(offsetof(UWBP_Modding_MutatorOption_Entry_C, TextBlock_DisplayName_Vertical) == 0x000290, "Member 'UWBP_Modding_MutatorOption_Entry_C::TextBlock_DisplayName_Vertical' has a wrong offset!");
static_assert(offsetof(UWBP_Modding_MutatorOption_Entry_C, WidgetSwitcher_LayoutFormat) == 0x000298, "Member 'UWBP_Modding_MutatorOption_Entry_C::WidgetSwitcher_LayoutFormat' has a wrong offset!");
static_assert(offsetof(UWBP_Modding_MutatorOption_Entry_C, MinValue) == 0x0002A0, "Member 'UWBP_Modding_MutatorOption_Entry_C::MinValue' has a wrong offset!");
static_assert(offsetof(UWBP_Modding_MutatorOption_Entry_C, MaxValue) == 0x0002A4, "Member 'UWBP_Modding_MutatorOption_Entry_C::MaxValue' has a wrong offset!");
static_assert(offsetof(UWBP_Modding_MutatorOption_Entry_C, Value) == 0x0002A8, "Member 'UWBP_Modding_MutatorOption_Entry_C::Value' has a wrong offset!");
static_assert(offsetof(UWBP_Modding_MutatorOption_Entry_C, OnSettingChanged) == 0x0002B0, "Member 'UWBP_Modding_MutatorOption_Entry_C::OnSettingChanged' has a wrong offset!");
static_assert(offsetof(UWBP_Modding_MutatorOption_Entry_C, bUseConfigValue) == 0x0002C0, "Member 'UWBP_Modding_MutatorOption_Entry_C::bUseConfigValue' has a wrong offset!");
static_assert(offsetof(UWBP_Modding_MutatorOption_Entry_C, NewValue) == 0x0002C4, "Member 'UWBP_Modding_MutatorOption_Entry_C::NewValue' has a wrong offset!");
static_assert(offsetof(UWBP_Modding_MutatorOption_Entry_C, ComboValues) == 0x0002C8, "Member 'UWBP_Modding_MutatorOption_Entry_C::ComboValues' has a wrong offset!");
static_assert(offsetof(UWBP_Modding_MutatorOption_Entry_C, InitialValue) == 0x0002D8, "Member 'UWBP_Modding_MutatorOption_Entry_C::InitialValue' has a wrong offset!");
static_assert(offsetof(UWBP_Modding_MutatorOption_Entry_C, MutatorOption) == 0x0002DC, "Member 'UWBP_Modding_MutatorOption_Entry_C::MutatorOption' has a wrong offset!");
static_assert(offsetof(UWBP_Modding_MutatorOption_Entry_C, MutatorInfo) == 0x0002F8, "Member 'UWBP_Modding_MutatorOption_Entry_C::MutatorInfo' has a wrong offset!");
static_assert(offsetof(UWBP_Modding_MutatorOption_Entry_C, MutatorLuaScriptInfo) == 0x000360, "Member 'UWBP_Modding_MutatorOption_Entry_C::MutatorLuaScriptInfo' has a wrong offset!");
static_assert(offsetof(UWBP_Modding_MutatorOption_Entry_C, bVerticalFormat) == 0x0003E0, "Member 'UWBP_Modding_MutatorOption_Entry_C::bVerticalFormat' has a wrong offset!");
static_assert(offsetof(UWBP_Modding_MutatorOption_Entry_C, VerticalFormatTextColour) == 0x0003E8, "Member 'UWBP_Modding_MutatorOption_Entry_C::VerticalFormatTextColour' has a wrong offset!");

}

