#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HeadGear_Customisation

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "WBP_IE_Customisation_Master_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_HeadGear_Customisation.WBP_HeadGear_Customisation_C
// 0x0098 (0x0420 - 0x0388)
class UWBP_HeadGear_Customisation_C final : public UWBP_IE_Customisation_Master_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WBP_HeadGear_Customisation_C;       // 0x0388(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_IE_List_C*                         WBP_DraggableItemsList;                            // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class FName>                           Sockets;                                           // 0x0398(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  NightVisionGogglesCategoryTag;                     // 0x03A8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  CounterWeightInvItemTags;                          // 0x03C8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FPrimaryAssetId                        CounterWeightAssetId;                              // 0x03E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FPrimaryAssetId                        CounterWeightSkinId;                               // 0x03F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           InvItemSocketTag;                                  // 0x0408(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bSupportsCounterWeight;                            // 0x0410(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_411[0x3];                                      // 0x0411(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CounterWeightSocket;                               // 0x0414(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_HeadGear_Customisation(int32 EntryPoint);
	void InventoryItemAdded_Event_0(class AGBCharacter* Character, class AGBInvItem* InvItem);
	void Destruct();
	void AddCounterWeight();
	void Construct();
	void Completed_EFA7DA480CDD468D902B6D60A3A6BA12(const TArray<class UObject*>& Loaded);
	void AddedSocketTagIncludes();
	void ShouldAddCounterWeight(bool* bOutResult);
	void UpdateNVGCounterWeight();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_HeadGear_Customisation_C">();
	}
	static class UWBP_HeadGear_Customisation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_HeadGear_Customisation_C>();
	}
};
static_assert(alignof(UWBP_HeadGear_Customisation_C) == 0x000008, "Wrong alignment on UWBP_HeadGear_Customisation_C");
static_assert(sizeof(UWBP_HeadGear_Customisation_C) == 0x000420, "Wrong size on UWBP_HeadGear_Customisation_C");
static_assert(offsetof(UWBP_HeadGear_Customisation_C, UberGraphFrame_WBP_HeadGear_Customisation_C) == 0x000388, "Member 'UWBP_HeadGear_Customisation_C::UberGraphFrame_WBP_HeadGear_Customisation_C' has a wrong offset!");
static_assert(offsetof(UWBP_HeadGear_Customisation_C, WBP_DraggableItemsList) == 0x000390, "Member 'UWBP_HeadGear_Customisation_C::WBP_DraggableItemsList' has a wrong offset!");
static_assert(offsetof(UWBP_HeadGear_Customisation_C, Sockets) == 0x000398, "Member 'UWBP_HeadGear_Customisation_C::Sockets' has a wrong offset!");
static_assert(offsetof(UWBP_HeadGear_Customisation_C, NightVisionGogglesCategoryTag) == 0x0003A8, "Member 'UWBP_HeadGear_Customisation_C::NightVisionGogglesCategoryTag' has a wrong offset!");
static_assert(offsetof(UWBP_HeadGear_Customisation_C, CounterWeightInvItemTags) == 0x0003C8, "Member 'UWBP_HeadGear_Customisation_C::CounterWeightInvItemTags' has a wrong offset!");
static_assert(offsetof(UWBP_HeadGear_Customisation_C, CounterWeightAssetId) == 0x0003E8, "Member 'UWBP_HeadGear_Customisation_C::CounterWeightAssetId' has a wrong offset!");
static_assert(offsetof(UWBP_HeadGear_Customisation_C, CounterWeightSkinId) == 0x0003F8, "Member 'UWBP_HeadGear_Customisation_C::CounterWeightSkinId' has a wrong offset!");
static_assert(offsetof(UWBP_HeadGear_Customisation_C, InvItemSocketTag) == 0x000408, "Member 'UWBP_HeadGear_Customisation_C::InvItemSocketTag' has a wrong offset!");
static_assert(offsetof(UWBP_HeadGear_Customisation_C, bSupportsCounterWeight) == 0x000410, "Member 'UWBP_HeadGear_Customisation_C::bSupportsCounterWeight' has a wrong offset!");
static_assert(offsetof(UWBP_HeadGear_Customisation_C, CounterWeightSocket) == 0x000414, "Member 'UWBP_HeadGear_Customisation_C::CounterWeightSocket' has a wrong offset!");

}

