#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_EndGameMessage

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_EndGameMessage.WBP_EndGameMessage_C
// 0x0028 (0x0288 - 0x0260)
class UWBP_EndGameMessage_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             TextBlock_AFKMessage;                              // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Message;                                           // 0x0270(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)

public:
	void Construct();
	void ExecuteUbergraph_WBP_EndGameMessage(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_EndGameMessage_C">();
	}
	static class UWBP_EndGameMessage_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_EndGameMessage_C>();
	}
};
static_assert(alignof(UWBP_EndGameMessage_C) == 0x000008, "Wrong alignment on UWBP_EndGameMessage_C");
static_assert(sizeof(UWBP_EndGameMessage_C) == 0x000288, "Wrong size on UWBP_EndGameMessage_C");
static_assert(offsetof(UWBP_EndGameMessage_C, UberGraphFrame) == 0x000260, "Member 'UWBP_EndGameMessage_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_EndGameMessage_C, TextBlock_AFKMessage) == 0x000268, "Member 'UWBP_EndGameMessage_C::TextBlock_AFKMessage' has a wrong offset!");
static_assert(offsetof(UWBP_EndGameMessage_C, Message) == 0x000270, "Member 'UWBP_EndGameMessage_C::Message' has a wrong offset!");

}

