#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Mission_PlayerList

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Mission_PlayerList.WBP_Mission_PlayerList_C
// 0x00C8 (0x0328 - 0x0260)
class UWBP_Mission_PlayerList_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 HorizontalLine1;                                   // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox_List;                                    // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         TeamTotal_Box;                                     // 0x0278(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Dash;                                    // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_TeamName;                                // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_TeamRole_1;                              // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_TotalAccuracy;                           // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_TotalKills;                              // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_TotalShotsFired;                         // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_TotalShotsHit;                           // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_YourTeam;                                // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint8                                         TeamId;                                            // 0x02C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_2C1[0x3];                                      // 0x02C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         TotalKills;                                        // 0x02C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TotalAccuracy;                                     // 0x02C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TotalShotsFired;                                   // 0x02CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TotalShotsHit;                                     // 0x02D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TeamCount;                                         // 0x02D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CurrentPlayerColour;                               // 0x02D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FLinearColor                           OtherPlayerColour;                                 // 0x02E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FText                                   TeamName;                                          // 0x02F8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bSuppressTeamName;                                 // 0x0310(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_311[0x7];                                      // 0x0311(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FLinearColor>                   TeamColours;                                       // 0x0318(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void SetTeamRole(class FName Role);
	ESlateVisibility GetTotalTeamBoxVis();
	void Construct();
	void OnUpdate_Event_0();
	void AddPlayerListEntry(class AGBPlayerState* PlayerState);
	void ExecuteUbergraph_WBP_Mission_PlayerList(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Mission_PlayerList_C">();
	}
	static class UWBP_Mission_PlayerList_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Mission_PlayerList_C>();
	}
};
static_assert(alignof(UWBP_Mission_PlayerList_C) == 0x000008, "Wrong alignment on UWBP_Mission_PlayerList_C");
static_assert(sizeof(UWBP_Mission_PlayerList_C) == 0x000328, "Wrong size on UWBP_Mission_PlayerList_C");
static_assert(offsetof(UWBP_Mission_PlayerList_C, UberGraphFrame) == 0x000260, "Member 'UWBP_Mission_PlayerList_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Mission_PlayerList_C, HorizontalLine1) == 0x000268, "Member 'UWBP_Mission_PlayerList_C::HorizontalLine1' has a wrong offset!");
static_assert(offsetof(UWBP_Mission_PlayerList_C, ScrollBox_List) == 0x000270, "Member 'UWBP_Mission_PlayerList_C::ScrollBox_List' has a wrong offset!");
static_assert(offsetof(UWBP_Mission_PlayerList_C, TeamTotal_Box) == 0x000278, "Member 'UWBP_Mission_PlayerList_C::TeamTotal_Box' has a wrong offset!");
static_assert(offsetof(UWBP_Mission_PlayerList_C, TextBlock_Dash) == 0x000280, "Member 'UWBP_Mission_PlayerList_C::TextBlock_Dash' has a wrong offset!");
static_assert(offsetof(UWBP_Mission_PlayerList_C, TextBlock_TeamName) == 0x000288, "Member 'UWBP_Mission_PlayerList_C::TextBlock_TeamName' has a wrong offset!");
static_assert(offsetof(UWBP_Mission_PlayerList_C, TextBlock_TeamRole_1) == 0x000290, "Member 'UWBP_Mission_PlayerList_C::TextBlock_TeamRole_1' has a wrong offset!");
static_assert(offsetof(UWBP_Mission_PlayerList_C, TextBlock_TotalAccuracy) == 0x000298, "Member 'UWBP_Mission_PlayerList_C::TextBlock_TotalAccuracy' has a wrong offset!");
static_assert(offsetof(UWBP_Mission_PlayerList_C, TextBlock_TotalKills) == 0x0002A0, "Member 'UWBP_Mission_PlayerList_C::TextBlock_TotalKills' has a wrong offset!");
static_assert(offsetof(UWBP_Mission_PlayerList_C, TextBlock_TotalShotsFired) == 0x0002A8, "Member 'UWBP_Mission_PlayerList_C::TextBlock_TotalShotsFired' has a wrong offset!");
static_assert(offsetof(UWBP_Mission_PlayerList_C, TextBlock_TotalShotsHit) == 0x0002B0, "Member 'UWBP_Mission_PlayerList_C::TextBlock_TotalShotsHit' has a wrong offset!");
static_assert(offsetof(UWBP_Mission_PlayerList_C, TextBlock_YourTeam) == 0x0002B8, "Member 'UWBP_Mission_PlayerList_C::TextBlock_YourTeam' has a wrong offset!");
static_assert(offsetof(UWBP_Mission_PlayerList_C, TeamId) == 0x0002C0, "Member 'UWBP_Mission_PlayerList_C::TeamId' has a wrong offset!");
static_assert(offsetof(UWBP_Mission_PlayerList_C, TotalKills) == 0x0002C4, "Member 'UWBP_Mission_PlayerList_C::TotalKills' has a wrong offset!");
static_assert(offsetof(UWBP_Mission_PlayerList_C, TotalAccuracy) == 0x0002C8, "Member 'UWBP_Mission_PlayerList_C::TotalAccuracy' has a wrong offset!");
static_assert(offsetof(UWBP_Mission_PlayerList_C, TotalShotsFired) == 0x0002CC, "Member 'UWBP_Mission_PlayerList_C::TotalShotsFired' has a wrong offset!");
static_assert(offsetof(UWBP_Mission_PlayerList_C, TotalShotsHit) == 0x0002D0, "Member 'UWBP_Mission_PlayerList_C::TotalShotsHit' has a wrong offset!");
static_assert(offsetof(UWBP_Mission_PlayerList_C, TeamCount) == 0x0002D4, "Member 'UWBP_Mission_PlayerList_C::TeamCount' has a wrong offset!");
static_assert(offsetof(UWBP_Mission_PlayerList_C, CurrentPlayerColour) == 0x0002D8, "Member 'UWBP_Mission_PlayerList_C::CurrentPlayerColour' has a wrong offset!");
static_assert(offsetof(UWBP_Mission_PlayerList_C, OtherPlayerColour) == 0x0002E8, "Member 'UWBP_Mission_PlayerList_C::OtherPlayerColour' has a wrong offset!");
static_assert(offsetof(UWBP_Mission_PlayerList_C, TeamName) == 0x0002F8, "Member 'UWBP_Mission_PlayerList_C::TeamName' has a wrong offset!");
static_assert(offsetof(UWBP_Mission_PlayerList_C, bSuppressTeamName) == 0x000310, "Member 'UWBP_Mission_PlayerList_C::bSuppressTeamName' has a wrong offset!");
static_assert(offsetof(UWBP_Mission_PlayerList_C, TeamColours) == 0x000318, "Member 'UWBP_Mission_PlayerList_C::TeamColours' has a wrong offset!");

}

