#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Transition

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Transition.WBP_Transition_C
// 0x0088 (0x02E8 - 0x0260)
class UWBP_Transition_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeToBlack;                                       // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeToView;                                        // 0x0270(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_TransitionMessage;                   // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Message;                                 // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UThrobber*                              Throbber_Dots;                                     // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FName                                   TransitionType;                                    // 0x0290(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FText                                   SpectatorTransition;                               // 0x0298(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   ReadyRoomTransition;                               // 0x02B0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   PlayAreaTransition;                                // 0x02C8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         StartTime;                                         // 0x02E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Transition(int32 EntryPoint);
	void SetMessageText(const class FText& InText);
	void Hide();
	void ClearTransitions();
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Transition_C">();
	}
	static class UWBP_Transition_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Transition_C>();
	}
};
static_assert(alignof(UWBP_Transition_C) == 0x000008, "Wrong alignment on UWBP_Transition_C");
static_assert(sizeof(UWBP_Transition_C) == 0x0002E8, "Wrong size on UWBP_Transition_C");
static_assert(offsetof(UWBP_Transition_C, UberGraphFrame) == 0x000260, "Member 'UWBP_Transition_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Transition_C, FadeToBlack) == 0x000268, "Member 'UWBP_Transition_C::FadeToBlack' has a wrong offset!");
static_assert(offsetof(UWBP_Transition_C, FadeToView) == 0x000270, "Member 'UWBP_Transition_C::FadeToView' has a wrong offset!");
static_assert(offsetof(UWBP_Transition_C, HorizontalBox_TransitionMessage) == 0x000278, "Member 'UWBP_Transition_C::HorizontalBox_TransitionMessage' has a wrong offset!");
static_assert(offsetof(UWBP_Transition_C, TextBlock_Message) == 0x000280, "Member 'UWBP_Transition_C::TextBlock_Message' has a wrong offset!");
static_assert(offsetof(UWBP_Transition_C, Throbber_Dots) == 0x000288, "Member 'UWBP_Transition_C::Throbber_Dots' has a wrong offset!");
static_assert(offsetof(UWBP_Transition_C, TransitionType) == 0x000290, "Member 'UWBP_Transition_C::TransitionType' has a wrong offset!");
static_assert(offsetof(UWBP_Transition_C, SpectatorTransition) == 0x000298, "Member 'UWBP_Transition_C::SpectatorTransition' has a wrong offset!");
static_assert(offsetof(UWBP_Transition_C, ReadyRoomTransition) == 0x0002B0, "Member 'UWBP_Transition_C::ReadyRoomTransition' has a wrong offset!");
static_assert(offsetof(UWBP_Transition_C, PlayAreaTransition) == 0x0002C8, "Member 'UWBP_Transition_C::PlayAreaTransition' has a wrong offset!");
static_assert(offsetof(UWBP_Transition_C, StartTime) == 0x0002E0, "Member 'UWBP_Transition_C::StartTime' has a wrong offset!");

}

