#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HotspotListEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_HotspotListEntry.WBP_HotspotListEntry_C
// 0x00A0 (0x0300 - 0x0260)
class UWBP_HotspotListEntry_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCheckBox*                              CheckBox_WholeItem;                                // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_NewDot;                                      // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_MissionType;                             // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_ShortLocation;                           // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   ShortLocationName;                                 // 0x0288(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	class FText                                   MissionType;                                       // 0x02A0(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	bool                                          bShowCircle;                                       // 0x02B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_2B9[0x7];                                      // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class UGBHotspotDataAsset* SelectedHotspotData)> OnSelected;       // 0x02C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UGBHotspotDataAsset*                    HotspotRef;                                        // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class UGBHotspotDataAsset* SelectedHotspot)> OnHovered;            // 0x02D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	float                                         DoubleClickMaxDelayTime;                           // 0x02E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LastClickTime;                                     // 0x02EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class UGBHotspotDataAsset* SelectedHotspot)> OnDoubleClicked;      // 0x02F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_WBP_HotspotListEntry(int32 EntryPoint);
	void BndEvt__WBP_HotspotListEntry_CheckBox_WholeItem_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature(bool bIsChecked);
	void PreConstruct(bool IsDesignTime);
	class UWidget* Get_CheckBox_WholeItem_ToolTipWidget_0();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_HotspotListEntry_C">();
	}
	static class UWBP_HotspotListEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_HotspotListEntry_C>();
	}
};
static_assert(alignof(UWBP_HotspotListEntry_C) == 0x000008, "Wrong alignment on UWBP_HotspotListEntry_C");
static_assert(sizeof(UWBP_HotspotListEntry_C) == 0x000300, "Wrong size on UWBP_HotspotListEntry_C");
static_assert(offsetof(UWBP_HotspotListEntry_C, UberGraphFrame) == 0x000260, "Member 'UWBP_HotspotListEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_HotspotListEntry_C, CheckBox_WholeItem) == 0x000268, "Member 'UWBP_HotspotListEntry_C::CheckBox_WholeItem' has a wrong offset!");
static_assert(offsetof(UWBP_HotspotListEntry_C, Image_NewDot) == 0x000270, "Member 'UWBP_HotspotListEntry_C::Image_NewDot' has a wrong offset!");
static_assert(offsetof(UWBP_HotspotListEntry_C, TextBlock_MissionType) == 0x000278, "Member 'UWBP_HotspotListEntry_C::TextBlock_MissionType' has a wrong offset!");
static_assert(offsetof(UWBP_HotspotListEntry_C, TextBlock_ShortLocation) == 0x000280, "Member 'UWBP_HotspotListEntry_C::TextBlock_ShortLocation' has a wrong offset!");
static_assert(offsetof(UWBP_HotspotListEntry_C, ShortLocationName) == 0x000288, "Member 'UWBP_HotspotListEntry_C::ShortLocationName' has a wrong offset!");
static_assert(offsetof(UWBP_HotspotListEntry_C, MissionType) == 0x0002A0, "Member 'UWBP_HotspotListEntry_C::MissionType' has a wrong offset!");
static_assert(offsetof(UWBP_HotspotListEntry_C, bShowCircle) == 0x0002B8, "Member 'UWBP_HotspotListEntry_C::bShowCircle' has a wrong offset!");
static_assert(offsetof(UWBP_HotspotListEntry_C, OnSelected) == 0x0002C0, "Member 'UWBP_HotspotListEntry_C::OnSelected' has a wrong offset!");
static_assert(offsetof(UWBP_HotspotListEntry_C, HotspotRef) == 0x0002D0, "Member 'UWBP_HotspotListEntry_C::HotspotRef' has a wrong offset!");
static_assert(offsetof(UWBP_HotspotListEntry_C, OnHovered) == 0x0002D8, "Member 'UWBP_HotspotListEntry_C::OnHovered' has a wrong offset!");
static_assert(offsetof(UWBP_HotspotListEntry_C, DoubleClickMaxDelayTime) == 0x0002E8, "Member 'UWBP_HotspotListEntry_C::DoubleClickMaxDelayTime' has a wrong offset!");
static_assert(offsetof(UWBP_HotspotListEntry_C, LastClickTime) == 0x0002EC, "Member 'UWBP_HotspotListEntry_C::LastClickTime' has a wrong offset!");
static_assert(offsetof(UWBP_HotspotListEntry_C, OnDoubleClicked) == 0x0002F0, "Member 'UWBP_HotspotListEntry_C::OnDoubleClicked' has a wrong offset!");

}

