#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MissionSummary_SplitContainer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MissionSummary_SplitContainer.WBP_MissionSummary_SplitContainer_C
// 0x0030 (0x0290 - 0x0260)
class UWBP_MissionSummary_SplitContainer_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVerticalBox*                           Container_Left;                                    // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           Container_Right;                                   // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidget*                                Content_Left;                                      // 0x0278(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UWidget*                                Content_Right;                                     // 0x0280(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FSlateChildSize                        ContentSize;                                       // 0x0288(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void ExecuteUbergraph_WBP_MissionSummary_SplitContainer(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MissionSummary_SplitContainer_C">();
	}
	static class UWBP_MissionSummary_SplitContainer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MissionSummary_SplitContainer_C>();
	}
};
static_assert(alignof(UWBP_MissionSummary_SplitContainer_C) == 0x000008, "Wrong alignment on UWBP_MissionSummary_SplitContainer_C");
static_assert(sizeof(UWBP_MissionSummary_SplitContainer_C) == 0x000290, "Wrong size on UWBP_MissionSummary_SplitContainer_C");
static_assert(offsetof(UWBP_MissionSummary_SplitContainer_C, UberGraphFrame) == 0x000260, "Member 'UWBP_MissionSummary_SplitContainer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_MissionSummary_SplitContainer_C, Container_Left) == 0x000268, "Member 'UWBP_MissionSummary_SplitContainer_C::Container_Left' has a wrong offset!");
static_assert(offsetof(UWBP_MissionSummary_SplitContainer_C, Container_Right) == 0x000270, "Member 'UWBP_MissionSummary_SplitContainer_C::Container_Right' has a wrong offset!");
static_assert(offsetof(UWBP_MissionSummary_SplitContainer_C, Content_Left) == 0x000278, "Member 'UWBP_MissionSummary_SplitContainer_C::Content_Left' has a wrong offset!");
static_assert(offsetof(UWBP_MissionSummary_SplitContainer_C, Content_Right) == 0x000280, "Member 'UWBP_MissionSummary_SplitContainer_C::Content_Right' has a wrong offset!");
static_assert(offsetof(UWBP_MissionSummary_SplitContainer_C, ContentSize) == 0x000288, "Member 'UWBP_MissionSummary_SplitContainer_C::ContentSize' has a wrong offset!");

}

