#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CampaignMainMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CampaignMainMenu.WBP_CampaignMainMenu_C
// 0x0240 (0x04A0 - 0x0260)
class UWBP_CampaignMainMenu_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FlickerCountryBorders;                             // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeInGridLines;                                   // 0x0270(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeOutGridLines;                                  // 0x0278(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FlickerFocusSpotlight;                             // 0x0280(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Pulse;                                             // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeIn;                                            // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                Button_NEWBack;                                    // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_ResetCampaign;                              // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_ViewHotspot;                                // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_ViewRoster;                                 // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_EscKey;                                      // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Grid;                                        // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_LeftCLick;                                   // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_MouseWheel;                                  // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Background;                                // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_HotspotMarkers;                            // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_MapAndNews;                                // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_WorldMap;                                  // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CampaignTextBox_C*                 WBP_CampaignTextBox_HotSpotInfo;                   // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CampaignTextBox_C*                 WBP_CampaignTextBox_NewsFeed;                      // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGBPlayerLoadingScreenComponent*        LoadPlayerLoadingScreenComp;                       // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FPrimaryAssetId>                HotspotDataList;                                   // 0x0310(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UWBP_HotspotMapIcon_C*>          HotspotWidgets;                                    // 0x0320(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	int32                                         NewsRandomSeed;                                    // 0x0330(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_334[0x4];                                      // 0x0334(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGBHotspotDataAsset*                    SelectedHotspotRef;                                // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MapZoom;                                           // 0x0340(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MapZoomAlpha;                                      // 0x0344(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MapZoomAlphaTarget;                                // 0x0348(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              MapTranslation;                                    // 0x034C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              MapTranslationTargetValue;                         // 0x0354(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              MapTranslationStartValue;                          // 0x035C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MapZoomMinimum;                                    // 0x0364(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MapZoomMaximum;                                    // 0x0368(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MouseWheelDeltaScaling;                            // 0x036C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MapZoomChangeRate;                                 // 0x0370(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MapTranslationChangeRate;                          // 0x0374(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MapTranslationAlpha;                               // 0x0378(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              MapOverlaySize;                                    // 0x037C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_384[0x4];                                      // 0x0384(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CurrentLaunchedScreen;                             // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UUserWidget*>                    CachedLaunchedScreens;                             // 0x0390(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UWBP_CampaignHighlightIcon_C*           HighlightIconRef;                                  // 0x03A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CursorDragScale;                                   // 0x03A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3AC[0x4];                                      // 0x03AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   MissionSelectionMenuClass;                         // 0x03B0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	int32                                         NumberOfNewsItemsToDisplay;                        // 0x03D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bLinesAreShown;                                    // 0x03DC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bDidSomethingOnTick;                               // 0x03DD(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3DE[0x2];                                      // 0x03DE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_HotspotMapIcon_C*                  TargetHotspotWhenZoomFinished;                     // 0x03E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              LastFrameTranslation;                              // 0x03E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         NotADragCursorDeltaSq;                             // 0x03F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F4[0x4];                                      // 0x03F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ResetCampaignProgress_Title;                       // 0x03F8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   ResetCampaignProgress_Message;                     // 0x0410(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   TooltipText_ResetCampaign;                         // 0x0428(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   TooltipText_ViewSquad;                             // 0x0440(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   TooltipText_ViewHotspot;                           // 0x0458(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   CampaignHasBeenReset_Title;                        // 0x0470(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   CampaignHasBeenReset_Message;                      // 0x0488(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	class UWidget* Get_Button_ViewHotspot_ToolTipWidget_0();
	class UWidget* Get_Button_ViewRoster_ToolTipWidget_0();
	class UWidget* Get_Button_ResetCampaign_ToolTipWidget_0();
	void IsHoveringOnMap(bool* bIsHoveringOnMap);
	void ShowScreen(class UClass* WidgetClass, class UUserWidget** CreatedMissionScreenWidget);
	bool Get_Button_DeployToHotspot_bIsEnabled_0();
	struct FEventReply OnMouseMove(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void ClampMapTranslationToAvailableSize(const struct FVector2D& DesiredTranslation, struct FVector2D* ClampedTranslation);
	void Get_Hotspot_Screen_Location(class UWBP_HotspotMapIcon_C* HotspotMarkerWidget, struct FVector2D* RawMapPosition, struct FVector2D* CentredScreenPosition, struct FVector2D* TranslationNeededToCentreIcon);
	struct FEventReply OnMouseWheel(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	struct FEventReply OnPreviewKeyDown(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);
	void OnLoaded_F6718D544E4C7ABB7D8A57B017CF46AC(TSubclassOf<class UObject> Loaded);
	void BndEvt__Button_NEWBack_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void Back();
	void Construct();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void LoadHotspotData();
	void OnHotspotEntrySelected(class UGBHotspotDataAsset* SelectedHotspotData);
	void SelectHotspot(class UGBHotspotDataAsset* HotspotToSelect);
	void OnHotspotIconClicked(class UGBHotspotDataAsset* SelectedHotspot);
	void SetSelectionsInHotspotList();
	void CentreMapOnSelectedHotspot();
	void AttemptToSetMapTranslation(const struct FVector2D& DesiredTranslation);
	void BndEvt__WBP_CampaignMainMenu_Button_DeployToHotspot_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void OnHotspotEntryHovered(class UGBHotspotDataAsset* SelectedHotspot);
	void OnHotspotIconHovered(class UGBHotspotDataAsset* SelectedHotspot);
	void ApplyHighlightToSelectedHotspot();
	void OnHotspotIconDoubleClicked(class UGBHotspotDataAsset* SelectedHotspot);
	void SimulateClickViewHotspot();
	void OnHotspotEntryDoubleClicked(class UGBHotspotDataAsset* SelectedHotspot);
	void ResetAutoZoom();
	void BndEvt__WBP_CampaignMainMenu_Button_ResetCampaign_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void OnClickedOkProceedToResetCampaign(class UWBP_DialogueBox_C* Dialogue);
	void DisconnectToMainMenu();
	void ExecuteUbergraph_WBP_CampaignMainMenu(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CampaignMainMenu_C">();
	}
	static class UWBP_CampaignMainMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CampaignMainMenu_C>();
	}
};
static_assert(alignof(UWBP_CampaignMainMenu_C) == 0x000008, "Wrong alignment on UWBP_CampaignMainMenu_C");
static_assert(sizeof(UWBP_CampaignMainMenu_C) == 0x0004A0, "Wrong size on UWBP_CampaignMainMenu_C");
static_assert(offsetof(UWBP_CampaignMainMenu_C, UberGraphFrame) == 0x000260, "Member 'UWBP_CampaignMainMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CampaignMainMenu_C, FlickerCountryBorders) == 0x000268, "Member 'UWBP_CampaignMainMenu_C::FlickerCountryBorders' has a wrong offset!");
static_assert(offsetof(UWBP_CampaignMainMenu_C, FadeInGridLines) == 0x000270, "Member 'UWBP_CampaignMainMenu_C::FadeInGridLines' has a wrong offset!");
static_assert(offsetof(UWBP_CampaignMainMenu_C, FadeOutGridLines) == 0x000278, "Member 'UWBP_CampaignMainMenu_C::FadeOutGridLines' has a wrong offset!");
static_assert(offsetof(UWBP_CampaignMainMenu_C, FlickerFocusSpotlight) == 0x000280, "Member 'UWBP_CampaignMainMenu_C::FlickerFocusSpotlight' has a wrong offset!");
static_assert(offsetof(UWBP_CampaignMainMenu_C, Pulse) == 0x000288, "Member 'UWBP_CampaignMainMenu_C::Pulse' has a wrong offset!");
static_assert(offsetof(UWBP_CampaignMainMenu_C, FadeIn) == 0x000290, "Member 'UWBP_CampaignMainMenu_C::FadeIn' has a wrong offset!");
static_assert(offsetof(UWBP_CampaignMainMenu_C, Button_NEWBack) == 0x000298, "Member 'UWBP_CampaignMainMenu_C::Button_NEWBack' has a wrong offset!");
static_assert(offsetof(UWBP_CampaignMainMenu_C, Button_ResetCampaign) == 0x0002A0, "Member 'UWBP_CampaignMainMenu_C::Button_ResetCampaign' has a wrong offset!");
static_assert(offsetof(UWBP_CampaignMainMenu_C, Button_ViewHotspot) == 0x0002A8, "Member 'UWBP_CampaignMainMenu_C::Button_ViewHotspot' has a wrong offset!");
static_assert(offsetof(UWBP_CampaignMainMenu_C, Button_ViewRoster) == 0x0002B0, "Member 'UWBP_CampaignMainMenu_C::Button_ViewRoster' has a wrong offset!");
static_assert(offsetof(UWBP_CampaignMainMenu_C, Image_EscKey) == 0x0002B8, "Member 'UWBP_CampaignMainMenu_C::Image_EscKey' has a wrong offset!");
static_assert(offsetof(UWBP_CampaignMainMenu_C, Image_Grid) == 0x0002C0, "Member 'UWBP_CampaignMainMenu_C::Image_Grid' has a wrong offset!");
static_assert(offsetof(UWBP_CampaignMainMenu_C, Image_LeftCLick) == 0x0002C8, "Member 'UWBP_CampaignMainMenu_C::Image_LeftCLick' has a wrong offset!");
static_assert(offsetof(UWBP_CampaignMainMenu_C, Image_MouseWheel) == 0x0002D0, "Member 'UWBP_CampaignMainMenu_C::Image_MouseWheel' has a wrong offset!");
static_assert(offsetof(UWBP_CampaignMainMenu_C, Overlay_Background) == 0x0002D8, "Member 'UWBP_CampaignMainMenu_C::Overlay_Background' has a wrong offset!");
static_assert(offsetof(UWBP_CampaignMainMenu_C, Overlay_HotspotMarkers) == 0x0002E0, "Member 'UWBP_CampaignMainMenu_C::Overlay_HotspotMarkers' has a wrong offset!");
static_assert(offsetof(UWBP_CampaignMainMenu_C, Overlay_MapAndNews) == 0x0002E8, "Member 'UWBP_CampaignMainMenu_C::Overlay_MapAndNews' has a wrong offset!");
static_assert(offsetof(UWBP_CampaignMainMenu_C, Overlay_WorldMap) == 0x0002F0, "Member 'UWBP_CampaignMainMenu_C::Overlay_WorldMap' has a wrong offset!");
static_assert(offsetof(UWBP_CampaignMainMenu_C, WBP_CampaignTextBox_HotSpotInfo) == 0x0002F8, "Member 'UWBP_CampaignMainMenu_C::WBP_CampaignTextBox_HotSpotInfo' has a wrong offset!");
static_assert(offsetof(UWBP_CampaignMainMenu_C, WBP_CampaignTextBox_NewsFeed) == 0x000300, "Member 'UWBP_CampaignMainMenu_C::WBP_CampaignTextBox_NewsFeed' has a wrong offset!");
static_assert(offsetof(UWBP_CampaignMainMenu_C, LoadPlayerLoadingScreenComp) == 0x000308, "Member 'UWBP_CampaignMainMenu_C::LoadPlayerLoadingScreenComp' has a wrong offset!");
static_assert(offsetof(UWBP_CampaignMainMenu_C, HotspotDataList) == 0x000310, "Member 'UWBP_CampaignMainMenu_C::HotspotDataList' has a wrong offset!");
static_assert(offsetof(UWBP_CampaignMainMenu_C, HotspotWidgets) == 0x000320, "Member 'UWBP_CampaignMainMenu_C::HotspotWidgets' has a wrong offset!");
static_assert(offsetof(UWBP_CampaignMainMenu_C, NewsRandomSeed) == 0x000330, "Member 'UWBP_CampaignMainMenu_C::NewsRandomSeed' has a wrong offset!");
static_assert(offsetof(UWBP_CampaignMainMenu_C, SelectedHotspotRef) == 0x000338, "Member 'UWBP_CampaignMainMenu_C::SelectedHotspotRef' has a wrong offset!");
static_assert(offsetof(UWBP_CampaignMainMenu_C, MapZoom) == 0x000340, "Member 'UWBP_CampaignMainMenu_C::MapZoom' has a wrong offset!");
static_assert(offsetof(UWBP_CampaignMainMenu_C, MapZoomAlpha) == 0x000344, "Member 'UWBP_CampaignMainMenu_C::MapZoomAlpha' has a wrong offset!");
static_assert(offsetof(UWBP_CampaignMainMenu_C, MapZoomAlphaTarget) == 0x000348, "Member 'UWBP_CampaignMainMenu_C::MapZoomAlphaTarget' has a wrong offset!");
static_assert(offsetof(UWBP_CampaignMainMenu_C, MapTranslation) == 0x00034C, "Member 'UWBP_CampaignMainMenu_C::MapTranslation' has a wrong offset!");
static_assert(offsetof(UWBP_CampaignMainMenu_C, MapTranslationTargetValue) == 0x000354, "Member 'UWBP_CampaignMainMenu_C::MapTranslationTargetValue' has a wrong offset!");
static_assert(offsetof(UWBP_CampaignMainMenu_C, MapTranslationStartValue) == 0x00035C, "Member 'UWBP_CampaignMainMenu_C::MapTranslationStartValue' has a wrong offset!");
static_assert(offsetof(UWBP_CampaignMainMenu_C, MapZoomMinimum) == 0x000364, "Member 'UWBP_CampaignMainMenu_C::MapZoomMinimum' has a wrong offset!");
static_assert(offsetof(UWBP_CampaignMainMenu_C, MapZoomMaximum) == 0x000368, "Member 'UWBP_CampaignMainMenu_C::MapZoomMaximum' has a wrong offset!");
static_assert(offsetof(UWBP_CampaignMainMenu_C, MouseWheelDeltaScaling) == 0x00036C, "Member 'UWBP_CampaignMainMenu_C::MouseWheelDeltaScaling' has a wrong offset!");
static_assert(offsetof(UWBP_CampaignMainMenu_C, MapZoomChangeRate) == 0x000370, "Member 'UWBP_CampaignMainMenu_C::MapZoomChangeRate' has a wrong offset!");
static_assert(offsetof(UWBP_CampaignMainMenu_C, MapTranslationChangeRate) == 0x000374, "Member 'UWBP_CampaignMainMenu_C::MapTranslationChangeRate' has a wrong offset!");
static_assert(offsetof(UWBP_CampaignMainMenu_C, MapTranslationAlpha) == 0x000378, "Member 'UWBP_CampaignMainMenu_C::MapTranslationAlpha' has a wrong offset!");
static_assert(offsetof(UWBP_CampaignMainMenu_C, MapOverlaySize) == 0x00037C, "Member 'UWBP_CampaignMainMenu_C::MapOverlaySize' has a wrong offset!");
static_assert(offsetof(UWBP_CampaignMainMenu_C, CurrentLaunchedScreen) == 0x000388, "Member 'UWBP_CampaignMainMenu_C::CurrentLaunchedScreen' has a wrong offset!");
static_assert(offsetof(UWBP_CampaignMainMenu_C, CachedLaunchedScreens) == 0x000390, "Member 'UWBP_CampaignMainMenu_C::CachedLaunchedScreens' has a wrong offset!");
static_assert(offsetof(UWBP_CampaignMainMenu_C, HighlightIconRef) == 0x0003A0, "Member 'UWBP_CampaignMainMenu_C::HighlightIconRef' has a wrong offset!");
static_assert(offsetof(UWBP_CampaignMainMenu_C, CursorDragScale) == 0x0003A8, "Member 'UWBP_CampaignMainMenu_C::CursorDragScale' has a wrong offset!");
static_assert(offsetof(UWBP_CampaignMainMenu_C, MissionSelectionMenuClass) == 0x0003B0, "Member 'UWBP_CampaignMainMenu_C::MissionSelectionMenuClass' has a wrong offset!");
static_assert(offsetof(UWBP_CampaignMainMenu_C, NumberOfNewsItemsToDisplay) == 0x0003D8, "Member 'UWBP_CampaignMainMenu_C::NumberOfNewsItemsToDisplay' has a wrong offset!");
static_assert(offsetof(UWBP_CampaignMainMenu_C, bLinesAreShown) == 0x0003DC, "Member 'UWBP_CampaignMainMenu_C::bLinesAreShown' has a wrong offset!");
static_assert(offsetof(UWBP_CampaignMainMenu_C, bDidSomethingOnTick) == 0x0003DD, "Member 'UWBP_CampaignMainMenu_C::bDidSomethingOnTick' has a wrong offset!");
static_assert(offsetof(UWBP_CampaignMainMenu_C, TargetHotspotWhenZoomFinished) == 0x0003E0, "Member 'UWBP_CampaignMainMenu_C::TargetHotspotWhenZoomFinished' has a wrong offset!");
static_assert(offsetof(UWBP_CampaignMainMenu_C, LastFrameTranslation) == 0x0003E8, "Member 'UWBP_CampaignMainMenu_C::LastFrameTranslation' has a wrong offset!");
static_assert(offsetof(UWBP_CampaignMainMenu_C, NotADragCursorDeltaSq) == 0x0003F0, "Member 'UWBP_CampaignMainMenu_C::NotADragCursorDeltaSq' has a wrong offset!");
static_assert(offsetof(UWBP_CampaignMainMenu_C, ResetCampaignProgress_Title) == 0x0003F8, "Member 'UWBP_CampaignMainMenu_C::ResetCampaignProgress_Title' has a wrong offset!");
static_assert(offsetof(UWBP_CampaignMainMenu_C, ResetCampaignProgress_Message) == 0x000410, "Member 'UWBP_CampaignMainMenu_C::ResetCampaignProgress_Message' has a wrong offset!");
static_assert(offsetof(UWBP_CampaignMainMenu_C, TooltipText_ResetCampaign) == 0x000428, "Member 'UWBP_CampaignMainMenu_C::TooltipText_ResetCampaign' has a wrong offset!");
static_assert(offsetof(UWBP_CampaignMainMenu_C, TooltipText_ViewSquad) == 0x000440, "Member 'UWBP_CampaignMainMenu_C::TooltipText_ViewSquad' has a wrong offset!");
static_assert(offsetof(UWBP_CampaignMainMenu_C, TooltipText_ViewHotspot) == 0x000458, "Member 'UWBP_CampaignMainMenu_C::TooltipText_ViewHotspot' has a wrong offset!");
static_assert(offsetof(UWBP_CampaignMainMenu_C, CampaignHasBeenReset_Title) == 0x000470, "Member 'UWBP_CampaignMainMenu_C::CampaignHasBeenReset_Title' has a wrong offset!");
static_assert(offsetof(UWBP_CampaignMainMenu_C, CampaignHasBeenReset_Message) == 0x000488, "Member 'UWBP_CampaignMainMenu_C::CampaignHasBeenReset_Message' has a wrong offset!");

}

