#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CampaignTextBox

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CampaignTextBox.WBP_CampaignTextBox_C
// 0x0058 (0x02B8 - 0x0260)
class UWBP_CampaignTextBox_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeIn;                                            // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox_ChildItems;                              // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Global;                                    // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_CategoryTitle;                           // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   BoxTitle;                                          // 0x0288(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	float                                         RequiredWidth;                                     // 0x02A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                         MinHeight;                                         // 0x02A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                         MaxHeight;                                         // 0x02A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          bHideWidget;                                       // 0x02AC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2AD[0x3];                                      // 0x02AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FadeInDelay;                                       // 0x02B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_CampaignTextBox(int32 EntryPoint);
	void SetBoxTitle(const class FText& NewBoxTitle);
	void ClearChildItems(bool bCloseWindowImmediately);
	void AddChildItem(class UUserWidget* Widget);
	void Construct();
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CampaignTextBox_C">();
	}
	static class UWBP_CampaignTextBox_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CampaignTextBox_C>();
	}
};
static_assert(alignof(UWBP_CampaignTextBox_C) == 0x000008, "Wrong alignment on UWBP_CampaignTextBox_C");
static_assert(sizeof(UWBP_CampaignTextBox_C) == 0x0002B8, "Wrong size on UWBP_CampaignTextBox_C");
static_assert(offsetof(UWBP_CampaignTextBox_C, UberGraphFrame) == 0x000260, "Member 'UWBP_CampaignTextBox_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CampaignTextBox_C, FadeIn) == 0x000268, "Member 'UWBP_CampaignTextBox_C::FadeIn' has a wrong offset!");
static_assert(offsetof(UWBP_CampaignTextBox_C, ScrollBox_ChildItems) == 0x000270, "Member 'UWBP_CampaignTextBox_C::ScrollBox_ChildItems' has a wrong offset!");
static_assert(offsetof(UWBP_CampaignTextBox_C, SizeBox_Global) == 0x000278, "Member 'UWBP_CampaignTextBox_C::SizeBox_Global' has a wrong offset!");
static_assert(offsetof(UWBP_CampaignTextBox_C, TextBlock_CategoryTitle) == 0x000280, "Member 'UWBP_CampaignTextBox_C::TextBlock_CategoryTitle' has a wrong offset!");
static_assert(offsetof(UWBP_CampaignTextBox_C, BoxTitle) == 0x000288, "Member 'UWBP_CampaignTextBox_C::BoxTitle' has a wrong offset!");
static_assert(offsetof(UWBP_CampaignTextBox_C, RequiredWidth) == 0x0002A0, "Member 'UWBP_CampaignTextBox_C::RequiredWidth' has a wrong offset!");
static_assert(offsetof(UWBP_CampaignTextBox_C, MinHeight) == 0x0002A4, "Member 'UWBP_CampaignTextBox_C::MinHeight' has a wrong offset!");
static_assert(offsetof(UWBP_CampaignTextBox_C, MaxHeight) == 0x0002A8, "Member 'UWBP_CampaignTextBox_C::MaxHeight' has a wrong offset!");
static_assert(offsetof(UWBP_CampaignTextBox_C, bHideWidget) == 0x0002AC, "Member 'UWBP_CampaignTextBox_C::bHideWidget' has a wrong offset!");
static_assert(offsetof(UWBP_CampaignTextBox_C, FadeInDelay) == 0x0002B0, "Member 'UWBP_CampaignTextBox_C::FadeInDelay' has a wrong offset!");

}

