#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Mission_MatchSummaryPVP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Mission_MatchSummaryPVP.WBP_Mission_MatchSummaryPVP_C
// 0x00D0 (0x0330 - 0x0260)
class UWBP_Mission_MatchSummaryPVP_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             AfterXRounds;                                      // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             GameMode_Text;                                     // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             MatchScore1;                                       // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             MatchScore2;                                       // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         MatchScores;                                       // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             MatchSummary;                                      // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Team1Name;                                         // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Team1Role;                                         // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Team1YourTeam;                                     // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Team2Name;                                         // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Team2Role;                                         // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Team2YourTeam;                                     // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             WhoWonRound_YoursOrTheirs;                         // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint8                                         TeamId1;                                           // 0x02D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         TeamId2;                                           // 0x02D1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_2D2[0x2];                                      // 0x02D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         TotalScore1;                                       // 0x02D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TotalScore2;                                       // 0x02D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DC[0x4];                                      // 0x02DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FLinearColor>                   TeamColours;                                       // 0x02E0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FLinearColor                           GameModeColour;                                    // 0x02F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   TeamName1;                                         // 0x0300(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   TeamName2;                                         // 0x0318(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_WBP_Mission_MatchSummaryPVP(int32 EntryPoint);
	void OnMatchStatsUpdated(class AGBGameState* GameState);
	void BindMatchStats();
	void Construct();
	void SetTeamRolesVisibility();
	void UpdateNormalMatchStats(class AGBGameState* InGameState);
	void GetTeamName(uint8 TeamId, class FText* TeamName);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Mission_MatchSummaryPVP_C">();
	}
	static class UWBP_Mission_MatchSummaryPVP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Mission_MatchSummaryPVP_C>();
	}
};
static_assert(alignof(UWBP_Mission_MatchSummaryPVP_C) == 0x000008, "Wrong alignment on UWBP_Mission_MatchSummaryPVP_C");
static_assert(sizeof(UWBP_Mission_MatchSummaryPVP_C) == 0x000330, "Wrong size on UWBP_Mission_MatchSummaryPVP_C");
static_assert(offsetof(UWBP_Mission_MatchSummaryPVP_C, UberGraphFrame) == 0x000260, "Member 'UWBP_Mission_MatchSummaryPVP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Mission_MatchSummaryPVP_C, AfterXRounds) == 0x000268, "Member 'UWBP_Mission_MatchSummaryPVP_C::AfterXRounds' has a wrong offset!");
static_assert(offsetof(UWBP_Mission_MatchSummaryPVP_C, GameMode_Text) == 0x000270, "Member 'UWBP_Mission_MatchSummaryPVP_C::GameMode_Text' has a wrong offset!");
static_assert(offsetof(UWBP_Mission_MatchSummaryPVP_C, MatchScore1) == 0x000278, "Member 'UWBP_Mission_MatchSummaryPVP_C::MatchScore1' has a wrong offset!");
static_assert(offsetof(UWBP_Mission_MatchSummaryPVP_C, MatchScore2) == 0x000280, "Member 'UWBP_Mission_MatchSummaryPVP_C::MatchScore2' has a wrong offset!");
static_assert(offsetof(UWBP_Mission_MatchSummaryPVP_C, MatchScores) == 0x000288, "Member 'UWBP_Mission_MatchSummaryPVP_C::MatchScores' has a wrong offset!");
static_assert(offsetof(UWBP_Mission_MatchSummaryPVP_C, MatchSummary) == 0x000290, "Member 'UWBP_Mission_MatchSummaryPVP_C::MatchSummary' has a wrong offset!");
static_assert(offsetof(UWBP_Mission_MatchSummaryPVP_C, Team1Name) == 0x000298, "Member 'UWBP_Mission_MatchSummaryPVP_C::Team1Name' has a wrong offset!");
static_assert(offsetof(UWBP_Mission_MatchSummaryPVP_C, Team1Role) == 0x0002A0, "Member 'UWBP_Mission_MatchSummaryPVP_C::Team1Role' has a wrong offset!");
static_assert(offsetof(UWBP_Mission_MatchSummaryPVP_C, Team1YourTeam) == 0x0002A8, "Member 'UWBP_Mission_MatchSummaryPVP_C::Team1YourTeam' has a wrong offset!");
static_assert(offsetof(UWBP_Mission_MatchSummaryPVP_C, Team2Name) == 0x0002B0, "Member 'UWBP_Mission_MatchSummaryPVP_C::Team2Name' has a wrong offset!");
static_assert(offsetof(UWBP_Mission_MatchSummaryPVP_C, Team2Role) == 0x0002B8, "Member 'UWBP_Mission_MatchSummaryPVP_C::Team2Role' has a wrong offset!");
static_assert(offsetof(UWBP_Mission_MatchSummaryPVP_C, Team2YourTeam) == 0x0002C0, "Member 'UWBP_Mission_MatchSummaryPVP_C::Team2YourTeam' has a wrong offset!");
static_assert(offsetof(UWBP_Mission_MatchSummaryPVP_C, WhoWonRound_YoursOrTheirs) == 0x0002C8, "Member 'UWBP_Mission_MatchSummaryPVP_C::WhoWonRound_YoursOrTheirs' has a wrong offset!");
static_assert(offsetof(UWBP_Mission_MatchSummaryPVP_C, TeamId1) == 0x0002D0, "Member 'UWBP_Mission_MatchSummaryPVP_C::TeamId1' has a wrong offset!");
static_assert(offsetof(UWBP_Mission_MatchSummaryPVP_C, TeamId2) == 0x0002D1, "Member 'UWBP_Mission_MatchSummaryPVP_C::TeamId2' has a wrong offset!");
static_assert(offsetof(UWBP_Mission_MatchSummaryPVP_C, TotalScore1) == 0x0002D4, "Member 'UWBP_Mission_MatchSummaryPVP_C::TotalScore1' has a wrong offset!");
static_assert(offsetof(UWBP_Mission_MatchSummaryPVP_C, TotalScore2) == 0x0002D8, "Member 'UWBP_Mission_MatchSummaryPVP_C::TotalScore2' has a wrong offset!");
static_assert(offsetof(UWBP_Mission_MatchSummaryPVP_C, TeamColours) == 0x0002E0, "Member 'UWBP_Mission_MatchSummaryPVP_C::TeamColours' has a wrong offset!");
static_assert(offsetof(UWBP_Mission_MatchSummaryPVP_C, GameModeColour) == 0x0002F0, "Member 'UWBP_Mission_MatchSummaryPVP_C::GameModeColour' has a wrong offset!");
static_assert(offsetof(UWBP_Mission_MatchSummaryPVP_C, TeamName1) == 0x000300, "Member 'UWBP_Mission_MatchSummaryPVP_C::TeamName1' has a wrong offset!");
static_assert(offsetof(UWBP_Mission_MatchSummaryPVP_C, TeamName2) == 0x000318, "Member 'UWBP_Mission_MatchSummaryPVP_C::TeamName2' has a wrong offset!");

}

