#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Tooltip_MapSymbolObjectives

#include "Basic.hpp"

#include "ModKit_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_Tooltip_MapSymbolObjectives.WBP_Tooltip_MapSymbolObjectives_C.ExecuteUbergraph_WBP_Tooltip_MapSymbolObjectives
// 0x0188 (0x0188 - 0x0000)
struct WBP_Tooltip_MapSymbolObjectives_C_ExecuteUbergraph_WBP_Tooltip_MapSymbolObjectives final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B[0x5];                                        // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUInt64                                CallFunc_MakeModIDForGame_ReturnValue;             // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_InitStringTable_ReturnValue;              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_2;                              // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x0030(0x0018)()
	int32                                         CallFunc_Len_ReturnValue;                          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0050(0x0040)(HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetCampaignObjectiveNameToken_ReturnValue; // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00A8(0x0018)()
	class FText                                   CallFunc_GetStringTableEntryOrDisplayString_ReturnValue; // 0x00C0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00D8(0x0040)(HasGetValueTypeHash)
	bool                                          CallFunc_IsRegisteredTableEntry_ReturnValue;       // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0120(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0130(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x0148(0x0018)()
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0162(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0163(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_164[0x4];                                      // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_2;                           // 0x0168(0x0018)()
	ESlateVisibility                              K2Node_Select_Default_3;                           // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Tooltip_MapSymbolObjectives_C_ExecuteUbergraph_WBP_Tooltip_MapSymbolObjectives) == 0x000008, "Wrong alignment on WBP_Tooltip_MapSymbolObjectives_C_ExecuteUbergraph_WBP_Tooltip_MapSymbolObjectives");
static_assert(sizeof(WBP_Tooltip_MapSymbolObjectives_C_ExecuteUbergraph_WBP_Tooltip_MapSymbolObjectives) == 0x000188, "Wrong size on WBP_Tooltip_MapSymbolObjectives_C_ExecuteUbergraph_WBP_Tooltip_MapSymbolObjectives");
static_assert(offsetof(WBP_Tooltip_MapSymbolObjectives_C_ExecuteUbergraph_WBP_Tooltip_MapSymbolObjectives, EntryPoint) == 0x000000, "Member 'WBP_Tooltip_MapSymbolObjectives_C_ExecuteUbergraph_WBP_Tooltip_MapSymbolObjectives::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Tooltip_MapSymbolObjectives_C_ExecuteUbergraph_WBP_Tooltip_MapSymbolObjectives, Temp_bool_Variable) == 0x000004, "Member 'WBP_Tooltip_MapSymbolObjectives_C_ExecuteUbergraph_WBP_Tooltip_MapSymbolObjectives::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Tooltip_MapSymbolObjectives_C_ExecuteUbergraph_WBP_Tooltip_MapSymbolObjectives, Temp_byte_Variable) == 0x000005, "Member 'WBP_Tooltip_MapSymbolObjectives_C_ExecuteUbergraph_WBP_Tooltip_MapSymbolObjectives::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Tooltip_MapSymbolObjectives_C_ExecuteUbergraph_WBP_Tooltip_MapSymbolObjectives, Temp_byte_Variable_1) == 0x000006, "Member 'WBP_Tooltip_MapSymbolObjectives_C_ExecuteUbergraph_WBP_Tooltip_MapSymbolObjectives::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Tooltip_MapSymbolObjectives_C_ExecuteUbergraph_WBP_Tooltip_MapSymbolObjectives, Temp_bool_Variable_1) == 0x000007, "Member 'WBP_Tooltip_MapSymbolObjectives_C_ExecuteUbergraph_WBP_Tooltip_MapSymbolObjectives::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Tooltip_MapSymbolObjectives_C_ExecuteUbergraph_WBP_Tooltip_MapSymbolObjectives, Temp_byte_Variable_2) == 0x000008, "Member 'WBP_Tooltip_MapSymbolObjectives_C_ExecuteUbergraph_WBP_Tooltip_MapSymbolObjectives::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Tooltip_MapSymbolObjectives_C_ExecuteUbergraph_WBP_Tooltip_MapSymbolObjectives, Temp_byte_Variable_3) == 0x000009, "Member 'WBP_Tooltip_MapSymbolObjectives_C_ExecuteUbergraph_WBP_Tooltip_MapSymbolObjectives::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_Tooltip_MapSymbolObjectives_C_ExecuteUbergraph_WBP_Tooltip_MapSymbolObjectives, K2Node_Event_IsDesignTime) == 0x00000A, "Member 'WBP_Tooltip_MapSymbolObjectives_C_ExecuteUbergraph_WBP_Tooltip_MapSymbolObjectives::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_Tooltip_MapSymbolObjectives_C_ExecuteUbergraph_WBP_Tooltip_MapSymbolObjectives, CallFunc_MakeModIDForGame_ReturnValue) == 0x000010, "Member 'WBP_Tooltip_MapSymbolObjectives_C_ExecuteUbergraph_WBP_Tooltip_MapSymbolObjectives::CallFunc_MakeModIDForGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Tooltip_MapSymbolObjectives_C_ExecuteUbergraph_WBP_Tooltip_MapSymbolObjectives, CallFunc_Conv_NameToString_ReturnValue) == 0x000018, "Member 'WBP_Tooltip_MapSymbolObjectives_C_ExecuteUbergraph_WBP_Tooltip_MapSymbolObjectives::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Tooltip_MapSymbolObjectives_C_ExecuteUbergraph_WBP_Tooltip_MapSymbolObjectives, CallFunc_InitStringTable_ReturnValue) == 0x000028, "Member 'WBP_Tooltip_MapSymbolObjectives_C_ExecuteUbergraph_WBP_Tooltip_MapSymbolObjectives::CallFunc_InitStringTable_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Tooltip_MapSymbolObjectives_C_ExecuteUbergraph_WBP_Tooltip_MapSymbolObjectives, Temp_bool_Variable_2) == 0x000029, "Member 'WBP_Tooltip_MapSymbolObjectives_C_ExecuteUbergraph_WBP_Tooltip_MapSymbolObjectives::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Tooltip_MapSymbolObjectives_C_ExecuteUbergraph_WBP_Tooltip_MapSymbolObjectives, CallFunc_Conv_NameToText_ReturnValue) == 0x000030, "Member 'WBP_Tooltip_MapSymbolObjectives_C_ExecuteUbergraph_WBP_Tooltip_MapSymbolObjectives::CallFunc_Conv_NameToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Tooltip_MapSymbolObjectives_C_ExecuteUbergraph_WBP_Tooltip_MapSymbolObjectives, CallFunc_Len_ReturnValue) == 0x000048, "Member 'WBP_Tooltip_MapSymbolObjectives_C_ExecuteUbergraph_WBP_Tooltip_MapSymbolObjectives::CallFunc_Len_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Tooltip_MapSymbolObjectives_C_ExecuteUbergraph_WBP_Tooltip_MapSymbolObjectives, K2Node_MakeStruct_FormatArgumentData) == 0x000050, "Member 'WBP_Tooltip_MapSymbolObjectives_C_ExecuteUbergraph_WBP_Tooltip_MapSymbolObjectives::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_Tooltip_MapSymbolObjectives_C_ExecuteUbergraph_WBP_Tooltip_MapSymbolObjectives, CallFunc_Greater_IntInt_ReturnValue) == 0x000090, "Member 'WBP_Tooltip_MapSymbolObjectives_C_ExecuteUbergraph_WBP_Tooltip_MapSymbolObjectives::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Tooltip_MapSymbolObjectives_C_ExecuteUbergraph_WBP_Tooltip_MapSymbolObjectives, CallFunc_GetCampaignObjectiveNameToken_ReturnValue) == 0x000098, "Member 'WBP_Tooltip_MapSymbolObjectives_C_ExecuteUbergraph_WBP_Tooltip_MapSymbolObjectives::CallFunc_GetCampaignObjectiveNameToken_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Tooltip_MapSymbolObjectives_C_ExecuteUbergraph_WBP_Tooltip_MapSymbolObjectives, CallFunc_Conv_StringToText_ReturnValue) == 0x0000A8, "Member 'WBP_Tooltip_MapSymbolObjectives_C_ExecuteUbergraph_WBP_Tooltip_MapSymbolObjectives::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Tooltip_MapSymbolObjectives_C_ExecuteUbergraph_WBP_Tooltip_MapSymbolObjectives, CallFunc_GetStringTableEntryOrDisplayString_ReturnValue) == 0x0000C0, "Member 'WBP_Tooltip_MapSymbolObjectives_C_ExecuteUbergraph_WBP_Tooltip_MapSymbolObjectives::CallFunc_GetStringTableEntryOrDisplayString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Tooltip_MapSymbolObjectives_C_ExecuteUbergraph_WBP_Tooltip_MapSymbolObjectives, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000D8, "Member 'WBP_Tooltip_MapSymbolObjectives_C_ExecuteUbergraph_WBP_Tooltip_MapSymbolObjectives::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_Tooltip_MapSymbolObjectives_C_ExecuteUbergraph_WBP_Tooltip_MapSymbolObjectives, CallFunc_IsRegisteredTableEntry_ReturnValue) == 0x000118, "Member 'WBP_Tooltip_MapSymbolObjectives_C_ExecuteUbergraph_WBP_Tooltip_MapSymbolObjectives::CallFunc_IsRegisteredTableEntry_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Tooltip_MapSymbolObjectives_C_ExecuteUbergraph_WBP_Tooltip_MapSymbolObjectives, K2Node_MakeArray_Array) == 0x000120, "Member 'WBP_Tooltip_MapSymbolObjectives_C_ExecuteUbergraph_WBP_Tooltip_MapSymbolObjectives::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Tooltip_MapSymbolObjectives_C_ExecuteUbergraph_WBP_Tooltip_MapSymbolObjectives, CallFunc_Format_ReturnValue) == 0x000130, "Member 'WBP_Tooltip_MapSymbolObjectives_C_ExecuteUbergraph_WBP_Tooltip_MapSymbolObjectives::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Tooltip_MapSymbolObjectives_C_ExecuteUbergraph_WBP_Tooltip_MapSymbolObjectives, K2Node_Select_Default) == 0x000148, "Member 'WBP_Tooltip_MapSymbolObjectives_C_ExecuteUbergraph_WBP_Tooltip_MapSymbolObjectives::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Tooltip_MapSymbolObjectives_C_ExecuteUbergraph_WBP_Tooltip_MapSymbolObjectives, CallFunc_TextIsEmpty_ReturnValue) == 0x000160, "Member 'WBP_Tooltip_MapSymbolObjectives_C_ExecuteUbergraph_WBP_Tooltip_MapSymbolObjectives::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Tooltip_MapSymbolObjectives_C_ExecuteUbergraph_WBP_Tooltip_MapSymbolObjectives, K2Node_Select_Default_1) == 0x000161, "Member 'WBP_Tooltip_MapSymbolObjectives_C_ExecuteUbergraph_WBP_Tooltip_MapSymbolObjectives::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_Tooltip_MapSymbolObjectives_C_ExecuteUbergraph_WBP_Tooltip_MapSymbolObjectives, Temp_bool_Variable_3) == 0x000162, "Member 'WBP_Tooltip_MapSymbolObjectives_C_ExecuteUbergraph_WBP_Tooltip_MapSymbolObjectives::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_Tooltip_MapSymbolObjectives_C_ExecuteUbergraph_WBP_Tooltip_MapSymbolObjectives, CallFunc_IsValid_ReturnValue) == 0x000163, "Member 'WBP_Tooltip_MapSymbolObjectives_C_ExecuteUbergraph_WBP_Tooltip_MapSymbolObjectives::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Tooltip_MapSymbolObjectives_C_ExecuteUbergraph_WBP_Tooltip_MapSymbolObjectives, K2Node_Select_Default_2) == 0x000168, "Member 'WBP_Tooltip_MapSymbolObjectives_C_ExecuteUbergraph_WBP_Tooltip_MapSymbolObjectives::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_Tooltip_MapSymbolObjectives_C_ExecuteUbergraph_WBP_Tooltip_MapSymbolObjectives, K2Node_Select_Default_3) == 0x000180, "Member 'WBP_Tooltip_MapSymbolObjectives_C_ExecuteUbergraph_WBP_Tooltip_MapSymbolObjectives::K2Node_Select_Default_3' has a wrong offset!");

// Function WBP_Tooltip_MapSymbolObjectives.WBP_Tooltip_MapSymbolObjectives_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_Tooltip_MapSymbolObjectives_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Tooltip_MapSymbolObjectives_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_Tooltip_MapSymbolObjectives_C_PreConstruct");
static_assert(sizeof(WBP_Tooltip_MapSymbolObjectives_C_PreConstruct) == 0x000001, "Wrong size on WBP_Tooltip_MapSymbolObjectives_C_PreConstruct");
static_assert(offsetof(WBP_Tooltip_MapSymbolObjectives_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_Tooltip_MapSymbolObjectives_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

