#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CE_InvItemSkin_Button

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "ModKit_structs.hpp"


namespace SDK::Params
{

// Function WBP_CE_InvItemSkin_Button.WBP_CE_InvItemSkin_Button_C.ExecuteUbergraph_WBP_CE_InvItemSkin_Button
// 0x0228 (0x0228 - 0x0000)
struct WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UObject>                 K2Node_CustomEvent_Icon;                           // 0x0010(0x0028)(ConstParm, UObjectWrapper, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_LoadedAsset;                    // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               K2Node_CustomEvent_IconTexture;                    // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_InText;                         // 0x0058(0x0018)()
	EUMGSequencePlayMode                          K2Node_CustomEvent_PlayMode_1;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          K2Node_CustomEvent_PlayMode;                       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_CE_InvItem_Button_C*               CallFunc_GetParentWidgetOfClass_ReturnValue;       // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidPrimaryAssetId_ReturnValue;        // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* LoadedAsset)>   K2Node_CreateDelegate_OutputDelegate;              // 0x009C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPrimaryAssetId>                CallFunc_PrepItemToItemSkinIdMap_OutItemSkinsToLoad; // 0x00B0(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsValidPrimaryAssetId_ReturnValue_1;      // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncActionLoadPrimaryAssetList*       CallFunc_AsyncLoadPrimaryAssetList_ReturnValue;    // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AGBInvItem*>                     CallFunc_Map_Keys_Keys;                            // 0x00E0(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_CE_ListObjBase_C*                   K2Node_CustomEvent_CharactedEditorListObjBase;     // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_CE_ListObj_InvItemSkin_C*           K2Node_DynamicCast_AsBP_CE_List_Obj_Inv_Item_Skin; // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x3];                                      // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGBInvItem*                             CallFunc_Array_Get_Item;                           // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPrimaryAssetId                        CallFunc_Map_Find_Value;                           // 0x0118(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bIsChecked;                     // 0x012A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12B[0x1];                                      // 0x012B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_GetInvItemSkinNameTag_ReturnValue;        // 0x012C(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CE_ListFilters_InvItemSkins_C*     CallFunc_Create_ReturnValue;                       // 0x0138(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPrimaryAssetId                        CallFunc_GetInvItemSkinInfoByNameTag_OutSkinAssetId; // 0x0140(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetInvItemSkinInfoByNameTag_ReturnValue;  // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetARSTextFromPrimaryAsset_OutText;       // 0x0158(0x0018)()
	bool                                          CallFunc_GetARSTextFromPrimaryAsset_ReturnValue;   // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UObject>                 CallFunc_GetARSSoftObjectPtrFromPrimaryAsset_OutSoftObjectPtr; // 0x0178(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_GetARSSoftObjectPtrFromPrimaryAsset_ReturnValue; // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A1[0x3];                                      // 0x01A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bIsChecked)>              K2Node_CreateDelegate_OutputDelegate_1;            // 0x01A8(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B9[0x3];                                      // 0x01B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x01C0(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UBP_CE_ListObjBase_C* CharactedEditorListObjBase)> K2Node_CreateDelegate_OutputDelegate_3; // 0x01D0(0x0010)(ZeroConstructor, NoDestructor)
	class UWBP_CE_ListFilters_InvItemSkins_C*     CallFunc_GetFirstWidgetOfClass_ReturnValue;        // 0x01E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ShouldShowCanApplyToAttachments_bShow;    // 0x01E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1EA[0x6];                                      // 0x01EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UObject*>                        Temp_object_Variable;                              // 0x01F0(0x0010)(ReferenceParm)
	bool                                          CallFunc_Config_GetBool_bValid;                    // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Config_GetBool_ReturnValue;               // 0x0201(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_202[0x6];                                      // 0x0202(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UObject*>                        K2Node_CustomEvent_Loaded;                         // 0x0208(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(const TArray<class UObject*>& Loaded)> K2Node_CreateDelegate_OutputDelegate_4;    // 0x0218(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button) == 0x000008, "Wrong alignment on WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button");
static_assert(sizeof(WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button) == 0x000228, "Wrong size on WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button");
static_assert(offsetof(WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button, EntryPoint) == 0x000000, "Member 'WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000008, "Member 'WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button, K2Node_CustomEvent_Icon) == 0x000010, "Member 'WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button::K2Node_CustomEvent_Icon' has a wrong offset!");
static_assert(offsetof(WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button, K2Node_CustomEvent_LoadedAsset) == 0x000038, "Member 'WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button::K2Node_CustomEvent_LoadedAsset' has a wrong offset!");
static_assert(offsetof(WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button, K2Node_CustomEvent_IconTexture) == 0x000040, "Member 'WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button::K2Node_CustomEvent_IconTexture' has a wrong offset!");
static_assert(offsetof(WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button, K2Node_DynamicCast_AsTexture_2D) == 0x000048, "Member 'WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button, K2Node_CustomEvent_InText) == 0x000058, "Member 'WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button::K2Node_CustomEvent_InText' has a wrong offset!");
static_assert(offsetof(WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button, K2Node_CustomEvent_PlayMode_1) == 0x000070, "Member 'WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button::K2Node_CustomEvent_PlayMode_1' has a wrong offset!");
static_assert(offsetof(WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button, CallFunc_PlayAnimation_ReturnValue) == 0x000078, "Member 'WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button, K2Node_CustomEvent_PlayMode) == 0x000080, "Member 'WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button::K2Node_CustomEvent_PlayMode' has a wrong offset!");
static_assert(offsetof(WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button, CallFunc_PlayAnimation_ReturnValue_1) == 0x000088, "Member 'WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button, CallFunc_GetParentWidgetOfClass_ReturnValue) == 0x000090, "Member 'WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button::CallFunc_GetParentWidgetOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button, CallFunc_IsValidPrimaryAssetId_ReturnValue) == 0x000098, "Member 'WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button::CallFunc_IsValidPrimaryAssetId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button, K2Node_CreateDelegate_OutputDelegate) == 0x00009C, "Member 'WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button, CallFunc_PrepItemToItemSkinIdMap_OutItemSkinsToLoad) == 0x0000B0, "Member 'WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button::CallFunc_PrepItemToItemSkinIdMap_OutItemSkinsToLoad' has a wrong offset!");
static_assert(offsetof(WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button, CallFunc_IsValidPrimaryAssetId_ReturnValue_1) == 0x0000C0, "Member 'WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button::CallFunc_IsValidPrimaryAssetId_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button, CallFunc_AsyncLoadPrimaryAssetList_ReturnValue) == 0x0000C8, "Member 'WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button::CallFunc_AsyncLoadPrimaryAssetList_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button, CallFunc_IsValid_ReturnValue) == 0x0000D0, "Member 'WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button, CallFunc_Array_Length_ReturnValue) == 0x0000D4, "Member 'WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button, CallFunc_Greater_IntInt_ReturnValue) == 0x0000D8, "Member 'WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button, CallFunc_Map_Keys_Keys) == 0x0000E0, "Member 'WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button, CallFunc_Array_Length_ReturnValue_1) == 0x0000F0, "Member 'WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button, K2Node_CustomEvent_CharactedEditorListObjBase) == 0x0000F8, "Member 'WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button::K2Node_CustomEvent_CharactedEditorListObjBase' has a wrong offset!");
static_assert(offsetof(WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button, K2Node_DynamicCast_AsBP_CE_List_Obj_Inv_Item_Skin) == 0x000100, "Member 'WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button::K2Node_DynamicCast_AsBP_CE_List_Obj_Inv_Item_Skin' has a wrong offset!");
static_assert(offsetof(WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button, K2Node_DynamicCast_bSuccess_1) == 0x000108, "Member 'WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button, Temp_int_Array_Index_Variable) == 0x00010C, "Member 'WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button, CallFunc_Array_Get_Item) == 0x000110, "Member 'WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button, CallFunc_Map_Find_Value) == 0x000118, "Member 'WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button, CallFunc_Map_Find_ReturnValue) == 0x000128, "Member 'WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button, CallFunc_IsValid_ReturnValue_1) == 0x000129, "Member 'WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button, K2Node_CustomEvent_bIsChecked) == 0x00012A, "Member 'WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button::K2Node_CustomEvent_bIsChecked' has a wrong offset!");
static_assert(offsetof(WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button, CallFunc_GetInvItemSkinNameTag_ReturnValue) == 0x00012C, "Member 'WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button::CallFunc_GetInvItemSkinNameTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button, CallFunc_Create_ReturnValue) == 0x000138, "Member 'WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button, CallFunc_GetInvItemSkinInfoByNameTag_OutSkinAssetId) == 0x000140, "Member 'WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button::CallFunc_GetInvItemSkinInfoByNameTag_OutSkinAssetId' has a wrong offset!");
static_assert(offsetof(WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button, CallFunc_GetInvItemSkinInfoByNameTag_ReturnValue) == 0x000150, "Member 'WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button::CallFunc_GetInvItemSkinInfoByNameTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button, CallFunc_GetARSTextFromPrimaryAsset_OutText) == 0x000158, "Member 'WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button::CallFunc_GetARSTextFromPrimaryAsset_OutText' has a wrong offset!");
static_assert(offsetof(WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button, CallFunc_GetARSTextFromPrimaryAsset_ReturnValue) == 0x000170, "Member 'WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button::CallFunc_GetARSTextFromPrimaryAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button, CallFunc_GetARSSoftObjectPtrFromPrimaryAsset_OutSoftObjectPtr) == 0x000178, "Member 'WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button::CallFunc_GetARSSoftObjectPtrFromPrimaryAsset_OutSoftObjectPtr' has a wrong offset!");
static_assert(offsetof(WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button, CallFunc_GetARSSoftObjectPtrFromPrimaryAsset_ReturnValue) == 0x0001A0, "Member 'WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button::CallFunc_GetARSSoftObjectPtrFromPrimaryAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button, Temp_int_Loop_Counter_Variable) == 0x0001A4, "Member 'WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button, K2Node_CreateDelegate_OutputDelegate_1) == 0x0001A8, "Member 'WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button, CallFunc_Less_IntInt_ReturnValue) == 0x0001B8, "Member 'WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button, CallFunc_Add_IntInt_ReturnValue) == 0x0001BC, "Member 'WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button, K2Node_CreateDelegate_OutputDelegate_2) == 0x0001C0, "Member 'WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button, K2Node_CreateDelegate_OutputDelegate_3) == 0x0001D0, "Member 'WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button, CallFunc_GetFirstWidgetOfClass_ReturnValue) == 0x0001E0, "Member 'WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button::CallFunc_GetFirstWidgetOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button, CallFunc_IsValid_ReturnValue_2) == 0x0001E8, "Member 'WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button, CallFunc_ShouldShowCanApplyToAttachments_bShow) == 0x0001E9, "Member 'WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button::CallFunc_ShouldShowCanApplyToAttachments_bShow' has a wrong offset!");
static_assert(offsetof(WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button, Temp_object_Variable) == 0x0001F0, "Member 'WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button, CallFunc_Config_GetBool_bValid) == 0x000200, "Member 'WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button::CallFunc_Config_GetBool_bValid' has a wrong offset!");
static_assert(offsetof(WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button, CallFunc_Config_GetBool_ReturnValue) == 0x000201, "Member 'WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button::CallFunc_Config_GetBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button, K2Node_CustomEvent_Loaded) == 0x000208, "Member 'WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button, K2Node_CreateDelegate_OutputDelegate_4) == 0x000218, "Member 'WBP_CE_InvItemSkin_Button_C_ExecuteUbergraph_WBP_CE_InvItemSkin_Button::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");

// Function WBP_CE_InvItemSkin_Button.WBP_CE_InvItemSkin_Button_C.OnApplyToChildrenCheckStateChanged_Event_0
// 0x0001 (0x0001 - 0x0000)
struct WBP_CE_InvItemSkin_Button_C_OnApplyToChildrenCheckStateChanged_Event_0 final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_CE_InvItemSkin_Button_C_OnApplyToChildrenCheckStateChanged_Event_0) == 0x000001, "Wrong alignment on WBP_CE_InvItemSkin_Button_C_OnApplyToChildrenCheckStateChanged_Event_0");
static_assert(sizeof(WBP_CE_InvItemSkin_Button_C_OnApplyToChildrenCheckStateChanged_Event_0) == 0x000001, "Wrong size on WBP_CE_InvItemSkin_Button_C_OnApplyToChildrenCheckStateChanged_Event_0");
static_assert(offsetof(WBP_CE_InvItemSkin_Button_C_OnApplyToChildrenCheckStateChanged_Event_0, bIsChecked) == 0x000000, "Member 'WBP_CE_InvItemSkin_Button_C_OnApplyToChildrenCheckStateChanged_Event_0::bIsChecked' has a wrong offset!");

// Function WBP_CE_InvItemSkin_Button.WBP_CE_InvItemSkin_Button_C.OnItemClicked_Event_0
// 0x0008 (0x0008 - 0x0000)
struct WBP_CE_InvItemSkin_Button_C_OnItemClicked_Event_0 final
{
public:
	class UBP_CE_ListObjBase_C*                   CharactedEditorListObjBase;                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CE_InvItemSkin_Button_C_OnItemClicked_Event_0) == 0x000008, "Wrong alignment on WBP_CE_InvItemSkin_Button_C_OnItemClicked_Event_0");
static_assert(sizeof(WBP_CE_InvItemSkin_Button_C_OnItemClicked_Event_0) == 0x000008, "Wrong size on WBP_CE_InvItemSkin_Button_C_OnItemClicked_Event_0");
static_assert(offsetof(WBP_CE_InvItemSkin_Button_C_OnItemClicked_Event_0, CharactedEditorListObjBase) == 0x000000, "Member 'WBP_CE_InvItemSkin_Button_C_OnItemClicked_Event_0::CharactedEditorListObjBase' has a wrong offset!");

// Function WBP_CE_InvItemSkin_Button.WBP_CE_InvItemSkin_Button_C.PlayHoverSkinButtonAnim
// 0x0001 (0x0001 - 0x0000)
struct WBP_CE_InvItemSkin_Button_C_PlayHoverSkinButtonAnim final
{
public:
	EUMGSequencePlayMode                          PlayMode;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CE_InvItemSkin_Button_C_PlayHoverSkinButtonAnim) == 0x000001, "Wrong alignment on WBP_CE_InvItemSkin_Button_C_PlayHoverSkinButtonAnim");
static_assert(sizeof(WBP_CE_InvItemSkin_Button_C_PlayHoverSkinButtonAnim) == 0x000001, "Wrong size on WBP_CE_InvItemSkin_Button_C_PlayHoverSkinButtonAnim");
static_assert(offsetof(WBP_CE_InvItemSkin_Button_C_PlayHoverSkinButtonAnim, PlayMode) == 0x000000, "Member 'WBP_CE_InvItemSkin_Button_C_PlayHoverSkinButtonAnim::PlayMode' has a wrong offset!");

// Function WBP_CE_InvItemSkin_Button.WBP_CE_InvItemSkin_Button_C.PlayHoverSkinNameAnim
// 0x0001 (0x0001 - 0x0000)
struct WBP_CE_InvItemSkin_Button_C_PlayHoverSkinNameAnim final
{
public:
	EUMGSequencePlayMode                          PlayMode;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CE_InvItemSkin_Button_C_PlayHoverSkinNameAnim) == 0x000001, "Wrong alignment on WBP_CE_InvItemSkin_Button_C_PlayHoverSkinNameAnim");
static_assert(sizeof(WBP_CE_InvItemSkin_Button_C_PlayHoverSkinNameAnim) == 0x000001, "Wrong size on WBP_CE_InvItemSkin_Button_C_PlayHoverSkinNameAnim");
static_assert(offsetof(WBP_CE_InvItemSkin_Button_C_PlayHoverSkinNameAnim, PlayMode) == 0x000000, "Member 'WBP_CE_InvItemSkin_Button_C_PlayHoverSkinNameAnim::PlayMode' has a wrong offset!");

// Function WBP_CE_InvItemSkin_Button.WBP_CE_InvItemSkin_Button_C.SetSkinDisplayName
// 0x0018 (0x0018 - 0x0000)
struct WBP_CE_InvItemSkin_Button_C_SetSkinDisplayName final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_CE_InvItemSkin_Button_C_SetSkinDisplayName) == 0x000008, "Wrong alignment on WBP_CE_InvItemSkin_Button_C_SetSkinDisplayName");
static_assert(sizeof(WBP_CE_InvItemSkin_Button_C_SetSkinDisplayName) == 0x000018, "Wrong size on WBP_CE_InvItemSkin_Button_C_SetSkinDisplayName");
static_assert(offsetof(WBP_CE_InvItemSkin_Button_C_SetSkinDisplayName, InText) == 0x000000, "Member 'WBP_CE_InvItemSkin_Button_C_SetSkinDisplayName::InText' has a wrong offset!");

// Function WBP_CE_InvItemSkin_Button.WBP_CE_InvItemSkin_Button_C.SetSkinIcon
// 0x0008 (0x0008 - 0x0000)
struct WBP_CE_InvItemSkin_Button_C_SetSkinIcon final
{
public:
	class UTexture*                               IconTexture;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CE_InvItemSkin_Button_C_SetSkinIcon) == 0x000008, "Wrong alignment on WBP_CE_InvItemSkin_Button_C_SetSkinIcon");
static_assert(sizeof(WBP_CE_InvItemSkin_Button_C_SetSkinIcon) == 0x000008, "Wrong size on WBP_CE_InvItemSkin_Button_C_SetSkinIcon");
static_assert(offsetof(WBP_CE_InvItemSkin_Button_C_SetSkinIcon, IconTexture) == 0x000000, "Member 'WBP_CE_InvItemSkin_Button_C_SetSkinIcon::IconTexture' has a wrong offset!");

// Function WBP_CE_InvItemSkin_Button.WBP_CE_InvItemSkin_Button_C.OnAsyncLoadIconComplete_Event
// 0x0008 (0x0008 - 0x0000)
struct WBP_CE_InvItemSkin_Button_C_OnAsyncLoadIconComplete_Event final
{
public:
	class UObject*                                LoadedAsset;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CE_InvItemSkin_Button_C_OnAsyncLoadIconComplete_Event) == 0x000008, "Wrong alignment on WBP_CE_InvItemSkin_Button_C_OnAsyncLoadIconComplete_Event");
static_assert(sizeof(WBP_CE_InvItemSkin_Button_C_OnAsyncLoadIconComplete_Event) == 0x000008, "Wrong size on WBP_CE_InvItemSkin_Button_C_OnAsyncLoadIconComplete_Event");
static_assert(offsetof(WBP_CE_InvItemSkin_Button_C_OnAsyncLoadIconComplete_Event, LoadedAsset) == 0x000000, "Member 'WBP_CE_InvItemSkin_Button_C_OnAsyncLoadIconComplete_Event::LoadedAsset' has a wrong offset!");

// Function WBP_CE_InvItemSkin_Button.WBP_CE_InvItemSkin_Button_C.SetSkinIconAsync
// 0x0028 (0x0028 - 0x0000)
struct WBP_CE_InvItemSkin_Button_C_SetSkinIconAsync final
{
public:
	TSoftObjectPtr<class UObject>                 Icon;                                              // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CE_InvItemSkin_Button_C_SetSkinIconAsync) == 0x000008, "Wrong alignment on WBP_CE_InvItemSkin_Button_C_SetSkinIconAsync");
static_assert(sizeof(WBP_CE_InvItemSkin_Button_C_SetSkinIconAsync) == 0x000028, "Wrong size on WBP_CE_InvItemSkin_Button_C_SetSkinIconAsync");
static_assert(offsetof(WBP_CE_InvItemSkin_Button_C_SetSkinIconAsync, Icon) == 0x000000, "Member 'WBP_CE_InvItemSkin_Button_C_SetSkinIconAsync::Icon' has a wrong offset!");

// Function WBP_CE_InvItemSkin_Button.WBP_CE_InvItemSkin_Button_C.Completed_F579F93A80B24E57B03785CE8815A77A
// 0x0010 (0x0010 - 0x0000)
struct WBP_CE_InvItemSkin_Button_C_Completed_F579F93A80B24E57B03785CE8815A77A final
{
public:
	TArray<class UObject*>                        Loaded;                                            // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_CE_InvItemSkin_Button_C_Completed_F579F93A80B24E57B03785CE8815A77A) == 0x000008, "Wrong alignment on WBP_CE_InvItemSkin_Button_C_Completed_F579F93A80B24E57B03785CE8815A77A");
static_assert(sizeof(WBP_CE_InvItemSkin_Button_C_Completed_F579F93A80B24E57B03785CE8815A77A) == 0x000010, "Wrong size on WBP_CE_InvItemSkin_Button_C_Completed_F579F93A80B24E57B03785CE8815A77A");
static_assert(offsetof(WBP_CE_InvItemSkin_Button_C_Completed_F579F93A80B24E57B03785CE8815A77A, Loaded) == 0x000000, "Member 'WBP_CE_InvItemSkin_Button_C_Completed_F579F93A80B24E57B03785CE8815A77A::Loaded' has a wrong offset!");

// Function WBP_CE_InvItemSkin_Button.WBP_CE_InvItemSkin_Button_C.UpdateSkinNameFromItemJson
// 0x0058 (0x0058 - 0x0000)
struct WBP_CE_InvItemSkin_Button_C_UpdateSkinNameFromItemJson final
{
public:
	class FString                                 CallFunc_GetSkinField_ReturnValue;                 // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetStringField_ReturnValue;               // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetSkinField_ReturnValue_1;               // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FPrimaryAssetId                        K2Node_MakeStruct_PrimaryAssetId;                  // 0x0040(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasField_ReturnValue;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_CE_InvItemSkin_Button_C_UpdateSkinNameFromItemJson) == 0x000008, "Wrong alignment on WBP_CE_InvItemSkin_Button_C_UpdateSkinNameFromItemJson");
static_assert(sizeof(WBP_CE_InvItemSkin_Button_C_UpdateSkinNameFromItemJson) == 0x000058, "Wrong size on WBP_CE_InvItemSkin_Button_C_UpdateSkinNameFromItemJson");
static_assert(offsetof(WBP_CE_InvItemSkin_Button_C_UpdateSkinNameFromItemJson, CallFunc_GetSkinField_ReturnValue) == 0x000000, "Member 'WBP_CE_InvItemSkin_Button_C_UpdateSkinNameFromItemJson::CallFunc_GetSkinField_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CE_InvItemSkin_Button_C_UpdateSkinNameFromItemJson, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'WBP_CE_InvItemSkin_Button_C_UpdateSkinNameFromItemJson::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CE_InvItemSkin_Button_C_UpdateSkinNameFromItemJson, CallFunc_GetStringField_ReturnValue) == 0x000018, "Member 'WBP_CE_InvItemSkin_Button_C_UpdateSkinNameFromItemJson::CallFunc_GetStringField_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CE_InvItemSkin_Button_C_UpdateSkinNameFromItemJson, CallFunc_Conv_StringToName_ReturnValue) == 0x000028, "Member 'WBP_CE_InvItemSkin_Button_C_UpdateSkinNameFromItemJson::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CE_InvItemSkin_Button_C_UpdateSkinNameFromItemJson, CallFunc_GetSkinField_ReturnValue_1) == 0x000030, "Member 'WBP_CE_InvItemSkin_Button_C_UpdateSkinNameFromItemJson::CallFunc_GetSkinField_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CE_InvItemSkin_Button_C_UpdateSkinNameFromItemJson, K2Node_MakeStruct_PrimaryAssetId) == 0x000040, "Member 'WBP_CE_InvItemSkin_Button_C_UpdateSkinNameFromItemJson::K2Node_MakeStruct_PrimaryAssetId' has a wrong offset!");
static_assert(offsetof(WBP_CE_InvItemSkin_Button_C_UpdateSkinNameFromItemJson, CallFunc_HasField_ReturnValue) == 0x000050, "Member 'WBP_CE_InvItemSkin_Button_C_UpdateSkinNameFromItemJson::CallFunc_HasField_ReturnValue' has a wrong offset!");

// Function WBP_CE_InvItemSkin_Button.WBP_CE_InvItemSkin_Button_C.SetItemSkinId
// 0x0058 (0x0058 - 0x0000)
struct WBP_CE_InvItemSkin_Button_C_SetItemSkinId final
{
public:
	struct FPrimaryAssetId                        InDesiredInvItemSkinId;                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           LocalOldInvItemSkinTypeTag;                        // 0x0010(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	class FName                                   OLD_LocalItemSkinName;                             // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FPrimaryAssetId>                LocalValidSkinIds;                                 // 0x0020(0x0010)(Edit, BlueprintVisible)
	class FName                                   OLD_LoadoutName;                                   // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_GameplayTag_ReturnValue;         // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPrimaryAssetId                        CallFunc_ValidateOrReplaceInvItemSkin_OutValidInvItemSkinId; // 0x003C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_GetInvItemSkinTypeTag_ReturnValue;        // 0x004C(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CE_InvItemSkin_Button_C_SetItemSkinId) == 0x000008, "Wrong alignment on WBP_CE_InvItemSkin_Button_C_SetItemSkinId");
static_assert(sizeof(WBP_CE_InvItemSkin_Button_C_SetItemSkinId) == 0x000058, "Wrong size on WBP_CE_InvItemSkin_Button_C_SetItemSkinId");
static_assert(offsetof(WBP_CE_InvItemSkin_Button_C_SetItemSkinId, InDesiredInvItemSkinId) == 0x000000, "Member 'WBP_CE_InvItemSkin_Button_C_SetItemSkinId::InDesiredInvItemSkinId' has a wrong offset!");
static_assert(offsetof(WBP_CE_InvItemSkin_Button_C_SetItemSkinId, LocalOldInvItemSkinTypeTag) == 0x000010, "Member 'WBP_CE_InvItemSkin_Button_C_SetItemSkinId::LocalOldInvItemSkinTypeTag' has a wrong offset!");
static_assert(offsetof(WBP_CE_InvItemSkin_Button_C_SetItemSkinId, OLD_LocalItemSkinName) == 0x000018, "Member 'WBP_CE_InvItemSkin_Button_C_SetItemSkinId::OLD_LocalItemSkinName' has a wrong offset!");
static_assert(offsetof(WBP_CE_InvItemSkin_Button_C_SetItemSkinId, LocalValidSkinIds) == 0x000020, "Member 'WBP_CE_InvItemSkin_Button_C_SetItemSkinId::LocalValidSkinIds' has a wrong offset!");
static_assert(offsetof(WBP_CE_InvItemSkin_Button_C_SetItemSkinId, OLD_LoadoutName) == 0x000030, "Member 'WBP_CE_InvItemSkin_Button_C_SetItemSkinId::OLD_LoadoutName' has a wrong offset!");
static_assert(offsetof(WBP_CE_InvItemSkin_Button_C_SetItemSkinId, CallFunc_NotEqual_GameplayTag_ReturnValue) == 0x000038, "Member 'WBP_CE_InvItemSkin_Button_C_SetItemSkinId::CallFunc_NotEqual_GameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CE_InvItemSkin_Button_C_SetItemSkinId, CallFunc_ValidateOrReplaceInvItemSkin_OutValidInvItemSkinId) == 0x00003C, "Member 'WBP_CE_InvItemSkin_Button_C_SetItemSkinId::CallFunc_ValidateOrReplaceInvItemSkin_OutValidInvItemSkinId' has a wrong offset!");
static_assert(offsetof(WBP_CE_InvItemSkin_Button_C_SetItemSkinId, CallFunc_GetInvItemSkinTypeTag_ReturnValue) == 0x00004C, "Member 'WBP_CE_InvItemSkin_Button_C_SetItemSkinId::CallFunc_GetInvItemSkinTypeTag_ReturnValue' has a wrong offset!");

// Function WBP_CE_InvItemSkin_Button.WBP_CE_InvItemSkin_Button_C.GetMostPopularSkinFromOtherItems
// 0x0160 (0x0160 - 0x0000)
struct WBP_CE_InvItemSkin_Button_C_GetMostPopularSkinFromOtherItems final
{
public:
	struct FGameplayTag                           OutMostPopularInvItemSkinNameTag;                  // 0x0000(0x0008)(Parm, OutParm, NoDestructor, HasGetValueTypeHash)
	int32                                         LocalBestIndex;                                    // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LocalBestValue;                                    // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<struct FGameplayTag, int32>              LocalInvItemSkinNameTagMap;                        // 0x0010(0x0050)(Edit, BlueprintVisible)
	TArray<class AGBInvItem*>                     LocalItemList;                                     // 0x0060(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	class AGBCharacter*                           LocalCharacterRef;                                 // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0090(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AGBInvItem*>                     CallFunc_GetInventoryList_ReturnValue;             // 0x0098(0x0010)(ReferenceParm)
	class AGBInvItem*                             CallFunc_Array_Get_Item;                           // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAttachParentActor_ReturnValue;         // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AGBInvItem*>                     CallFunc_GetInvItemsByTags_ReturnValue;            // 0x00C8(0x0010)(ReferenceParm)
	TArray<struct FGameplayTag>                   CallFunc_Map_Keys_Keys;                            // 0x00D8(0x0010)(ReferenceParm)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x3];                                       // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_Array_Get_Item_1;                         // 0x00EC(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 CallFunc_Map_Values_Values;                        // 0x00F8(0x0010)(ReferenceParm)
	class AGBInvItem*                             CallFunc_Array_Get_Item_2;                         // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item_3;                         // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPrimaryAssetId                        CallFunc_GetInvItemSkinId_ReturnValue;             // 0x0114(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_GetInvItemSkinNameTag_ReturnValue;        // 0x0124(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsGameplayTagValid_ReturnValue;           // 0x012D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12E[0x2];                                      // 0x012E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_139[0x3];                                      // 0x0139(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Map_Find_Value;                           // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_145[0x3];                                      // 0x0145(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14D[0x3];                                      // 0x014D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x015C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_CE_InvItemSkin_Button_C_GetMostPopularSkinFromOtherItems) == 0x000008, "Wrong alignment on WBP_CE_InvItemSkin_Button_C_GetMostPopularSkinFromOtherItems");
static_assert(sizeof(WBP_CE_InvItemSkin_Button_C_GetMostPopularSkinFromOtherItems) == 0x000160, "Wrong size on WBP_CE_InvItemSkin_Button_C_GetMostPopularSkinFromOtherItems");
static_assert(offsetof(WBP_CE_InvItemSkin_Button_C_GetMostPopularSkinFromOtherItems, OutMostPopularInvItemSkinNameTag) == 0x000000, "Member 'WBP_CE_InvItemSkin_Button_C_GetMostPopularSkinFromOtherItems::OutMostPopularInvItemSkinNameTag' has a wrong offset!");
static_assert(offsetof(WBP_CE_InvItemSkin_Button_C_GetMostPopularSkinFromOtherItems, LocalBestIndex) == 0x000008, "Member 'WBP_CE_InvItemSkin_Button_C_GetMostPopularSkinFromOtherItems::LocalBestIndex' has a wrong offset!");
static_assert(offsetof(WBP_CE_InvItemSkin_Button_C_GetMostPopularSkinFromOtherItems, LocalBestValue) == 0x00000C, "Member 'WBP_CE_InvItemSkin_Button_C_GetMostPopularSkinFromOtherItems::LocalBestValue' has a wrong offset!");
static_assert(offsetof(WBP_CE_InvItemSkin_Button_C_GetMostPopularSkinFromOtherItems, LocalInvItemSkinNameTagMap) == 0x000010, "Member 'WBP_CE_InvItemSkin_Button_C_GetMostPopularSkinFromOtherItems::LocalInvItemSkinNameTagMap' has a wrong offset!");
static_assert(offsetof(WBP_CE_InvItemSkin_Button_C_GetMostPopularSkinFromOtherItems, LocalItemList) == 0x000060, "Member 'WBP_CE_InvItemSkin_Button_C_GetMostPopularSkinFromOtherItems::LocalItemList' has a wrong offset!");
static_assert(offsetof(WBP_CE_InvItemSkin_Button_C_GetMostPopularSkinFromOtherItems, LocalCharacterRef) == 0x000070, "Member 'WBP_CE_InvItemSkin_Button_C_GetMostPopularSkinFromOtherItems::LocalCharacterRef' has a wrong offset!");
static_assert(offsetof(WBP_CE_InvItemSkin_Button_C_GetMostPopularSkinFromOtherItems, Temp_int_Array_Index_Variable) == 0x000078, "Member 'WBP_CE_InvItemSkin_Button_C_GetMostPopularSkinFromOtherItems::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CE_InvItemSkin_Button_C_GetMostPopularSkinFromOtherItems, Temp_int_Array_Index_Variable_1) == 0x00007C, "Member 'WBP_CE_InvItemSkin_Button_C_GetMostPopularSkinFromOtherItems::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CE_InvItemSkin_Button_C_GetMostPopularSkinFromOtherItems, Temp_int_Loop_Counter_Variable) == 0x000080, "Member 'WBP_CE_InvItemSkin_Button_C_GetMostPopularSkinFromOtherItems::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CE_InvItemSkin_Button_C_GetMostPopularSkinFromOtherItems, CallFunc_Add_IntInt_ReturnValue) == 0x000084, "Member 'WBP_CE_InvItemSkin_Button_C_GetMostPopularSkinFromOtherItems::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CE_InvItemSkin_Button_C_GetMostPopularSkinFromOtherItems, Temp_int_Array_Index_Variable_2) == 0x000088, "Member 'WBP_CE_InvItemSkin_Button_C_GetMostPopularSkinFromOtherItems::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_CE_InvItemSkin_Button_C_GetMostPopularSkinFromOtherItems, Temp_int_Loop_Counter_Variable_1) == 0x00008C, "Member 'WBP_CE_InvItemSkin_Button_C_GetMostPopularSkinFromOtherItems::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CE_InvItemSkin_Button_C_GetMostPopularSkinFromOtherItems, Temp_int_Variable) == 0x000090, "Member 'WBP_CE_InvItemSkin_Button_C_GetMostPopularSkinFromOtherItems::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CE_InvItemSkin_Button_C_GetMostPopularSkinFromOtherItems, CallFunc_Add_IntInt_ReturnValue_1) == 0x000094, "Member 'WBP_CE_InvItemSkin_Button_C_GetMostPopularSkinFromOtherItems::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CE_InvItemSkin_Button_C_GetMostPopularSkinFromOtherItems, CallFunc_GetInventoryList_ReturnValue) == 0x000098, "Member 'WBP_CE_InvItemSkin_Button_C_GetMostPopularSkinFromOtherItems::CallFunc_GetInventoryList_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CE_InvItemSkin_Button_C_GetMostPopularSkinFromOtherItems, CallFunc_Array_Get_Item) == 0x0000A8, "Member 'WBP_CE_InvItemSkin_Button_C_GetMostPopularSkinFromOtherItems::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_CE_InvItemSkin_Button_C_GetMostPopularSkinFromOtherItems, CallFunc_GetAttachParentActor_ReturnValue) == 0x0000B0, "Member 'WBP_CE_InvItemSkin_Button_C_GetMostPopularSkinFromOtherItems::CallFunc_GetAttachParentActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CE_InvItemSkin_Button_C_GetMostPopularSkinFromOtherItems, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0000B8, "Member 'WBP_CE_InvItemSkin_Button_C_GetMostPopularSkinFromOtherItems::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CE_InvItemSkin_Button_C_GetMostPopularSkinFromOtherItems, CallFunc_Array_Length_ReturnValue) == 0x0000BC, "Member 'WBP_CE_InvItemSkin_Button_C_GetMostPopularSkinFromOtherItems::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CE_InvItemSkin_Button_C_GetMostPopularSkinFromOtherItems, CallFunc_Less_IntInt_ReturnValue) == 0x0000C0, "Member 'WBP_CE_InvItemSkin_Button_C_GetMostPopularSkinFromOtherItems::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CE_InvItemSkin_Button_C_GetMostPopularSkinFromOtherItems, CallFunc_GetInvItemsByTags_ReturnValue) == 0x0000C8, "Member 'WBP_CE_InvItemSkin_Button_C_GetMostPopularSkinFromOtherItems::CallFunc_GetInvItemsByTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CE_InvItemSkin_Button_C_GetMostPopularSkinFromOtherItems, CallFunc_Map_Keys_Keys) == 0x0000D8, "Member 'WBP_CE_InvItemSkin_Button_C_GetMostPopularSkinFromOtherItems::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(WBP_CE_InvItemSkin_Button_C_GetMostPopularSkinFromOtherItems, CallFunc_NotEqual_IntInt_ReturnValue) == 0x0000E8, "Member 'WBP_CE_InvItemSkin_Button_C_GetMostPopularSkinFromOtherItems::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CE_InvItemSkin_Button_C_GetMostPopularSkinFromOtherItems, CallFunc_Array_Get_Item_1) == 0x0000EC, "Member 'WBP_CE_InvItemSkin_Button_C_GetMostPopularSkinFromOtherItems::CallFunc_Array_Get_Item_1' has a wrong offset!");
