#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HotspotMapIcon

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_HotspotMapIcon.WBP_HotspotMapIcon_C
// 0x0098 (0x02F8 - 0x0260)
class UWBP_HotspotMapIcon_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       PulseCircle;                                       // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                Button_SelectHotspot;                              // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_RadialGradient;                              // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_0;                                         // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Global;                                    // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FVector2D                              MapPosition;                                       // 0x0290(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FText                                   ShortLocationName;                                 // 0x0298(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	class UGBHotspotDataAsset*                    HotspotRef;                                        // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class UGBHotspotDataAsset* SelectedHotspot)> OnHotspotClicked;     // 0x02B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FTimerHandle                           TimerHandle;                                       // 0x02C8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class UGBHotspotDataAsset* SelectedHotspot)> OnHotspotHovered;     // 0x02D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(class UGBHotspotDataAsset* SelectedHotspot)> OnHotspotDoubleClicked; // 0x02E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	float                                         DoubleClickMaxDelay;                               // 0x02F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LastClickTime;                                     // 0x02F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	class UWidget* Get_SizeBox_Global_ToolTipWidget_0();
	void PreConstruct(bool IsDesignTime);
	void Construct();
	void BndEvt__WBP_HotspotMapIcon_Button_SelectHotspot_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void UserIsHoveringOnIcon();
	void HoverTimer();
	void ExecuteUbergraph_WBP_HotspotMapIcon(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_HotspotMapIcon_C">();
	}
	static class UWBP_HotspotMapIcon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_HotspotMapIcon_C>();
	}
};
static_assert(alignof(UWBP_HotspotMapIcon_C) == 0x000008, "Wrong alignment on UWBP_HotspotMapIcon_C");
static_assert(sizeof(UWBP_HotspotMapIcon_C) == 0x0002F8, "Wrong size on UWBP_HotspotMapIcon_C");
static_assert(offsetof(UWBP_HotspotMapIcon_C, UberGraphFrame) == 0x000260, "Member 'UWBP_HotspotMapIcon_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_HotspotMapIcon_C, PulseCircle) == 0x000268, "Member 'UWBP_HotspotMapIcon_C::PulseCircle' has a wrong offset!");
static_assert(offsetof(UWBP_HotspotMapIcon_C, Button_SelectHotspot) == 0x000270, "Member 'UWBP_HotspotMapIcon_C::Button_SelectHotspot' has a wrong offset!");
static_assert(offsetof(UWBP_HotspotMapIcon_C, Image_RadialGradient) == 0x000278, "Member 'UWBP_HotspotMapIcon_C::Image_RadialGradient' has a wrong offset!");
static_assert(offsetof(UWBP_HotspotMapIcon_C, Overlay_0) == 0x000280, "Member 'UWBP_HotspotMapIcon_C::Overlay_0' has a wrong offset!");
static_assert(offsetof(UWBP_HotspotMapIcon_C, SizeBox_Global) == 0x000288, "Member 'UWBP_HotspotMapIcon_C::SizeBox_Global' has a wrong offset!");
static_assert(offsetof(UWBP_HotspotMapIcon_C, MapPosition) == 0x000290, "Member 'UWBP_HotspotMapIcon_C::MapPosition' has a wrong offset!");
static_assert(offsetof(UWBP_HotspotMapIcon_C, ShortLocationName) == 0x000298, "Member 'UWBP_HotspotMapIcon_C::ShortLocationName' has a wrong offset!");
static_assert(offsetof(UWBP_HotspotMapIcon_C, HotspotRef) == 0x0002B0, "Member 'UWBP_HotspotMapIcon_C::HotspotRef' has a wrong offset!");
static_assert(offsetof(UWBP_HotspotMapIcon_C, OnHotspotClicked) == 0x0002B8, "Member 'UWBP_HotspotMapIcon_C::OnHotspotClicked' has a wrong offset!");
static_assert(offsetof(UWBP_HotspotMapIcon_C, TimerHandle) == 0x0002C8, "Member 'UWBP_HotspotMapIcon_C::TimerHandle' has a wrong offset!");
static_assert(offsetof(UWBP_HotspotMapIcon_C, OnHotspotHovered) == 0x0002D0, "Member 'UWBP_HotspotMapIcon_C::OnHotspotHovered' has a wrong offset!");
static_assert(offsetof(UWBP_HotspotMapIcon_C, OnHotspotDoubleClicked) == 0x0002E0, "Member 'UWBP_HotspotMapIcon_C::OnHotspotDoubleClicked' has a wrong offset!");
static_assert(offsetof(UWBP_HotspotMapIcon_C, DoubleClickMaxDelay) == 0x0002F0, "Member 'UWBP_HotspotMapIcon_C::DoubleClickMaxDelay' has a wrong offset!");
static_assert(offsetof(UWBP_HotspotMapIcon_C, LastClickTime) == 0x0002F4, "Member 'UWBP_HotspotMapIcon_C::LastClickTime' has a wrong offset!");

}

