#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Mission_MatchSummaryPVE

#include "Basic.hpp"

#include "ModKit_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "GroundBranch_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_Mission_MatchSummaryPVE.WBP_Mission_MatchSummaryPVE_C.SetTeamRole
// 0x0050 (0x0050 - 0x0000)
struct WBP_Mission_MatchSummaryPVE_C_SetTeamRole final
{
public:
	class FName                                   TeamRole;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x0010(0x0018)()
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x0030(0x0018)()
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Mission_MatchSummaryPVE_C_SetTeamRole) == 0x000008, "Wrong alignment on WBP_Mission_MatchSummaryPVE_C_SetTeamRole");
static_assert(sizeof(WBP_Mission_MatchSummaryPVE_C_SetTeamRole) == 0x000050, "Wrong size on WBP_Mission_MatchSummaryPVE_C_SetTeamRole");
static_assert(offsetof(WBP_Mission_MatchSummaryPVE_C_SetTeamRole, TeamRole) == 0x000000, "Member 'WBP_Mission_MatchSummaryPVE_C_SetTeamRole::TeamRole' has a wrong offset!");
static_assert(offsetof(WBP_Mission_MatchSummaryPVE_C_SetTeamRole, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000008, "Member 'WBP_Mission_MatchSummaryPVE_C_SetTeamRole::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Mission_MatchSummaryPVE_C_SetTeamRole, CallFunc_Conv_NameToText_ReturnValue) == 0x000010, "Member 'WBP_Mission_MatchSummaryPVE_C_SetTeamRole::CallFunc_Conv_NameToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Mission_MatchSummaryPVE_C_SetTeamRole, CallFunc_TextIsEmpty_ReturnValue) == 0x000028, "Member 'WBP_Mission_MatchSummaryPVE_C_SetTeamRole::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Mission_MatchSummaryPVE_C_SetTeamRole, CallFunc_BooleanOR_ReturnValue) == 0x000029, "Member 'WBP_Mission_MatchSummaryPVE_C_SetTeamRole::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Mission_MatchSummaryPVE_C_SetTeamRole, CallFunc_TextToUpper_ReturnValue) == 0x000030, "Member 'WBP_Mission_MatchSummaryPVE_C_SetTeamRole::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Mission_MatchSummaryPVE_C_SetTeamRole, CallFunc_Not_PreBool_ReturnValue) == 0x000048, "Member 'WBP_Mission_MatchSummaryPVE_C_SetTeamRole::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function WBP_Mission_MatchSummaryPVE.WBP_Mission_MatchSummaryPVE_C.GetTotalTeamBoxVis
// 0x000C (0x000C - 0x0000)
struct WBP_Mission_MatchSummaryPVE_C_GetTotalTeamBoxVis final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Mission_MatchSummaryPVE_C_GetTotalTeamBoxVis) == 0x000004, "Wrong alignment on WBP_Mission_MatchSummaryPVE_C_GetTotalTeamBoxVis");
static_assert(sizeof(WBP_Mission_MatchSummaryPVE_C_GetTotalTeamBoxVis) == 0x00000C, "Wrong size on WBP_Mission_MatchSummaryPVE_C_GetTotalTeamBoxVis");
static_assert(offsetof(WBP_Mission_MatchSummaryPVE_C_GetTotalTeamBoxVis, ReturnValue) == 0x000000, "Member 'WBP_Mission_MatchSummaryPVE_C_GetTotalTeamBoxVis::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Mission_MatchSummaryPVE_C_GetTotalTeamBoxVis, Temp_bool_Variable) == 0x000001, "Member 'WBP_Mission_MatchSummaryPVE_C_GetTotalTeamBoxVis::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Mission_MatchSummaryPVE_C_GetTotalTeamBoxVis, Temp_byte_Variable) == 0x000002, "Member 'WBP_Mission_MatchSummaryPVE_C_GetTotalTeamBoxVis::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Mission_MatchSummaryPVE_C_GetTotalTeamBoxVis, Temp_byte_Variable_1) == 0x000003, "Member 'WBP_Mission_MatchSummaryPVE_C_GetTotalTeamBoxVis::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Mission_MatchSummaryPVE_C_GetTotalTeamBoxVis, CallFunc_GetChildrenCount_ReturnValue) == 0x000004, "Member 'WBP_Mission_MatchSummaryPVE_C_GetTotalTeamBoxVis::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Mission_MatchSummaryPVE_C_GetTotalTeamBoxVis, CallFunc_Greater_IntInt_ReturnValue) == 0x000008, "Member 'WBP_Mission_MatchSummaryPVE_C_GetTotalTeamBoxVis::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Mission_MatchSummaryPVE_C_GetTotalTeamBoxVis, K2Node_Select_Default) == 0x000009, "Member 'WBP_Mission_MatchSummaryPVE_C_GetTotalTeamBoxVis::K2Node_Select_Default' has a wrong offset!");

// Function WBP_Mission_MatchSummaryPVE.WBP_Mission_MatchSummaryPVE_C.OnMatchStatsUpdated
// 0x0008 (0x0008 - 0x0000)
struct WBP_Mission_MatchSummaryPVE_C_OnMatchStatsUpdated final
{
public:
	class AGBGameState*                           GameState;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Mission_MatchSummaryPVE_C_OnMatchStatsUpdated) == 0x000008, "Wrong alignment on WBP_Mission_MatchSummaryPVE_C_OnMatchStatsUpdated");
static_assert(sizeof(WBP_Mission_MatchSummaryPVE_C_OnMatchStatsUpdated) == 0x000008, "Wrong size on WBP_Mission_MatchSummaryPVE_C_OnMatchStatsUpdated");
static_assert(offsetof(WBP_Mission_MatchSummaryPVE_C_OnMatchStatsUpdated, GameState) == 0x000000, "Member 'WBP_Mission_MatchSummaryPVE_C_OnMatchStatsUpdated::GameState' has a wrong offset!");

// Function WBP_Mission_MatchSummaryPVE.WBP_Mission_MatchSummaryPVE_C.ExecuteUbergraph_WBP_Mission_MatchSummaryPVE
// 0x01F8 (0x01F8 - 0x0000)
struct WBP_Mission_MatchSummaryPVE_C_ExecuteUbergraph_WBP_Mission_MatchSummaryPVE final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AGBGameState*                           K2Node_CustomEvent_GameState;                      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetRoundNumber_ReturnValue;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0018(0x0018)()
	int32                                         CallFunc_GetCumulativeScoreForTeam_ReturnValue;    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0038(0x0018)()
	TDelegate<void(class AGBGameState* GameState)> K2Node_CreateDelegate_OutputDelegate;             // 0x0050(0x0010)(ZeroConstructor, NoDestructor)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0060(0x0028)()
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0090(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00D0(0x0010)(ReferenceParm)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00E8(0x0018)()
	class AGBGameState*                           K2Node_DynamicCast_AsGBGame_State;                 // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue_1;               // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGBTeamInfo                            CallFunc_GetPlayerTeamInfo_ReturnValue;            // 0x0118(0x0018)(NoDestructor)
	class AGBGameState*                           K2Node_DynamicCast_AsGBGame_State_1;               // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUInt64                                CallFunc_GetGameModeModID_ReturnValue;             // 0x0140(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x0150(0x0018)()
	class FName                                   CallFunc_GetGameModeName_ReturnValue;              // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Select_Default;                             // 0x0170(0x0018)(ConstParm)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0188(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x0198(0x0018)()
	class FText                                   CallFunc_GetLocalisedGameText_ReturnValue;         // 0x01B0(0x0018)()
	class FText                                   CallFunc_TextToUpper_ReturnValue_1;                // 0x01C8(0x0018)()
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue_2;               // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGBGameState*                           K2Node_DynamicCast_AsGBGame_State_2;               // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Mission_MatchSummaryPVE_C_ExecuteUbergraph_WBP_Mission_MatchSummaryPVE) == 0x000008, "Wrong alignment on WBP_Mission_MatchSummaryPVE_C_ExecuteUbergraph_WBP_Mission_MatchSummaryPVE");
static_assert(sizeof(WBP_Mission_MatchSummaryPVE_C_ExecuteUbergraph_WBP_Mission_MatchSummaryPVE) == 0x0001F8, "Wrong size on WBP_Mission_MatchSummaryPVE_C_ExecuteUbergraph_WBP_Mission_MatchSummaryPVE");
static_assert(offsetof(WBP_Mission_MatchSummaryPVE_C_ExecuteUbergraph_WBP_Mission_MatchSummaryPVE, EntryPoint) == 0x000000, "Member 'WBP_Mission_MatchSummaryPVE_C_ExecuteUbergraph_WBP_Mission_MatchSummaryPVE::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Mission_MatchSummaryPVE_C_ExecuteUbergraph_WBP_Mission_MatchSummaryPVE, Temp_bool_Variable) == 0x000004, "Member 'WBP_Mission_MatchSummaryPVE_C_ExecuteUbergraph_WBP_Mission_MatchSummaryPVE::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Mission_MatchSummaryPVE_C_ExecuteUbergraph_WBP_Mission_MatchSummaryPVE, K2Node_CustomEvent_GameState) == 0x000008, "Member 'WBP_Mission_MatchSummaryPVE_C_ExecuteUbergraph_WBP_Mission_MatchSummaryPVE::K2Node_CustomEvent_GameState' has a wrong offset!");
static_assert(offsetof(WBP_Mission_MatchSummaryPVE_C_ExecuteUbergraph_WBP_Mission_MatchSummaryPVE, CallFunc_GetRoundNumber_ReturnValue) == 0x000010, "Member 'WBP_Mission_MatchSummaryPVE_C_ExecuteUbergraph_WBP_Mission_MatchSummaryPVE::CallFunc_GetRoundNumber_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Mission_MatchSummaryPVE_C_ExecuteUbergraph_WBP_Mission_MatchSummaryPVE, CallFunc_Conv_IntToText_ReturnValue) == 0x000018, "Member 'WBP_Mission_MatchSummaryPVE_C_ExecuteUbergraph_WBP_Mission_MatchSummaryPVE::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Mission_MatchSummaryPVE_C_ExecuteUbergraph_WBP_Mission_MatchSummaryPVE, CallFunc_GetCumulativeScoreForTeam_ReturnValue) == 0x000030, "Member 'WBP_Mission_MatchSummaryPVE_C_ExecuteUbergraph_WBP_Mission_MatchSummaryPVE::CallFunc_GetCumulativeScoreForTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Mission_MatchSummaryPVE_C_ExecuteUbergraph_WBP_Mission_MatchSummaryPVE, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000038, "Member 'WBP_Mission_MatchSummaryPVE_C_ExecuteUbergraph_WBP_Mission_MatchSummaryPVE::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Mission_MatchSummaryPVE_C_ExecuteUbergraph_WBP_Mission_MatchSummaryPVE, K2Node_CreateDelegate_OutputDelegate) == 0x000050, "Member 'WBP_Mission_MatchSummaryPVE_C_ExecuteUbergraph_WBP_Mission_MatchSummaryPVE::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Mission_MatchSummaryPVE_C_ExecuteUbergraph_WBP_Mission_MatchSummaryPVE, K2Node_MakeStruct_SlateColor) == 0x000060, "Member 'WBP_Mission_MatchSummaryPVE_C_ExecuteUbergraph_WBP_Mission_MatchSummaryPVE::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WBP_Mission_MatchSummaryPVE_C_ExecuteUbergraph_WBP_Mission_MatchSummaryPVE, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000088, "Member 'WBP_Mission_MatchSummaryPVE_C_ExecuteUbergraph_WBP_Mission_MatchSummaryPVE::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Mission_MatchSummaryPVE_C_ExecuteUbergraph_WBP_Mission_MatchSummaryPVE, K2Node_MakeStruct_FormatArgumentData) == 0x000090, "Member 'WBP_Mission_MatchSummaryPVE_C_ExecuteUbergraph_WBP_Mission_MatchSummaryPVE::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_Mission_MatchSummaryPVE_C_ExecuteUbergraph_WBP_Mission_MatchSummaryPVE, K2Node_MakeArray_Array) == 0x0000D0, "Member 'WBP_Mission_MatchSummaryPVE_C_ExecuteUbergraph_WBP_Mission_MatchSummaryPVE::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Mission_MatchSummaryPVE_C_ExecuteUbergraph_WBP_Mission_MatchSummaryPVE, CallFunc_GetGameState_ReturnValue) == 0x0000E0, "Member 'WBP_Mission_MatchSummaryPVE_C_ExecuteUbergraph_WBP_Mission_MatchSummaryPVE::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Mission_MatchSummaryPVE_C_ExecuteUbergraph_WBP_Mission_MatchSummaryPVE, CallFunc_Format_ReturnValue) == 0x0000E8, "Member 'WBP_Mission_MatchSummaryPVE_C_ExecuteUbergraph_WBP_Mission_MatchSummaryPVE::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Mission_MatchSummaryPVE_C_ExecuteUbergraph_WBP_Mission_MatchSummaryPVE, K2Node_DynamicCast_AsGBGame_State) == 0x000100, "Member 'WBP_Mission_MatchSummaryPVE_C_ExecuteUbergraph_WBP_Mission_MatchSummaryPVE::K2Node_DynamicCast_AsGBGame_State' has a wrong offset!");
static_assert(offsetof(WBP_Mission_MatchSummaryPVE_C_ExecuteUbergraph_WBP_Mission_MatchSummaryPVE, K2Node_DynamicCast_bSuccess) == 0x000108, "Member 'WBP_Mission_MatchSummaryPVE_C_ExecuteUbergraph_WBP_Mission_MatchSummaryPVE::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Mission_MatchSummaryPVE_C_ExecuteUbergraph_WBP_Mission_MatchSummaryPVE, CallFunc_GetGameState_ReturnValue_1) == 0x000110, "Member 'WBP_Mission_MatchSummaryPVE_C_ExecuteUbergraph_WBP_Mission_MatchSummaryPVE::CallFunc_GetGameState_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Mission_MatchSummaryPVE_C_ExecuteUbergraph_WBP_Mission_MatchSummaryPVE, CallFunc_GetPlayerTeamInfo_ReturnValue) == 0x000118, "Member 'WBP_Mission_MatchSummaryPVE_C_ExecuteUbergraph_WBP_Mission_MatchSummaryPVE::CallFunc_GetPlayerTeamInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Mission_MatchSummaryPVE_C_ExecuteUbergraph_WBP_Mission_MatchSummaryPVE, K2Node_DynamicCast_AsGBGame_State_1) == 0x000130, "Member 'WBP_Mission_MatchSummaryPVE_C_ExecuteUbergraph_WBP_Mission_MatchSummaryPVE::K2Node_DynamicCast_AsGBGame_State_1' has a wrong offset!");
static_assert(offsetof(WBP_Mission_MatchSummaryPVE_C_ExecuteUbergraph_WBP_Mission_MatchSummaryPVE, K2Node_DynamicCast_bSuccess_1) == 0x000138, "Member 'WBP_Mission_MatchSummaryPVE_C_ExecuteUbergraph_WBP_Mission_MatchSummaryPVE::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_Mission_MatchSummaryPVE_C_ExecuteUbergraph_WBP_Mission_MatchSummaryPVE, CallFunc_GetGameModeModID_ReturnValue) == 0x000140, "Member 'WBP_Mission_MatchSummaryPVE_C_ExecuteUbergraph_WBP_Mission_MatchSummaryPVE::CallFunc_GetGameModeModID_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Mission_MatchSummaryPVE_C_ExecuteUbergraph_WBP_Mission_MatchSummaryPVE, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000148, "Member 'WBP_Mission_MatchSummaryPVE_C_ExecuteUbergraph_WBP_Mission_MatchSummaryPVE::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Mission_MatchSummaryPVE_C_ExecuteUbergraph_WBP_Mission_MatchSummaryPVE, CallFunc_Conv_NameToText_ReturnValue) == 0x000150, "Member 'WBP_Mission_MatchSummaryPVE_C_ExecuteUbergraph_WBP_Mission_MatchSummaryPVE::CallFunc_Conv_NameToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Mission_MatchSummaryPVE_C_ExecuteUbergraph_WBP_Mission_MatchSummaryPVE, CallFunc_GetGameModeName_ReturnValue) == 0x000168, "Member 'WBP_Mission_MatchSummaryPVE_C_ExecuteUbergraph_WBP_Mission_MatchSummaryPVE::CallFunc_GetGameModeName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Mission_MatchSummaryPVE_C_ExecuteUbergraph_WBP_Mission_MatchSummaryPVE, K2Node_Select_Default) == 0x000170, "Member 'WBP_Mission_MatchSummaryPVE_C_ExecuteUbergraph_WBP_Mission_MatchSummaryPVE::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Mission_MatchSummaryPVE_C_ExecuteUbergraph_WBP_Mission_MatchSummaryPVE, CallFunc_Conv_NameToString_ReturnValue) == 0x000188, "Member 'WBP_Mission_MatchSummaryPVE_C_ExecuteUbergraph_WBP_Mission_MatchSummaryPVE::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Mission_MatchSummaryPVE_C_ExecuteUbergraph_WBP_Mission_MatchSummaryPVE, CallFunc_TextToUpper_ReturnValue) == 0x000198, "Member 'WBP_Mission_MatchSummaryPVE_C_ExecuteUbergraph_WBP_Mission_MatchSummaryPVE::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Mission_MatchSummaryPVE_C_ExecuteUbergraph_WBP_Mission_MatchSummaryPVE, CallFunc_GetLocalisedGameText_ReturnValue) == 0x0001B0, "Member 'WBP_Mission_MatchSummaryPVE_C_ExecuteUbergraph_WBP_Mission_MatchSummaryPVE::CallFunc_GetLocalisedGameText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Mission_MatchSummaryPVE_C_ExecuteUbergraph_WBP_Mission_MatchSummaryPVE, CallFunc_TextToUpper_ReturnValue_1) == 0x0001C8, "Member 'WBP_Mission_MatchSummaryPVE_C_ExecuteUbergraph_WBP_Mission_MatchSummaryPVE::CallFunc_TextToUpper_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Mission_MatchSummaryPVE_C_ExecuteUbergraph_WBP_Mission_MatchSummaryPVE, CallFunc_GetGameState_ReturnValue_2) == 0x0001E0, "Member 'WBP_Mission_MatchSummaryPVE_C_ExecuteUbergraph_WBP_Mission_MatchSummaryPVE::CallFunc_GetGameState_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Mission_MatchSummaryPVE_C_ExecuteUbergraph_WBP_Mission_MatchSummaryPVE, K2Node_DynamicCast_AsGBGame_State_2) == 0x0001E8, "Member 'WBP_Mission_MatchSummaryPVE_C_ExecuteUbergraph_WBP_Mission_MatchSummaryPVE::K2Node_DynamicCast_AsGBGame_State_2' has a wrong offset!");
static_assert(offsetof(WBP_Mission_MatchSummaryPVE_C_ExecuteUbergraph_WBP_Mission_MatchSummaryPVE, K2Node_DynamicCast_bSuccess_2) == 0x0001F0, "Member 'WBP_Mission_MatchSummaryPVE_C_ExecuteUbergraph_WBP_Mission_MatchSummaryPVE::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");

}

