#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CharacterEditorScreen

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "InputCore_structs.hpp"
#include "UMG_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function WBP_CharacterEditorScreen.WBP_CharacterEditorScreen_C.ExecuteUbergraph_WBP_CharacterEditorScreen
// 0x0210 (0x0210 - 0x0000)
struct WBP_CharacterEditorScreen_C_ExecuteUbergraph_WBP_CharacterEditorScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_DialogueBox_C*                     CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetUserLoadoutFileName_ReturnValue;       // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UVaRestJsonObject*                      CallFunc_LoadKitFile_OutKitJsonObj;                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LoadKitFile_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetUserLoadoutFileName_ReturnValue_1;     // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<struct FPrimaryAssetId>                CallFunc_GetKitPrimaryAssetIds_OutPrimaryAssetIds; // 0x0040(0x0010)(ReferenceParm)
	bool                                          CallFunc_GetKitPrimaryAssetIds_ReturnValue;        // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVaRestJsonObject*                      K2Node_ComponentBoundEvent_JsonObj;                // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_EncodeJson_ReturnValue;                   // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<struct FPrimaryAssetId>                CallFunc_GetKitPrimaryAssetIds_OutPrimaryAssetIds_1; // 0x0070(0x0010)(ReferenceParm)
	bool                                          CallFunc_GetKitPrimaryAssetIds_ReturnValue_1;      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SaveStringToFile_ReturnValue;             // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGBPlayerControllerBase*                K2Node_DynamicCast_AsGBPlayer_Controller_Base;     // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_FrontEndMenuManager_C*             CallFunc_GetFirstWidgetOfClass_ReturnValue;        // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDefaultLoadoutFileName_ReturnValue;    // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UVaRestJsonObject*                      CallFunc_LoadKitFile_OutKitJsonObj_1;              // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LoadKitFile_ReturnValue_1;                // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_DialogueBox_C*                     CallFunc_Create_ReturnValue_1;                     // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_GetRequiredInvItemTypeTags_ReturnValue;   // 0x00E0(0x0020)()
	class FString                                 CallFunc_GetUserLoadoutFileName_ReturnValue_2;     // 0x0100(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasRequiredInvItemTypeTags_ReturnValue;   // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_LeftChop_ReturnValue;                     // 0x0118(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0128(0x0018)()
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0148(0x0040)(HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetViewTarget_ReturnValue;                // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0190(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x01A0(0x0018)()
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_3;        // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_4;        // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGBPlayerControllerBase*                K2Node_DynamicCast_AsGBPlayer_Controller_Base_1;   // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D1[0x7];                                      // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGBPlayerControllerBase*                K2Node_DynamicCast_AsGBPlayer_Controller_Base_2;   // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E1[0x7];                                      // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_GetRequiredInvItemTypeTags_ReturnValue_1; // 0x01E8(0x0020)()
	bool                                          CallFunc_HasRequiredInvItemTypeTags_ReturnValue_1; // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_CharacterEditorScreen_C_ExecuteUbergraph_WBP_CharacterEditorScreen) == 0x000008, "Wrong alignment on WBP_CharacterEditorScreen_C_ExecuteUbergraph_WBP_CharacterEditorScreen");
static_assert(sizeof(WBP_CharacterEditorScreen_C_ExecuteUbergraph_WBP_CharacterEditorScreen) == 0x000210, "Wrong size on WBP_CharacterEditorScreen_C_ExecuteUbergraph_WBP_CharacterEditorScreen");
static_assert(offsetof(WBP_CharacterEditorScreen_C_ExecuteUbergraph_WBP_CharacterEditorScreen, EntryPoint) == 0x000000, "Member 'WBP_CharacterEditorScreen_C_ExecuteUbergraph_WBP_CharacterEditorScreen::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CharacterEditorScreen_C_ExecuteUbergraph_WBP_CharacterEditorScreen, CallFunc_Create_ReturnValue) == 0x000008, "Member 'WBP_CharacterEditorScreen_C_ExecuteUbergraph_WBP_CharacterEditorScreen::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterEditorScreen_C_ExecuteUbergraph_WBP_CharacterEditorScreen, CallFunc_GetUserLoadoutFileName_ReturnValue) == 0x000010, "Member 'WBP_CharacterEditorScreen_C_ExecuteUbergraph_WBP_CharacterEditorScreen::CallFunc_GetUserLoadoutFileName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterEditorScreen_C_ExecuteUbergraph_WBP_CharacterEditorScreen, CallFunc_LoadKitFile_OutKitJsonObj) == 0x000020, "Member 'WBP_CharacterEditorScreen_C_ExecuteUbergraph_WBP_CharacterEditorScreen::CallFunc_LoadKitFile_OutKitJsonObj' has a wrong offset!");
static_assert(offsetof(WBP_CharacterEditorScreen_C_ExecuteUbergraph_WBP_CharacterEditorScreen, CallFunc_LoadKitFile_ReturnValue) == 0x000028, "Member 'WBP_CharacterEditorScreen_C_ExecuteUbergraph_WBP_CharacterEditorScreen::CallFunc_LoadKitFile_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterEditorScreen_C_ExecuteUbergraph_WBP_CharacterEditorScreen, CallFunc_GetUserLoadoutFileName_ReturnValue_1) == 0x000030, "Member 'WBP_CharacterEditorScreen_C_ExecuteUbergraph_WBP_CharacterEditorScreen::CallFunc_GetUserLoadoutFileName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterEditorScreen_C_ExecuteUbergraph_WBP_CharacterEditorScreen, CallFunc_GetKitPrimaryAssetIds_OutPrimaryAssetIds) == 0x000040, "Member 'WBP_CharacterEditorScreen_C_ExecuteUbergraph_WBP_CharacterEditorScreen::CallFunc_GetKitPrimaryAssetIds_OutPrimaryAssetIds' has a wrong offset!");
static_assert(offsetof(WBP_CharacterEditorScreen_C_ExecuteUbergraph_WBP_CharacterEditorScreen, CallFunc_GetKitPrimaryAssetIds_ReturnValue) == 0x000050, "Member 'WBP_CharacterEditorScreen_C_ExecuteUbergraph_WBP_CharacterEditorScreen::CallFunc_GetKitPrimaryAssetIds_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterEditorScreen_C_ExecuteUbergraph_WBP_CharacterEditorScreen, K2Node_ComponentBoundEvent_JsonObj) == 0x000058, "Member 'WBP_CharacterEditorScreen_C_ExecuteUbergraph_WBP_CharacterEditorScreen::K2Node_ComponentBoundEvent_JsonObj' has a wrong offset!");
static_assert(offsetof(WBP_CharacterEditorScreen_C_ExecuteUbergraph_WBP_CharacterEditorScreen, CallFunc_EncodeJson_ReturnValue) == 0x000060, "Member 'WBP_CharacterEditorScreen_C_ExecuteUbergraph_WBP_CharacterEditorScreen::CallFunc_EncodeJson_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterEditorScreen_C_ExecuteUbergraph_WBP_CharacterEditorScreen, CallFunc_GetKitPrimaryAssetIds_OutPrimaryAssetIds_1) == 0x000070, "Member 'WBP_CharacterEditorScreen_C_ExecuteUbergraph_WBP_CharacterEditorScreen::CallFunc_GetKitPrimaryAssetIds_OutPrimaryAssetIds_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterEditorScreen_C_ExecuteUbergraph_WBP_CharacterEditorScreen, CallFunc_GetKitPrimaryAssetIds_ReturnValue_1) == 0x000080, "Member 'WBP_CharacterEditorScreen_C_ExecuteUbergraph_WBP_CharacterEditorScreen::CallFunc_GetKitPrimaryAssetIds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterEditorScreen_C_ExecuteUbergraph_WBP_CharacterEditorScreen, CallFunc_SaveStringToFile_ReturnValue) == 0x000081, "Member 'WBP_CharacterEditorScreen_C_ExecuteUbergraph_WBP_CharacterEditorScreen::CallFunc_SaveStringToFile_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterEditorScreen_C_ExecuteUbergraph_WBP_CharacterEditorScreen, CallFunc_GetPlayerController_ReturnValue) == 0x000088, "Member 'WBP_CharacterEditorScreen_C_ExecuteUbergraph_WBP_CharacterEditorScreen::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterEditorScreen_C_ExecuteUbergraph_WBP_CharacterEditorScreen, CallFunc_GetPlayerController_ReturnValue_1) == 0x000090, "Member 'WBP_CharacterEditorScreen_C_ExecuteUbergraph_WBP_CharacterEditorScreen::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterEditorScreen_C_ExecuteUbergraph_WBP_CharacterEditorScreen, K2Node_DynamicCast_AsGBPlayer_Controller_Base) == 0x000098, "Member 'WBP_CharacterEditorScreen_C_ExecuteUbergraph_WBP_CharacterEditorScreen::K2Node_DynamicCast_AsGBPlayer_Controller_Base' has a wrong offset!");
static_assert(offsetof(WBP_CharacterEditorScreen_C_ExecuteUbergraph_WBP_CharacterEditorScreen, K2Node_DynamicCast_bSuccess) == 0x0000A0, "Member 'WBP_CharacterEditorScreen_C_ExecuteUbergraph_WBP_CharacterEditorScreen::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CharacterEditorScreen_C_ExecuteUbergraph_WBP_CharacterEditorScreen, CallFunc_GetFirstWidgetOfClass_ReturnValue) == 0x0000A8, "Member 'WBP_CharacterEditorScreen_C_ExecuteUbergraph_WBP_CharacterEditorScreen::CallFunc_GetFirstWidgetOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterEditorScreen_C_ExecuteUbergraph_WBP_CharacterEditorScreen, CallFunc_IsValid_ReturnValue) == 0x0000B0, "Member 'WBP_CharacterEditorScreen_C_ExecuteUbergraph_WBP_CharacterEditorScreen::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterEditorScreen_C_ExecuteUbergraph_WBP_CharacterEditorScreen, CallFunc_GetDefaultLoadoutFileName_ReturnValue) == 0x0000B8, "Member 'WBP_CharacterEditorScreen_C_ExecuteUbergraph_WBP_CharacterEditorScreen::CallFunc_GetDefaultLoadoutFileName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterEditorScreen_C_ExecuteUbergraph_WBP_CharacterEditorScreen, CallFunc_LoadKitFile_OutKitJsonObj_1) == 0x0000C8, "Member 'WBP_CharacterEditorScreen_C_ExecuteUbergraph_WBP_CharacterEditorScreen::CallFunc_LoadKitFile_OutKitJsonObj_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterEditorScreen_C_ExecuteUbergraph_WBP_CharacterEditorScreen, CallFunc_LoadKitFile_ReturnValue_1) == 0x0000D0, "Member 'WBP_CharacterEditorScreen_C_ExecuteUbergraph_WBP_CharacterEditorScreen::CallFunc_LoadKitFile_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterEditorScreen_C_ExecuteUbergraph_WBP_CharacterEditorScreen, CallFunc_Create_ReturnValue_1) == 0x0000D8, "Member 'WBP_CharacterEditorScreen_C_ExecuteUbergraph_WBP_CharacterEditorScreen::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterEditorScreen_C_ExecuteUbergraph_WBP_CharacterEditorScreen, CallFunc_GetRequiredInvItemTypeTags_ReturnValue) == 0x0000E0, "Member 'WBP_CharacterEditorScreen_C_ExecuteUbergraph_WBP_CharacterEditorScreen::CallFunc_GetRequiredInvItemTypeTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterEditorScreen_C_ExecuteUbergraph_WBP_CharacterEditorScreen, CallFunc_GetUserLoadoutFileName_ReturnValue_2) == 0x000100, "Member 'WBP_CharacterEditorScreen_C_ExecuteUbergraph_WBP_CharacterEditorScreen::CallFunc_GetUserLoadoutFileName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CharacterEditorScreen_C_ExecuteUbergraph_WBP_CharacterEditorScreen, CallFunc_HasRequiredInvItemTypeTags_ReturnValue) == 0x000110, "Member 'WBP_CharacterEditorScreen_C_ExecuteUbergraph_WBP_CharacterEditorScreen::CallFunc_HasRequiredInvItemTypeTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterEditorScreen_C_ExecuteUbergraph_WBP_CharacterEditorScreen, CallFunc_LeftChop_ReturnValue) == 0x000118, "Member 'WBP_CharacterEditorScreen_C_ExecuteUbergraph_WBP_CharacterEditorScreen::CallFunc_LeftChop_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterEditorScreen_C_ExecuteUbergraph_WBP_CharacterEditorScreen, CallFunc_Conv_StringToText_ReturnValue) == 0x000128, "Member 'WBP_CharacterEditorScreen_C_ExecuteUbergraph_WBP_CharacterEditorScreen::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterEditorScreen_C_ExecuteUbergraph_WBP_CharacterEditorScreen, CallFunc_GetPlayerController_ReturnValue_2) == 0x000140, "Member 'WBP_CharacterEditorScreen_C_ExecuteUbergraph_WBP_CharacterEditorScreen::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CharacterEditorScreen_C_ExecuteUbergraph_WBP_CharacterEditorScreen, K2Node_MakeStruct_FormatArgumentData) == 0x000148, "Member 'WBP_CharacterEditorScreen_C_ExecuteUbergraph_WBP_CharacterEditorScreen::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_CharacterEditorScreen_C_ExecuteUbergraph_WBP_CharacterEditorScreen, CallFunc_GetViewTarget_ReturnValue) == 0x000188, "Member 'WBP_CharacterEditorScreen_C_ExecuteUbergraph_WBP_CharacterEditorScreen::CallFunc_GetViewTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterEditorScreen_C_ExecuteUbergraph_WBP_CharacterEditorScreen, K2Node_MakeArray_Array) == 0x000190, "Member 'WBP_CharacterEditorScreen_C_ExecuteUbergraph_WBP_CharacterEditorScreen::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_CharacterEditorScreen_C_ExecuteUbergraph_WBP_CharacterEditorScreen, CallFunc_Format_ReturnValue) == 0x0001A0, "Member 'WBP_CharacterEditorScreen_C_ExecuteUbergraph_WBP_CharacterEditorScreen::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterEditorScreen_C_ExecuteUbergraph_WBP_CharacterEditorScreen, CallFunc_GetPlayerController_ReturnValue_3) == 0x0001B8, "Member 'WBP_CharacterEditorScreen_C_ExecuteUbergraph_WBP_CharacterEditorScreen::CallFunc_GetPlayerController_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_CharacterEditorScreen_C_ExecuteUbergraph_WBP_CharacterEditorScreen, CallFunc_GetPlayerController_ReturnValue_4) == 0x0001C0, "Member 'WBP_CharacterEditorScreen_C_ExecuteUbergraph_WBP_CharacterEditorScreen::CallFunc_GetPlayerController_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_CharacterEditorScreen_C_ExecuteUbergraph_WBP_CharacterEditorScreen, K2Node_DynamicCast_AsGBPlayer_Controller_Base_1) == 0x0001C8, "Member 'WBP_CharacterEditorScreen_C_ExecuteUbergraph_WBP_CharacterEditorScreen::K2Node_DynamicCast_AsGBPlayer_Controller_Base_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterEditorScreen_C_ExecuteUbergraph_WBP_CharacterEditorScreen, K2Node_DynamicCast_bSuccess_1) == 0x0001D0, "Member 'WBP_CharacterEditorScreen_C_ExecuteUbergraph_WBP_CharacterEditorScreen::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterEditorScreen_C_ExecuteUbergraph_WBP_CharacterEditorScreen, K2Node_DynamicCast_AsGBPlayer_Controller_Base_2) == 0x0001D8, "Member 'WBP_CharacterEditorScreen_C_ExecuteUbergraph_WBP_CharacterEditorScreen::K2Node_DynamicCast_AsGBPlayer_Controller_Base_2' has a wrong offset!");
static_assert(offsetof(WBP_CharacterEditorScreen_C_ExecuteUbergraph_WBP_CharacterEditorScreen, K2Node_DynamicCast_bSuccess_2) == 0x0001E0, "Member 'WBP_CharacterEditorScreen_C_ExecuteUbergraph_WBP_CharacterEditorScreen::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_CharacterEditorScreen_C_ExecuteUbergraph_WBP_CharacterEditorScreen, CallFunc_GetRequiredInvItemTypeTags_ReturnValue_1) == 0x0001E8, "Member 'WBP_CharacterEditorScreen_C_ExecuteUbergraph_WBP_CharacterEditorScreen::CallFunc_GetRequiredInvItemTypeTags_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterEditorScreen_C_ExecuteUbergraph_WBP_CharacterEditorScreen, CallFunc_HasRequiredInvItemTypeTags_ReturnValue_1) == 0x000208, "Member 'WBP_CharacterEditorScreen_C_ExecuteUbergraph_WBP_CharacterEditorScreen::CallFunc_HasRequiredInvItemTypeTags_ReturnValue_1' has a wrong offset!");

// Function WBP_CharacterEditorScreen.WBP_CharacterEditorScreen_C.BndEvt__WBP_CharacterEditor_NEW_K2Node_ComponentBoundEvent_1_OkClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_CharacterEditorScreen_C_BndEvt__WBP_CharacterEditor_NEW_K2Node_ComponentBoundEvent_1_OkClicked__DelegateSignature final
{
public:
	class UVaRestJsonObject*                      JsonObj;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterEditorScreen_C_BndEvt__WBP_CharacterEditor_NEW_K2Node_ComponentBoundEvent_1_OkClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_CharacterEditorScreen_C_BndEvt__WBP_CharacterEditor_NEW_K2Node_ComponentBoundEvent_1_OkClicked__DelegateSignature");
static_assert(sizeof(WBP_CharacterEditorScreen_C_BndEvt__WBP_CharacterEditor_NEW_K2Node_ComponentBoundEvent_1_OkClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_CharacterEditorScreen_C_BndEvt__WBP_CharacterEditor_NEW_K2Node_ComponentBoundEvent_1_OkClicked__DelegateSignature");
static_assert(offsetof(WBP_CharacterEditorScreen_C_BndEvt__WBP_CharacterEditor_NEW_K2Node_ComponentBoundEvent_1_OkClicked__DelegateSignature, JsonObj) == 0x000000, "Member 'WBP_CharacterEditorScreen_C_BndEvt__WBP_CharacterEditor_NEW_K2Node_ComponentBoundEvent_1_OkClicked__DelegateSignature::JsonObj' has a wrong offset!");

// Function WBP_CharacterEditorScreen.WBP_CharacterEditorScreen_C.OnPreviewKeyDown
// 0x0378 (0x0378 - 0x0000)
struct WBP_CharacterEditorScreen_C_OnPreviewKeyDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FKeyEvent                              InKeyEvent;                                        // 0x0038(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FEventReply                            ReturnValue;                                       // 0x0070(0x00B8)(Parm, OutParm, ReturnParm)
	struct FKey                                   CallFunc_GetKey_ReturnValue;                       // 0x0128(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue;            // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0148(0x00B8)()
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0200(0x00B8)()
	struct FEventReply                            CallFunc_Unhandled_ReturnValue_1;                  // 0x02B8(0x00B8)()
	bool                                          CallFunc_HasKeyboardFocus_ReturnValue;             // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_CharacterEditorScreen_C_OnPreviewKeyDown) == 0x000008, "Wrong alignment on WBP_CharacterEditorScreen_C_OnPreviewKeyDown");
static_assert(sizeof(WBP_CharacterEditorScreen_C_OnPreviewKeyDown) == 0x000378, "Wrong size on WBP_CharacterEditorScreen_C_OnPreviewKeyDown");
static_assert(offsetof(WBP_CharacterEditorScreen_C_OnPreviewKeyDown, MyGeometry) == 0x000000, "Member 'WBP_CharacterEditorScreen_C_OnPreviewKeyDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_CharacterEditorScreen_C_OnPreviewKeyDown, InKeyEvent) == 0x000038, "Member 'WBP_CharacterEditorScreen_C_OnPreviewKeyDown::InKeyEvent' has a wrong offset!");
static_assert(offsetof(WBP_CharacterEditorScreen_C_OnPreviewKeyDown, ReturnValue) == 0x000070, "Member 'WBP_CharacterEditorScreen_C_OnPreviewKeyDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterEditorScreen_C_OnPreviewKeyDown, CallFunc_GetKey_ReturnValue) == 0x000128, "Member 'WBP_CharacterEditorScreen_C_OnPreviewKeyDown::CallFunc_GetKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterEditorScreen_C_OnPreviewKeyDown, CallFunc_EqualEqual_KeyKey_ReturnValue) == 0x000140, "Member 'WBP_CharacterEditorScreen_C_OnPreviewKeyDown::CallFunc_EqualEqual_KeyKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterEditorScreen_C_OnPreviewKeyDown, CallFunc_Unhandled_ReturnValue) == 0x000148, "Member 'WBP_CharacterEditorScreen_C_OnPreviewKeyDown::CallFunc_Unhandled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterEditorScreen_C_OnPreviewKeyDown, CallFunc_Handled_ReturnValue) == 0x000200, "Member 'WBP_CharacterEditorScreen_C_OnPreviewKeyDown::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterEditorScreen_C_OnPreviewKeyDown, CallFunc_Unhandled_ReturnValue_1) == 0x0002B8, "Member 'WBP_CharacterEditorScreen_C_OnPreviewKeyDown::CallFunc_Unhandled_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterEditorScreen_C_OnPreviewKeyDown, CallFunc_HasKeyboardFocus_ReturnValue) == 0x000370, "Member 'WBP_CharacterEditorScreen_C_OnPreviewKeyDown::CallFunc_HasKeyboardFocus_ReturnValue' has a wrong offset!");

}

