#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DeathOverlay

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_DeathOverlay.WBP_DeathOverlay_C
// 0x0020 (0x0280 - 0x0260)
class UWBP_DeathOverlay_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeOut;                                           // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWBP_DeathOptions_C*                    WBP_DeathOptions;                                  // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TeamKillOptions_C*                 WBP_TeamKillOptions;                               // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_DeathOverlay(int32 EntryPoint);
	void OnShowTransitionScreen_Event_0(class AGBPlayerController* PlayerController);
	void ShowTeamKillOptions();
	void EnableDeathOptions();
	void Close();
	void Construct();
	struct FEventReply OnKeyDown(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);
	struct FEventReply OnKeyUp(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);
	struct FEventReply OnMouseButtonDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	struct FEventReply OnMouseButtonUp(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_DeathOverlay_C">();
	}
	static class UWBP_DeathOverlay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_DeathOverlay_C>();
	}
};
static_assert(alignof(UWBP_DeathOverlay_C) == 0x000008, "Wrong alignment on UWBP_DeathOverlay_C");
static_assert(sizeof(UWBP_DeathOverlay_C) == 0x000280, "Wrong size on UWBP_DeathOverlay_C");
static_assert(offsetof(UWBP_DeathOverlay_C, UberGraphFrame) == 0x000260, "Member 'UWBP_DeathOverlay_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_DeathOverlay_C, FadeOut) == 0x000268, "Member 'UWBP_DeathOverlay_C::FadeOut' has a wrong offset!");
static_assert(offsetof(UWBP_DeathOverlay_C, WBP_DeathOptions) == 0x000270, "Member 'UWBP_DeathOverlay_C::WBP_DeathOptions' has a wrong offset!");
static_assert(offsetof(UWBP_DeathOverlay_C, WBP_TeamKillOptions) == 0x000278, "Member 'UWBP_DeathOverlay_C::WBP_TeamKillOptions' has a wrong offset!");

}

