#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CampaignMissionBriefingText

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CampaignMissionBriefingText.WBP_CampaignMissionBriefingText_C
// 0x0040 (0x02A0 - 0x0260)
class UWBP_CampaignMissionBriefingText_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             TextBlock_Briefing;                                // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FName                                   HotspotCodename;                                   // 0x0270(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         MissionSequenceNumber;                             // 0x0278(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_27C[0x4];                                      // 0x027C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   InvalidMissionText;                                // 0x0280(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FName                                   MissionDetailsTableId;                             // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void SetMissionDetails(class FName InHotspotCodename, int32 InSequenceNumber);
	void ExecuteUbergraph_WBP_CampaignMissionBriefingText(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CampaignMissionBriefingText_C">();
	}
	static class UWBP_CampaignMissionBriefingText_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CampaignMissionBriefingText_C>();
	}
};
static_assert(alignof(UWBP_CampaignMissionBriefingText_C) == 0x000008, "Wrong alignment on UWBP_CampaignMissionBriefingText_C");
static_assert(sizeof(UWBP_CampaignMissionBriefingText_C) == 0x0002A0, "Wrong size on UWBP_CampaignMissionBriefingText_C");
static_assert(offsetof(UWBP_CampaignMissionBriefingText_C, UberGraphFrame) == 0x000260, "Member 'UWBP_CampaignMissionBriefingText_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CampaignMissionBriefingText_C, TextBlock_Briefing) == 0x000268, "Member 'UWBP_CampaignMissionBriefingText_C::TextBlock_Briefing' has a wrong offset!");
static_assert(offsetof(UWBP_CampaignMissionBriefingText_C, HotspotCodename) == 0x000270, "Member 'UWBP_CampaignMissionBriefingText_C::HotspotCodename' has a wrong offset!");
static_assert(offsetof(UWBP_CampaignMissionBriefingText_C, MissionSequenceNumber) == 0x000278, "Member 'UWBP_CampaignMissionBriefingText_C::MissionSequenceNumber' has a wrong offset!");
static_assert(offsetof(UWBP_CampaignMissionBriefingText_C, InvalidMissionText) == 0x000280, "Member 'UWBP_CampaignMissionBriefingText_C::InvalidMissionText' has a wrong offset!");
static_assert(offsetof(UWBP_CampaignMissionBriefingText_C, MissionDetailsTableId) == 0x000298, "Member 'UWBP_CampaignMissionBriefingText_C::MissionDetailsTableId' has a wrong offset!");

}

