#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Campaign_MissionImageTab

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GroundBranch_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Campaign_MissionImageTab.WBP_Campaign_MissionImageTab_C
// 0x00B0 (0x0310 - 0x0260)
class UWBP_Campaign_MissionImageTab_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Border_TabIsActive;                                // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_ImageTabClicked;                            // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_TabText;                                 // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FGBMissionImage                        MissionImageData;                                  // 0x0280(0x0028)(Edit, BlueprintVisible, ExposeOnSpawn)
	TMulticastInlineDelegate<void(class UWBP_Campaign_MissionImageTab_C* TabWidget, int32 TabIndex)> OnTabClicked; // 0x02A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	int32                                         TabIndex;                                          // 0x02B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_2BC[0x4];                                      // 0x02BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            NonSelectedTextColour;                             // 0x02C0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            SelectedTextColour;                                // 0x02E8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_WBP_Campaign_MissionImageTab(int32 EntryPoint);
	void BndEvt__WBP_Campaign_MissionImageTab_Button_ImageTabClicked_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void SetSelected(bool bIsSelected);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Campaign_MissionImageTab_C">();
	}
	static class UWBP_Campaign_MissionImageTab_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Campaign_MissionImageTab_C>();
	}
};
static_assert(alignof(UWBP_Campaign_MissionImageTab_C) == 0x000008, "Wrong alignment on UWBP_Campaign_MissionImageTab_C");
static_assert(sizeof(UWBP_Campaign_MissionImageTab_C) == 0x000310, "Wrong size on UWBP_Campaign_MissionImageTab_C");
static_assert(offsetof(UWBP_Campaign_MissionImageTab_C, UberGraphFrame) == 0x000260, "Member 'UWBP_Campaign_MissionImageTab_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Campaign_MissionImageTab_C, Border_TabIsActive) == 0x000268, "Member 'UWBP_Campaign_MissionImageTab_C::Border_TabIsActive' has a wrong offset!");
static_assert(offsetof(UWBP_Campaign_MissionImageTab_C, Button_ImageTabClicked) == 0x000270, "Member 'UWBP_Campaign_MissionImageTab_C::Button_ImageTabClicked' has a wrong offset!");
static_assert(offsetof(UWBP_Campaign_MissionImageTab_C, TextBlock_TabText) == 0x000278, "Member 'UWBP_Campaign_MissionImageTab_C::TextBlock_TabText' has a wrong offset!");
static_assert(offsetof(UWBP_Campaign_MissionImageTab_C, MissionImageData) == 0x000280, "Member 'UWBP_Campaign_MissionImageTab_C::MissionImageData' has a wrong offset!");
static_assert(offsetof(UWBP_Campaign_MissionImageTab_C, OnTabClicked) == 0x0002A8, "Member 'UWBP_Campaign_MissionImageTab_C::OnTabClicked' has a wrong offset!");
static_assert(offsetof(UWBP_Campaign_MissionImageTab_C, TabIndex) == 0x0002B8, "Member 'UWBP_Campaign_MissionImageTab_C::TabIndex' has a wrong offset!");
static_assert(offsetof(UWBP_Campaign_MissionImageTab_C, NonSelectedTextColour) == 0x0002C0, "Member 'UWBP_Campaign_MissionImageTab_C::NonSelectedTextColour' has a wrong offset!");
static_assert(offsetof(UWBP_Campaign_MissionImageTab_C, SelectedTextColour) == 0x0002E8, "Member 'UWBP_Campaign_MissionImageTab_C::SelectedTextColour' has a wrong offset!");

}

