#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Mission_MatchSummaryPVP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ModKit_structs.hpp"
#include "UMG_structs.hpp"
#include "GroundBranch_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_Mission_MatchSummaryPVP.WBP_Mission_MatchSummaryPVP_C.GetTeamName
// 0x00A0 (0x00A0 - 0x0000)
struct WBP_Mission_MatchSummaryPVP_C_GetTeamName final
{
public:
	uint8                                         TeamId;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   TeamName;                                          // 0x0008(0x0018)(Parm, OutParm)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0028(0x0040)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0070(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0080(0x0018)()
	bool                                          CallFunc_Greater_ByteByte_ReturnValue;             // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_ByteByte_ReturnValue;                // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Mission_MatchSummaryPVP_C_GetTeamName) == 0x000008, "Wrong alignment on WBP_Mission_MatchSummaryPVP_C_GetTeamName");
static_assert(sizeof(WBP_Mission_MatchSummaryPVP_C_GetTeamName) == 0x0000A0, "Wrong size on WBP_Mission_MatchSummaryPVP_C_GetTeamName");
static_assert(offsetof(WBP_Mission_MatchSummaryPVP_C_GetTeamName, TeamId) == 0x000000, "Member 'WBP_Mission_MatchSummaryPVP_C_GetTeamName::TeamId' has a wrong offset!");
static_assert(offsetof(WBP_Mission_MatchSummaryPVP_C_GetTeamName, TeamName) == 0x000008, "Member 'WBP_Mission_MatchSummaryPVP_C_GetTeamName::TeamName' has a wrong offset!");
static_assert(offsetof(WBP_Mission_MatchSummaryPVP_C_GetTeamName, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000020, "Member 'WBP_Mission_MatchSummaryPVP_C_GetTeamName::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Mission_MatchSummaryPVP_C_GetTeamName, K2Node_MakeStruct_FormatArgumentData) == 0x000028, "Member 'WBP_Mission_MatchSummaryPVP_C_GetTeamName::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_Mission_MatchSummaryPVP_C_GetTeamName, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000068, "Member 'WBP_Mission_MatchSummaryPVP_C_GetTeamName::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Mission_MatchSummaryPVP_C_GetTeamName, K2Node_MakeArray_Array) == 0x000070, "Member 'WBP_Mission_MatchSummaryPVP_C_GetTeamName::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Mission_MatchSummaryPVP_C_GetTeamName, CallFunc_Format_ReturnValue) == 0x000080, "Member 'WBP_Mission_MatchSummaryPVP_C_GetTeamName::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Mission_MatchSummaryPVP_C_GetTeamName, CallFunc_Greater_ByteByte_ReturnValue) == 0x000098, "Member 'WBP_Mission_MatchSummaryPVP_C_GetTeamName::CallFunc_Greater_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Mission_MatchSummaryPVP_C_GetTeamName, CallFunc_Less_ByteByte_ReturnValue) == 0x000099, "Member 'WBP_Mission_MatchSummaryPVP_C_GetTeamName::CallFunc_Less_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Mission_MatchSummaryPVP_C_GetTeamName, CallFunc_BooleanOR_ReturnValue) == 0x00009A, "Member 'WBP_Mission_MatchSummaryPVP_C_GetTeamName::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function WBP_Mission_MatchSummaryPVP.WBP_Mission_MatchSummaryPVP_C.UpdateNormalMatchStats
// 0x0260 (0x0260 - 0x0000)
struct WBP_Mission_MatchSummaryPVP_C_UpdateNormalMatchStats final
{
public:
	class AGBGameState*                           InGameState;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0010(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0028(0x0018)()
	bool                                          Temp_bool_Variable_1;                              // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_2;                              // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0048(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0058(0x0018)()
	int32                                         CallFunc_GetRoundNumber_ReturnValue;               // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0078(0x0040)(HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Select_Default;                             // 0x00C0(0x0018)()
	int32                                         CallFunc_Abs_Int_ReturnValue;                      // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00E0(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0120(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0160(0x0010)(ReferenceParm)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0178(0x0018)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_1;                           // 0x0198(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x01B0(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x01F0(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x0208(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x0218(0x0018)()
	class FText                                   K2Node_Select_Default_2;                           // 0x0230(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0248(0x0018)()
};
static_assert(alignof(WBP_Mission_MatchSummaryPVP_C_UpdateNormalMatchStats) == 0x000008, "Wrong alignment on WBP_Mission_MatchSummaryPVP_C_UpdateNormalMatchStats");
static_assert(sizeof(WBP_Mission_MatchSummaryPVP_C_UpdateNormalMatchStats) == 0x000260, "Wrong size on WBP_Mission_MatchSummaryPVP_C_UpdateNormalMatchStats");
static_assert(offsetof(WBP_Mission_MatchSummaryPVP_C_UpdateNormalMatchStats, InGameState) == 0x000000, "Member 'WBP_Mission_MatchSummaryPVP_C_UpdateNormalMatchStats::InGameState' has a wrong offset!");
static_assert(offsetof(WBP_Mission_MatchSummaryPVP_C_UpdateNormalMatchStats, Temp_bool_Variable) == 0x000008, "Member 'WBP_Mission_MatchSummaryPVP_C_UpdateNormalMatchStats::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Mission_MatchSummaryPVP_C_UpdateNormalMatchStats, Temp_text_Variable) == 0x000010, "Member 'WBP_Mission_MatchSummaryPVP_C_UpdateNormalMatchStats::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Mission_MatchSummaryPVP_C_UpdateNormalMatchStats, Temp_text_Variable_1) == 0x000028, "Member 'WBP_Mission_MatchSummaryPVP_C_UpdateNormalMatchStats::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Mission_MatchSummaryPVP_C_UpdateNormalMatchStats, Temp_bool_Variable_1) == 0x000040, "Member 'WBP_Mission_MatchSummaryPVP_C_UpdateNormalMatchStats::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Mission_MatchSummaryPVP_C_UpdateNormalMatchStats, Temp_bool_Variable_2) == 0x000041, "Member 'WBP_Mission_MatchSummaryPVP_C_UpdateNormalMatchStats::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Mission_MatchSummaryPVP_C_UpdateNormalMatchStats, K2Node_MakeArray_Array) == 0x000048, "Member 'WBP_Mission_MatchSummaryPVP_C_UpdateNormalMatchStats::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Mission_MatchSummaryPVP_C_UpdateNormalMatchStats, CallFunc_Format_ReturnValue) == 0x000058, "Member 'WBP_Mission_MatchSummaryPVP_C_UpdateNormalMatchStats::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Mission_MatchSummaryPVP_C_UpdateNormalMatchStats, CallFunc_GetRoundNumber_ReturnValue) == 0x000070, "Member 'WBP_Mission_MatchSummaryPVP_C_UpdateNormalMatchStats::CallFunc_GetRoundNumber_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Mission_MatchSummaryPVP_C_UpdateNormalMatchStats, K2Node_MakeStruct_FormatArgumentData) == 0x000078, "Member 'WBP_Mission_MatchSummaryPVP_C_UpdateNormalMatchStats::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_Mission_MatchSummaryPVP_C_UpdateNormalMatchStats, CallFunc_NotEqual_IntInt_ReturnValue) == 0x0000B8, "Member 'WBP_Mission_MatchSummaryPVP_C_UpdateNormalMatchStats::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Mission_MatchSummaryPVP_C_UpdateNormalMatchStats, CallFunc_Subtract_IntInt_ReturnValue) == 0x0000BC, "Member 'WBP_Mission_MatchSummaryPVP_C_UpdateNormalMatchStats::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Mission_MatchSummaryPVP_C_UpdateNormalMatchStats, K2Node_Select_Default) == 0x0000C0, "Member 'WBP_Mission_MatchSummaryPVP_C_UpdateNormalMatchStats::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Mission_MatchSummaryPVP_C_UpdateNormalMatchStats, CallFunc_Abs_Int_ReturnValue) == 0x0000D8, "Member 'WBP_Mission_MatchSummaryPVP_C_UpdateNormalMatchStats::CallFunc_Abs_Int_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Mission_MatchSummaryPVP_C_UpdateNormalMatchStats, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000E0, "Member 'WBP_Mission_MatchSummaryPVP_C_UpdateNormalMatchStats::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_Mission_MatchSummaryPVP_C_UpdateNormalMatchStats, K2Node_MakeStruct_FormatArgumentData_2) == 0x000120, "Member 'WBP_Mission_MatchSummaryPVP_C_UpdateNormalMatchStats::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(WBP_Mission_MatchSummaryPVP_C_UpdateNormalMatchStats, K2Node_MakeArray_Array_1) == 0x000160, "Member 'WBP_Mission_MatchSummaryPVP_C_UpdateNormalMatchStats::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_Mission_MatchSummaryPVP_C_UpdateNormalMatchStats, CallFunc_Greater_IntInt_ReturnValue) == 0x000170, "Member 'WBP_Mission_MatchSummaryPVP_C_UpdateNormalMatchStats::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Mission_MatchSummaryPVP_C_UpdateNormalMatchStats, CallFunc_Format_ReturnValue_1) == 0x000178, "Member 'WBP_Mission_MatchSummaryPVP_C_UpdateNormalMatchStats::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Mission_MatchSummaryPVP_C_UpdateNormalMatchStats, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000190, "Member 'WBP_Mission_MatchSummaryPVP_C_UpdateNormalMatchStats::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Mission_MatchSummaryPVP_C_UpdateNormalMatchStats, K2Node_Select_Default_1) == 0x000198, "Member 'WBP_Mission_MatchSummaryPVP_C_UpdateNormalMatchStats::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_Mission_MatchSummaryPVP_C_UpdateNormalMatchStats, K2Node_MakeStruct_FormatArgumentData_3) == 0x0001B0, "Member 'WBP_Mission_MatchSummaryPVP_C_UpdateNormalMatchStats::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(WBP_Mission_MatchSummaryPVP_C_UpdateNormalMatchStats, CallFunc_Conv_IntToText_ReturnValue) == 0x0001F0, "Member 'WBP_Mission_MatchSummaryPVP_C_UpdateNormalMatchStats::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Mission_MatchSummaryPVP_C_UpdateNormalMatchStats, K2Node_MakeArray_Array_2) == 0x000208, "Member 'WBP_Mission_MatchSummaryPVP_C_UpdateNormalMatchStats::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(WBP_Mission_MatchSummaryPVP_C_UpdateNormalMatchStats, CallFunc_Format_ReturnValue_2) == 0x000218, "Member 'WBP_Mission_MatchSummaryPVP_C_UpdateNormalMatchStats::CallFunc_Format_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Mission_MatchSummaryPVP_C_UpdateNormalMatchStats, K2Node_Select_Default_2) == 0x000230, "Member 'WBP_Mission_MatchSummaryPVP_C_UpdateNormalMatchStats::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_Mission_MatchSummaryPVP_C_UpdateNormalMatchStats, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000248, "Member 'WBP_Mission_MatchSummaryPVP_C_UpdateNormalMatchStats::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");

// Function WBP_Mission_MatchSummaryPVP.WBP_Mission_MatchSummaryPVP_C.SetTeamRolesVisibility
// 0x00B8 (0x00B8 - 0x0000)
struct WBP_Mission_MatchSummaryPVP_C_SetTeamRolesVisibility final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGBGameState*                           K2Node_DynamicCast_AsGBGame_State;                 // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue_1;               // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGBGameState*                           K2Node_DynamicCast_AsGBGame_State_1;               // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGBTeamInfo                            CallFunc_GetPlayerTeamInfo_ReturnValue;            // 0x0044(0x0018)(NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x0060(0x0018)()
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGBTeamInfo                            CallFunc_GetPlayerTeamInfo_ReturnValue_1;          // 0x007C(0x0018)(NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0095(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_1;        // 0x0096(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_97[0x1];                                       // 0x0097(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_NameToText_ReturnValue_1;            // 0x0098(0x0018)()
	ESlateVisibility                              K2Node_Select_Default;                             // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue_1;                // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x00B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Mission_MatchSummaryPVP_C_SetTeamRolesVisibility) == 0x000008, "Wrong alignment on WBP_Mission_MatchSummaryPVP_C_SetTeamRolesVisibility");
static_assert(sizeof(WBP_Mission_MatchSummaryPVP_C_SetTeamRolesVisibility) == 0x0000B8, "Wrong size on WBP_Mission_MatchSummaryPVP_C_SetTeamRolesVisibility");
static_assert(offsetof(WBP_Mission_MatchSummaryPVP_C_SetTeamRolesVisibility, Temp_bool_Variable) == 0x000000, "Member 'WBP_Mission_MatchSummaryPVP_C_SetTeamRolesVisibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Mission_MatchSummaryPVP_C_SetTeamRolesVisibility, Temp_byte_Variable) == 0x000001, "Member 'WBP_Mission_MatchSummaryPVP_C_SetTeamRolesVisibility::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Mission_MatchSummaryPVP_C_SetTeamRolesVisibility, Temp_byte_Variable_1) == 0x000002, "Member 'WBP_Mission_MatchSummaryPVP_C_SetTeamRolesVisibility::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Mission_MatchSummaryPVP_C_SetTeamRolesVisibility, CallFunc_GetGameState_ReturnValue) == 0x000008, "Member 'WBP_Mission_MatchSummaryPVP_C_SetTeamRolesVisibility::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Mission_MatchSummaryPVP_C_SetTeamRolesVisibility, Temp_bool_Variable_1) == 0x000010, "Member 'WBP_Mission_MatchSummaryPVP_C_SetTeamRolesVisibility::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Mission_MatchSummaryPVP_C_SetTeamRolesVisibility, K2Node_DynamicCast_AsGBGame_State) == 0x000018, "Member 'WBP_Mission_MatchSummaryPVP_C_SetTeamRolesVisibility::K2Node_DynamicCast_AsGBGame_State' has a wrong offset!");
static_assert(offsetof(WBP_Mission_MatchSummaryPVP_C_SetTeamRolesVisibility, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WBP_Mission_MatchSummaryPVP_C_SetTeamRolesVisibility::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Mission_MatchSummaryPVP_C_SetTeamRolesVisibility, CallFunc_GetGameState_ReturnValue_1) == 0x000028, "Member 'WBP_Mission_MatchSummaryPVP_C_SetTeamRolesVisibility::CallFunc_GetGameState_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Mission_MatchSummaryPVP_C_SetTeamRolesVisibility, Temp_byte_Variable_2) == 0x000030, "Member 'WBP_Mission_MatchSummaryPVP_C_SetTeamRolesVisibility::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Mission_MatchSummaryPVP_C_SetTeamRolesVisibility, K2Node_DynamicCast_AsGBGame_State_1) == 0x000038, "Member 'WBP_Mission_MatchSummaryPVP_C_SetTeamRolesVisibility::K2Node_DynamicCast_AsGBGame_State_1' has a wrong offset!");
static_assert(offsetof(WBP_Mission_MatchSummaryPVP_C_SetTeamRolesVisibility, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'WBP_Mission_MatchSummaryPVP_C_SetTeamRolesVisibility::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_Mission_MatchSummaryPVP_C_SetTeamRolesVisibility, Temp_byte_Variable_3) == 0x000041, "Member 'WBP_Mission_MatchSummaryPVP_C_SetTeamRolesVisibility::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_Mission_MatchSummaryPVP_C_SetTeamRolesVisibility, CallFunc_GetPlayerTeamInfo_ReturnValue) == 0x000044, "Member 'WBP_Mission_MatchSummaryPVP_C_SetTeamRolesVisibility::CallFunc_GetPlayerTeamInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Mission_MatchSummaryPVP_C_SetTeamRolesVisibility, CallFunc_EqualEqual_NameName_ReturnValue) == 0x00005C, "Member 'WBP_Mission_MatchSummaryPVP_C_SetTeamRolesVisibility::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Mission_MatchSummaryPVP_C_SetTeamRolesVisibility, CallFunc_Conv_NameToText_ReturnValue) == 0x000060, "Member 'WBP_Mission_MatchSummaryPVP_C_SetTeamRolesVisibility::CallFunc_Conv_NameToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Mission_MatchSummaryPVP_C_SetTeamRolesVisibility, CallFunc_TextIsEmpty_ReturnValue) == 0x000078, "Member 'WBP_Mission_MatchSummaryPVP_C_SetTeamRolesVisibility::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Mission_MatchSummaryPVP_C_SetTeamRolesVisibility, CallFunc_GetPlayerTeamInfo_ReturnValue_1) == 0x00007C, "Member 'WBP_Mission_MatchSummaryPVP_C_SetTeamRolesVisibility::CallFunc_GetPlayerTeamInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Mission_MatchSummaryPVP_C_SetTeamRolesVisibility, CallFunc_BooleanOR_ReturnValue) == 0x000094, "Member 'WBP_Mission_MatchSummaryPVP_C_SetTeamRolesVisibility::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Mission_MatchSummaryPVP_C_SetTeamRolesVisibility, CallFunc_Not_PreBool_ReturnValue) == 0x000095, "Member 'WBP_Mission_MatchSummaryPVP_C_SetTeamRolesVisibility::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Mission_MatchSummaryPVP_C_SetTeamRolesVisibility, CallFunc_EqualEqual_NameName_ReturnValue_1) == 0x000096, "Member 'WBP_Mission_MatchSummaryPVP_C_SetTeamRolesVisibility::CallFunc_EqualEqual_NameName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Mission_MatchSummaryPVP_C_SetTeamRolesVisibility, CallFunc_Conv_NameToText_ReturnValue_1) == 0x000098, "Member 'WBP_Mission_MatchSummaryPVP_C_SetTeamRolesVisibility::CallFunc_Conv_NameToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Mission_MatchSummaryPVP_C_SetTeamRolesVisibility, K2Node_Select_Default) == 0x0000B0, "Member 'WBP_Mission_MatchSummaryPVP_C_SetTeamRolesVisibility::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Mission_MatchSummaryPVP_C_SetTeamRolesVisibility, CallFunc_TextIsEmpty_ReturnValue_1) == 0x0000B1, "Member 'WBP_Mission_MatchSummaryPVP_C_SetTeamRolesVisibility::CallFunc_TextIsEmpty_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Mission_MatchSummaryPVP_C_SetTeamRolesVisibility, CallFunc_BooleanOR_ReturnValue_1) == 0x0000B2, "Member 'WBP_Mission_MatchSummaryPVP_C_SetTeamRolesVisibility::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Mission_MatchSummaryPVP_C_SetTeamRolesVisibility, CallFunc_Not_PreBool_ReturnValue_1) == 0x0000B3, "Member 'WBP_Mission_MatchSummaryPVP_C_SetTeamRolesVisibility::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Mission_MatchSummaryPVP_C_SetTeamRolesVisibility, K2Node_Select_Default_1) == 0x0000B4, "Member 'WBP_Mission_MatchSummaryPVP_C_SetTeamRolesVisibility::K2Node_Select_Default_1' has a wrong offset!");

// Function WBP_Mission_MatchSummaryPVP.WBP_Mission_MatchSummaryPVP_C.OnMatchStatsUpdated
// 0x0008 (0x0008 - 0x0000)
struct WBP_Mission_MatchSummaryPVP_C_OnMatchStatsUpdated final
{
public:
	class AGBGameState*                           GameState;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Mission_MatchSummaryPVP_C_OnMatchStatsUpdated) == 0x000008, "Wrong alignment on WBP_Mission_MatchSummaryPVP_C_OnMatchStatsUpdated");
static_assert(sizeof(WBP_Mission_MatchSummaryPVP_C_OnMatchStatsUpdated) == 0x000008, "Wrong size on WBP_Mission_MatchSummaryPVP_C_OnMatchStatsUpdated");
static_assert(offsetof(WBP_Mission_MatchSummaryPVP_C_OnMatchStatsUpdated, GameState) == 0x000000, "Member 'WBP_Mission_MatchSummaryPVP_C_OnMatchStatsUpdated::GameState' has a wrong offset!");

// Function WBP_Mission_MatchSummaryPVP.WBP_Mission_MatchSummaryPVP_C.ExecuteUbergraph_WBP_Mission_MatchSummaryPVP
// 0x0578 (0x0578 - 0x0000)
struct WBP_Mission_MatchSummaryPVP_C_ExecuteUbergraph_WBP_Mission_MatchSummaryPVP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGBGameState*                           K2Node_DynamicCast_AsGBGame_State;                 // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FUInt64                                CallFunc_GetGameModeModID_ReturnValue;             // 0x0030(0x0008)(NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetGameModeName_ReturnValue;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGBPlayerState*                         K2Node_DynamicCast_AsGBPlayer_State;               // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetGenericTeamId_ReturnValue;             // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetLocalisedGameText_ReturnValue;         // 0x0068(0x0018)()
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x0088(0x0018)()
	class AGBPlayerState*                         K2Node_DynamicCast_AsGBPlayer_State_1;             // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_GetGenericTeamId_ReturnValue_1;           // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AA[0x6];                                       // 0x00AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue_1;               // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGBGameState*                           K2Node_DynamicCast_AsGBGame_State_1;               // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue_2;               // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGBGameState*                           K2Node_DynamicCast_AsGBGame_State_2;               // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGBGameState*                           K2Node_CustomEvent_GameState;                      // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCumulativeScoreForTeam_ReturnValue;    // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetRoundIsTemporaryGameMode_ReturnValue;  // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_ED[0x3];                                       // 0x00ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetWinningTeamForRound_ReturnValue;       // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F6[0x2];                                       // 0x00F6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetTeamName_TeamName;                     // 0x00F8(0x0018)()
	class FText                                   CallFunc_TextToUpper_ReturnValue_1;                // 0x0110(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0128(0x0040)(HasGetValueTypeHash)
	int32                                         CallFunc_GetCumulativeScoreForTeam_ReturnValue_1;  // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0170(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0180(0x0018)()
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGBTeamInfo                            CallFunc_GetPlayerTeamInfo_ReturnValue;            // 0x019C(0x0018)(NoDestructor)
	uint8                                         Pad_1B4[0x4];                                      // 0x01B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x01B8(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x01F8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x0208(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0220(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0238(0x0040)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_279[0x7];                                      // 0x0279(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x0280(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x0290(0x0018)()
	class FText                                   CallFunc_Conv_NameToText_ReturnValue_1;            // 0x02A8(0x0018)()
	class FText                                   CallFunc_TextToUpper_ReturnValue_2;                // 0x02C0(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x02D8(0x0018)(ConstParm)
	class FText                                   CallFunc_TextToUpper_ReturnValue_3;                // 0x02F0(0x0018)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_309[0x3];                                      // 0x0309(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AGBGameState* GameState)> K2Node_CreateDelegate_OutputDelegate;             // 0x030C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_31C[0x4];                                      // 0x031C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0320(0x0028)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_349[0x7];                                      // 0x0349(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue_3;               // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGBGameState*                           K2Node_DynamicCast_AsGBGame_State_3;               // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_361[0x3];                                      // 0x0361(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x0364(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_2;                              // 0x0369(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_36A[0x2];                                      // 0x036A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x036C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_3;             // 0x0370(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_374[0x4];                                      // 0x0374(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x0378(0x0040)(HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_1;         // 0x03B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B9[0x7];                                      // 0x03B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_3;                          // 0x03C0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_3;                     // 0x03D0(0x0018)()
	struct FLinearColor                           K2Node_Select_Default_1;                           // 0x03E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGBTeamInfo                            CallFunc_GetPlayerTeamInfo_ReturnValue_1;          // 0x03F8(0x0018)(NoDestructor)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0410(0x0028)()
	class FText                                   CallFunc_Conv_NameToText_ReturnValue_2;            // 0x0438(0x0018)()
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_1;        // 0x0450(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_451[0x7];                                      // 0x0451(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_4;            // 0x0458(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_NameToText_ReturnValue_3;            // 0x0498(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_4;                          // 0x04B0(0x0010)(ReferenceParm)
	bool                                          Temp_bool_Variable_3;                              // 0x04C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C1[0x7];                                      // 0x04C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue_4;                     // 0x04C8(0x0018)()
	class FText                                   CallFunc_TextToUpper_ReturnValue_4;                // 0x04E0(0x0018)()
	struct FLinearColor                           K2Node_Select_Default_2;                           // 0x04F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x0508(0x0028)()
	bool                                          Temp_bool_Variable_4;                              // 0x0530(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0531(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_532[0x6];                                      // 0x0532(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_3;                           // 0x0538(0x0018)(ConstParm)
	class FText                                   CallFunc_TextToUpper_ReturnValue_5;                // 0x0550(0x0018)()
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0568(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x0569(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x056A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_4;                           // 0x056B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x056C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_6;                              // 0x056D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x056E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_5;                           // 0x056F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_6;                           // 0x0570(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Mission_MatchSummaryPVP_C_ExecuteUbergraph_WBP_Mission_MatchSummaryPVP) == 0x000008, "Wrong alignment on WBP_Mission_MatchSummaryPVP_C_ExecuteUbergraph_WBP_Mission_MatchSummaryPVP");
static_assert(sizeof(WBP_Mission_MatchSummaryPVP_C_ExecuteUbergraph_WBP_Mission_MatchSummaryPVP) == 0x000578, "Wrong size on WBP_Mission_MatchSummaryPVP_C_ExecuteUbergraph_WBP_Mission_MatchSummaryPVP");
static_assert(offsetof(WBP_Mission_MatchSummaryPVP_C_ExecuteUbergraph_WBP_Mission_MatchSummaryPVP, EntryPoint) == 0x000000, "Member 'WBP_Mission_MatchSummaryPVP_C_ExecuteUbergraph_WBP_Mission_MatchSummaryPVP::EntryPoint' has a wrong offset!");
