#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PlatformCustomisation

#include "Basic.hpp"

#include "GroundBranch_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FGBModularPouchInfo_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_PlatformCustomisation.WBP_PlatformCustomisation_C.ExecuteUbergraph_WBP_PlatformCustomisation
// 0x00E0 (0x00E0 - 0x0000)
struct WBP_PlatformCustomisation_C_ExecuteUbergraph_WBP_PlatformCustomisation final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AGBPlatform*                            K2Node_DynamicCast_AsGBPlatform;                   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UGBInvItemDragDropPayload*>      CallFunc_GetPayloadsWithModularPouches_NewLocalVar_01; // 0x0030(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetTotalItemWeight_ReturnValue;           // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue;             // 0x0048(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0060(0x0040)(HasGetValueTypeHash)
	float                                         CallFunc_GetTotalItemWeight_ReturnValue_1;         // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00A8(0x0010)(ReferenceParm)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00C0(0x0018)()
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x00DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_2;         // 0x00DE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_PlatformCustomisation_C_ExecuteUbergraph_WBP_PlatformCustomisation) == 0x000008, "Wrong alignment on WBP_PlatformCustomisation_C_ExecuteUbergraph_WBP_PlatformCustomisation");
static_assert(sizeof(WBP_PlatformCustomisation_C_ExecuteUbergraph_WBP_PlatformCustomisation) == 0x0000E0, "Wrong size on WBP_PlatformCustomisation_C_ExecuteUbergraph_WBP_PlatformCustomisation");
static_assert(offsetof(WBP_PlatformCustomisation_C_ExecuteUbergraph_WBP_PlatformCustomisation, EntryPoint) == 0x000000, "Member 'WBP_PlatformCustomisation_C_ExecuteUbergraph_WBP_PlatformCustomisation::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_ExecuteUbergraph_WBP_PlatformCustomisation, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_PlatformCustomisation_C_ExecuteUbergraph_WBP_PlatformCustomisation::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_ExecuteUbergraph_WBP_PlatformCustomisation, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'WBP_PlatformCustomisation_C_ExecuteUbergraph_WBP_PlatformCustomisation::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_ExecuteUbergraph_WBP_PlatformCustomisation, K2Node_DynamicCast_AsGBPlatform) == 0x000020, "Member 'WBP_PlatformCustomisation_C_ExecuteUbergraph_WBP_PlatformCustomisation::K2Node_DynamicCast_AsGBPlatform' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_ExecuteUbergraph_WBP_PlatformCustomisation, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'WBP_PlatformCustomisation_C_ExecuteUbergraph_WBP_PlatformCustomisation::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_ExecuteUbergraph_WBP_PlatformCustomisation, CallFunc_GetPayloadsWithModularPouches_NewLocalVar_01) == 0x000030, "Member 'WBP_PlatformCustomisation_C_ExecuteUbergraph_WBP_PlatformCustomisation::CallFunc_GetPayloadsWithModularPouches_NewLocalVar_01' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_ExecuteUbergraph_WBP_PlatformCustomisation, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'WBP_PlatformCustomisation_C_ExecuteUbergraph_WBP_PlatformCustomisation::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_ExecuteUbergraph_WBP_PlatformCustomisation, CallFunc_GetTotalItemWeight_ReturnValue) == 0x000044, "Member 'WBP_PlatformCustomisation_C_ExecuteUbergraph_WBP_PlatformCustomisation::CallFunc_GetTotalItemWeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_ExecuteUbergraph_WBP_PlatformCustomisation, CallFunc_Conv_FloatToText_ReturnValue) == 0x000048, "Member 'WBP_PlatformCustomisation_C_ExecuteUbergraph_WBP_PlatformCustomisation::CallFunc_Conv_FloatToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_ExecuteUbergraph_WBP_PlatformCustomisation, K2Node_MakeStruct_FormatArgumentData) == 0x000060, "Member 'WBP_PlatformCustomisation_C_ExecuteUbergraph_WBP_PlatformCustomisation::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_ExecuteUbergraph_WBP_PlatformCustomisation, CallFunc_GetTotalItemWeight_ReturnValue_1) == 0x0000A0, "Member 'WBP_PlatformCustomisation_C_ExecuteUbergraph_WBP_PlatformCustomisation::CallFunc_GetTotalItemWeight_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_ExecuteUbergraph_WBP_PlatformCustomisation, K2Node_MakeArray_Array) == 0x0000A8, "Member 'WBP_PlatformCustomisation_C_ExecuteUbergraph_WBP_PlatformCustomisation::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_ExecuteUbergraph_WBP_PlatformCustomisation, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0000B8, "Member 'WBP_PlatformCustomisation_C_ExecuteUbergraph_WBP_PlatformCustomisation::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_ExecuteUbergraph_WBP_PlatformCustomisation, CallFunc_Format_ReturnValue) == 0x0000C0, "Member 'WBP_PlatformCustomisation_C_ExecuteUbergraph_WBP_PlatformCustomisation::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_ExecuteUbergraph_WBP_PlatformCustomisation, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0000D8, "Member 'WBP_PlatformCustomisation_C_ExecuteUbergraph_WBP_PlatformCustomisation::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_ExecuteUbergraph_WBP_PlatformCustomisation, CallFunc_Greater_FloatFloat_ReturnValue) == 0x0000DC, "Member 'WBP_PlatformCustomisation_C_ExecuteUbergraph_WBP_PlatformCustomisation::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_ExecuteUbergraph_WBP_PlatformCustomisation, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x0000DD, "Member 'WBP_PlatformCustomisation_C_ExecuteUbergraph_WBP_PlatformCustomisation::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_ExecuteUbergraph_WBP_PlatformCustomisation, CallFunc_Greater_FloatFloat_ReturnValue_2) == 0x0000DE, "Member 'WBP_PlatformCustomisation_C_ExecuteUbergraph_WBP_PlatformCustomisation::CallFunc_Greater_FloatFloat_ReturnValue_2' has a wrong offset!");

// Function WBP_PlatformCustomisation.WBP_PlatformCustomisation_C.GeneratePouchIds
// 0x00F8 (0x00F8 - 0x0000)
struct WBP_PlatformCustomisation_C_GeneratePouchIds final
{
public:
	TArray<struct FGameplayTag>                   LocalInvItemSocketTags;                            // 0x0000(0x0010)(Edit, BlueprintVisible)
	struct FGameplayTag                           CurrentInvItemSocketTag;                           // 0x0010(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGameplayTagValid_ReturnValue;           // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(NoDestructor, HasGetValueTypeHash)
	TArray<struct FGameplayTag>                   K2Node_MakeArray_Array;                            // 0x0040(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MakeGameplayTagContainerFromArray_ReturnValue; // 0x0058(0x0020)()
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           K2Node_MakeArray_Array_1;                          // 0x0080(0x0010)(ConstParm, ReferenceParm)
	TArray<struct FPrimaryAssetId>                CallFunc_GetInvItemAssetIds_OutItemAssetIds;       // 0x0090(0x0010)(ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPrimaryAssetId                        CallFunc_Array_Get_Item_1;                         // 0x00A4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidInvItemAssetId_bOutResult;         // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00BB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C5[0x3];                                       // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetMatchingSocketNames_OutSocketNames;    // 0x00C8(0x0010)(ReferenceParm)
	bool                                          CallFunc_GetMatchingSocketNames_ReturnValue;       // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item_2;                         // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x3];                                       // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_GameplayTag_FromSocketName_ReturnValue;   // 0x00EC(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlatformCustomisation_C_GeneratePouchIds) == 0x000008, "Wrong alignment on WBP_PlatformCustomisation_C_GeneratePouchIds");
static_assert(sizeof(WBP_PlatformCustomisation_C_GeneratePouchIds) == 0x0000F8, "Wrong size on WBP_PlatformCustomisation_C_GeneratePouchIds");
static_assert(offsetof(WBP_PlatformCustomisation_C_GeneratePouchIds, LocalInvItemSocketTags) == 0x000000, "Member 'WBP_PlatformCustomisation_C_GeneratePouchIds::LocalInvItemSocketTags' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_GeneratePouchIds, CurrentInvItemSocketTag) == 0x000010, "Member 'WBP_PlatformCustomisation_C_GeneratePouchIds::CurrentInvItemSocketTag' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_GeneratePouchIds, Temp_int_Array_Index_Variable) == 0x000018, "Member 'WBP_PlatformCustomisation_C_GeneratePouchIds::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_GeneratePouchIds, Temp_int_Array_Index_Variable_1) == 0x00001C, "Member 'WBP_PlatformCustomisation_C_GeneratePouchIds::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_GeneratePouchIds, Temp_int_Loop_Counter_Variable) == 0x000020, "Member 'WBP_PlatformCustomisation_C_GeneratePouchIds::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_GeneratePouchIds, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'WBP_PlatformCustomisation_C_GeneratePouchIds::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_GeneratePouchIds, Temp_int_Array_Index_Variable_2) == 0x000028, "Member 'WBP_PlatformCustomisation_C_GeneratePouchIds::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_GeneratePouchIds, Temp_int_Loop_Counter_Variable_1) == 0x00002C, "Member 'WBP_PlatformCustomisation_C_GeneratePouchIds::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_GeneratePouchIds, CallFunc_Add_IntInt_ReturnValue_1) == 0x000030, "Member 'WBP_PlatformCustomisation_C_GeneratePouchIds::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_GeneratePouchIds, CallFunc_IsGameplayTagValid_ReturnValue) == 0x000034, "Member 'WBP_PlatformCustomisation_C_GeneratePouchIds::CallFunc_IsGameplayTagValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_GeneratePouchIds, CallFunc_Array_Get_Item) == 0x000038, "Member 'WBP_PlatformCustomisation_C_GeneratePouchIds::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_GeneratePouchIds, K2Node_MakeArray_Array) == 0x000040, "Member 'WBP_PlatformCustomisation_C_GeneratePouchIds::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_GeneratePouchIds, CallFunc_Array_Length_ReturnValue) == 0x000050, "Member 'WBP_PlatformCustomisation_C_GeneratePouchIds::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_GeneratePouchIds, CallFunc_MakeGameplayTagContainerFromArray_ReturnValue) == 0x000058, "Member 'WBP_PlatformCustomisation_C_GeneratePouchIds::CallFunc_MakeGameplayTagContainerFromArray_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_GeneratePouchIds, CallFunc_Array_AddUnique_ReturnValue) == 0x000078, "Member 'WBP_PlatformCustomisation_C_GeneratePouchIds::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_GeneratePouchIds, K2Node_MakeArray_Array_1) == 0x000080, "Member 'WBP_PlatformCustomisation_C_GeneratePouchIds::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_GeneratePouchIds, CallFunc_GetInvItemAssetIds_OutItemAssetIds) == 0x000090, "Member 'WBP_PlatformCustomisation_C_GeneratePouchIds::CallFunc_GetInvItemAssetIds_OutItemAssetIds' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_GeneratePouchIds, Temp_int_Loop_Counter_Variable_2) == 0x0000A0, "Member 'WBP_PlatformCustomisation_C_GeneratePouchIds::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_GeneratePouchIds, CallFunc_Array_Get_Item_1) == 0x0000A4, "Member 'WBP_PlatformCustomisation_C_GeneratePouchIds::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_GeneratePouchIds, CallFunc_Array_Add_ReturnValue) == 0x0000B4, "Member 'WBP_PlatformCustomisation_C_GeneratePouchIds::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_GeneratePouchIds, CallFunc_IsValidInvItemAssetId_bOutResult) == 0x0000B8, "Member 'WBP_PlatformCustomisation_C_GeneratePouchIds::CallFunc_IsValidInvItemAssetId_bOutResult' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_GeneratePouchIds, CallFunc_Array_Contains_ReturnValue) == 0x0000B9, "Member 'WBP_PlatformCustomisation_C_GeneratePouchIds::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_GeneratePouchIds, CallFunc_Not_PreBool_ReturnValue) == 0x0000BA, "Member 'WBP_PlatformCustomisation_C_GeneratePouchIds::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_GeneratePouchIds, CallFunc_Less_IntInt_ReturnValue) == 0x0000BB, "Member 'WBP_PlatformCustomisation_C_GeneratePouchIds::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_GeneratePouchIds, CallFunc_Add_IntInt_ReturnValue_2) == 0x0000BC, "Member 'WBP_PlatformCustomisation_C_GeneratePouchIds::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_GeneratePouchIds, CallFunc_Array_Length_ReturnValue_1) == 0x0000C0, "Member 'WBP_PlatformCustomisation_C_GeneratePouchIds::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_GeneratePouchIds, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000C4, "Member 'WBP_PlatformCustomisation_C_GeneratePouchIds::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_GeneratePouchIds, CallFunc_GetMatchingSocketNames_OutSocketNames) == 0x0000C8, "Member 'WBP_PlatformCustomisation_C_GeneratePouchIds::CallFunc_GetMatchingSocketNames_OutSocketNames' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_GeneratePouchIds, CallFunc_GetMatchingSocketNames_ReturnValue) == 0x0000D8, "Member 'WBP_PlatformCustomisation_C_GeneratePouchIds::CallFunc_GetMatchingSocketNames_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_GeneratePouchIds, CallFunc_Array_Length_ReturnValue_2) == 0x0000DC, "Member 'WBP_PlatformCustomisation_C_GeneratePouchIds::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_GeneratePouchIds, CallFunc_Array_Get_Item_2) == 0x0000E0, "Member 'WBP_PlatformCustomisation_C_GeneratePouchIds::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_GeneratePouchIds, CallFunc_Less_IntInt_ReturnValue_2) == 0x0000E8, "Member 'WBP_PlatformCustomisation_C_GeneratePouchIds::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_GeneratePouchIds, CallFunc_GameplayTag_FromSocketName_ReturnValue) == 0x0000EC, "Member 'WBP_PlatformCustomisation_C_GeneratePouchIds::CallFunc_GameplayTag_FromSocketName_ReturnValue' has a wrong offset!");

// Function WBP_PlatformCustomisation.WBP_PlatformCustomisation_C.CreateAmmoPouchPayload
// 0x0130 (0x0130 - 0x0000)
struct WBP_PlatformCustomisation_C_CreateAmmoPouchPayload final
{
public:
	struct FPrimaryAssetId                        InPouchAssetId;                                    // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPrimaryAssetId                        InAmmoAssetId;                                     // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EGBAmmoPouchModularity                        InModularity;                                      // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   InDisplayName;                                     // 0x0028(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	TSoftObjectPtr<class UObject>                 InIcon;                                            // 0x0040(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, UObjectWrapper, HasGetValueTypeHash)
	struct FGameplayTagContainer                  InInvItemTags;                                     // 0x0068(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UGBAmmoPouchDragDropPayload*            OutPayload;                                        // 0x0088(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPrimaryAssetId                        LocalFillWithSkinAssetId;                          // 0x0090(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   Temp_softclass_Variable;                           // 0x00A0(0x0028)(ConstParm, UObjectWrapper, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_GetInvItemSkinTypeTag_ReturnValue;        // 0x00C8(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FPrimaryAssetId                        CallFunc_GetSimilarInvItemSkinId_ReturnValue;      // 0x00D0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_GameplayTagContainer_Filter_OutFilteredContainer; // 0x00E0(0x0020)()
	bool                                          CallFunc_GameplayTagContainer_Filter_ReturnValue;  // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGameplayTag>                   CallFunc_BreakGameplayTagContainer_GameplayTags;   // 0x0108(0x0010)(ReferenceParm)
	struct FPrimaryAssetId                        CallFunc_GetSimilarInvItemSkinId_ReturnValue_1;    // 0x0118(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGBAmmoPouchDragDropPayload*            CallFunc_SpawnObject_ReturnValue;                  // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlatformCustomisation_C_CreateAmmoPouchPayload) == 0x000008, "Wrong alignment on WBP_PlatformCustomisation_C_CreateAmmoPouchPayload");
static_assert(sizeof(WBP_PlatformCustomisation_C_CreateAmmoPouchPayload) == 0x000130, "Wrong size on WBP_PlatformCustomisation_C_CreateAmmoPouchPayload");
static_assert(offsetof(WBP_PlatformCustomisation_C_CreateAmmoPouchPayload, InPouchAssetId) == 0x000000, "Member 'WBP_PlatformCustomisation_C_CreateAmmoPouchPayload::InPouchAssetId' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_CreateAmmoPouchPayload, InAmmoAssetId) == 0x000010, "Member 'WBP_PlatformCustomisation_C_CreateAmmoPouchPayload::InAmmoAssetId' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_CreateAmmoPouchPayload, InModularity) == 0x000020, "Member 'WBP_PlatformCustomisation_C_CreateAmmoPouchPayload::InModularity' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_CreateAmmoPouchPayload, InDisplayName) == 0x000028, "Member 'WBP_PlatformCustomisation_C_CreateAmmoPouchPayload::InDisplayName' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_CreateAmmoPouchPayload, InIcon) == 0x000040, "Member 'WBP_PlatformCustomisation_C_CreateAmmoPouchPayload::InIcon' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_CreateAmmoPouchPayload, InInvItemTags) == 0x000068, "Member 'WBP_PlatformCustomisation_C_CreateAmmoPouchPayload::InInvItemTags' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_CreateAmmoPouchPayload, OutPayload) == 0x000088, "Member 'WBP_PlatformCustomisation_C_CreateAmmoPouchPayload::OutPayload' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_CreateAmmoPouchPayload, LocalFillWithSkinAssetId) == 0x000090, "Member 'WBP_PlatformCustomisation_C_CreateAmmoPouchPayload::LocalFillWithSkinAssetId' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_CreateAmmoPouchPayload, Temp_softclass_Variable) == 0x0000A0, "Member 'WBP_PlatformCustomisation_C_CreateAmmoPouchPayload::Temp_softclass_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_CreateAmmoPouchPayload, CallFunc_GetInvItemSkinTypeTag_ReturnValue) == 0x0000C8, "Member 'WBP_PlatformCustomisation_C_CreateAmmoPouchPayload::CallFunc_GetInvItemSkinTypeTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_CreateAmmoPouchPayload, CallFunc_GetSimilarInvItemSkinId_ReturnValue) == 0x0000D0, "Member 'WBP_PlatformCustomisation_C_CreateAmmoPouchPayload::CallFunc_GetSimilarInvItemSkinId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_CreateAmmoPouchPayload, CallFunc_GameplayTagContainer_Filter_OutFilteredContainer) == 0x0000E0, "Member 'WBP_PlatformCustomisation_C_CreateAmmoPouchPayload::CallFunc_GameplayTagContainer_Filter_OutFilteredContainer' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_CreateAmmoPouchPayload, CallFunc_GameplayTagContainer_Filter_ReturnValue) == 0x000100, "Member 'WBP_PlatformCustomisation_C_CreateAmmoPouchPayload::CallFunc_GameplayTagContainer_Filter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_CreateAmmoPouchPayload, CallFunc_BreakGameplayTagContainer_GameplayTags) == 0x000108, "Member 'WBP_PlatformCustomisation_C_CreateAmmoPouchPayload::CallFunc_BreakGameplayTagContainer_GameplayTags' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_CreateAmmoPouchPayload, CallFunc_GetSimilarInvItemSkinId_ReturnValue_1) == 0x000118, "Member 'WBP_PlatformCustomisation_C_CreateAmmoPouchPayload::CallFunc_GetSimilarInvItemSkinId_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_CreateAmmoPouchPayload, CallFunc_SpawnObject_ReturnValue) == 0x000128, "Member 'WBP_PlatformCustomisation_C_CreateAmmoPouchPayload::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");

// Function WBP_PlatformCustomisation.WBP_PlatformCustomisation_C.CreatePouchPayload
// 0x0128 (0x0128 - 0x0000)
struct WBP_PlatformCustomisation_C_CreatePouchPayload final
{
public:
	struct FPrimaryAssetId                        InPouchAssetId;                                    // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPrimaryAssetId                        InFillWithId;                                      // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   InDisplayName;                                     // 0x0020(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	TSoftObjectPtr<class UObject>                 InIcon;                                            // 0x0038(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, UObjectWrapper, HasGetValueTypeHash)
	struct FGameplayTagContainer                  InInvItemTags;                                     // 0x0060(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UGBPouchDragDropPayload*                OutPayload;                                        // 0x0080(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPrimaryAssetId                        LocalFillWithSkinId;                               // 0x0088(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   Temp_softclass_Variable;                           // 0x0098(0x0028)(ConstParm, UObjectWrapper, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_GetInvItemSkinTypeTag_ReturnValue;        // 0x00C0(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_GameplayTagContainer_Filter_OutFilteredContainer; // 0x00C8(0x0020)()
	bool                                          CallFunc_GameplayTagContainer_Filter_ReturnValue;  // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x3];                                       // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPrimaryAssetId                        CallFunc_GetSimilarInvItemSkinId_ReturnValue;      // 0x00EC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGameplayTag>                   CallFunc_BreakGameplayTagContainer_GameplayTags;   // 0x0100(0x0010)(ReferenceParm)
	struct FPrimaryAssetId                        CallFunc_GetSimilarInvItemSkinId_ReturnValue_1;    // 0x0110(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGBPouchDragDropPayload*                CallFunc_SpawnObject_ReturnValue;                  // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlatformCustomisation_C_CreatePouchPayload) == 0x000008, "Wrong alignment on WBP_PlatformCustomisation_C_CreatePouchPayload");
static_assert(sizeof(WBP_PlatformCustomisation_C_CreatePouchPayload) == 0x000128, "Wrong size on WBP_PlatformCustomisation_C_CreatePouchPayload");
static_assert(offsetof(WBP_PlatformCustomisation_C_CreatePouchPayload, InPouchAssetId) == 0x000000, "Member 'WBP_PlatformCustomisation_C_CreatePouchPayload::InPouchAssetId' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_CreatePouchPayload, InFillWithId) == 0x000010, "Member 'WBP_PlatformCustomisation_C_CreatePouchPayload::InFillWithId' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_CreatePouchPayload, InDisplayName) == 0x000020, "Member 'WBP_PlatformCustomisation_C_CreatePouchPayload::InDisplayName' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_CreatePouchPayload, InIcon) == 0x000038, "Member 'WBP_PlatformCustomisation_C_CreatePouchPayload::InIcon' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_CreatePouchPayload, InInvItemTags) == 0x000060, "Member 'WBP_PlatformCustomisation_C_CreatePouchPayload::InInvItemTags' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_CreatePouchPayload, OutPayload) == 0x000080, "Member 'WBP_PlatformCustomisation_C_CreatePouchPayload::OutPayload' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_CreatePouchPayload, LocalFillWithSkinId) == 0x000088, "Member 'WBP_PlatformCustomisation_C_CreatePouchPayload::LocalFillWithSkinId' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_CreatePouchPayload, Temp_softclass_Variable) == 0x000098, "Member 'WBP_PlatformCustomisation_C_CreatePouchPayload::Temp_softclass_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_CreatePouchPayload, CallFunc_GetInvItemSkinTypeTag_ReturnValue) == 0x0000C0, "Member 'WBP_PlatformCustomisation_C_CreatePouchPayload::CallFunc_GetInvItemSkinTypeTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_CreatePouchPayload, CallFunc_GameplayTagContainer_Filter_OutFilteredContainer) == 0x0000C8, "Member 'WBP_PlatformCustomisation_C_CreatePouchPayload::CallFunc_GameplayTagContainer_Filter_OutFilteredContainer' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_CreatePouchPayload, CallFunc_GameplayTagContainer_Filter_ReturnValue) == 0x0000E8, "Member 'WBP_PlatformCustomisation_C_CreatePouchPayload::CallFunc_GameplayTagContainer_Filter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_CreatePouchPayload, CallFunc_GetSimilarInvItemSkinId_ReturnValue) == 0x0000EC, "Member 'WBP_PlatformCustomisation_C_CreatePouchPayload::CallFunc_GetSimilarInvItemSkinId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_CreatePouchPayload, CallFunc_BreakGameplayTagContainer_GameplayTags) == 0x000100, "Member 'WBP_PlatformCustomisation_C_CreatePouchPayload::CallFunc_BreakGameplayTagContainer_GameplayTags' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_CreatePouchPayload, CallFunc_GetSimilarInvItemSkinId_ReturnValue_1) == 0x000110, "Member 'WBP_PlatformCustomisation_C_CreatePouchPayload::CallFunc_GetSimilarInvItemSkinId_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_CreatePouchPayload, CallFunc_SpawnObject_ReturnValue) == 0x000120, "Member 'WBP_PlatformCustomisation_C_CreatePouchPayload::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");

// Function WBP_PlatformCustomisation.WBP_PlatformCustomisation_C.AddSpecificAmmPouches
// 0x0290 (0x0290 - 0x0000)
struct WBP_PlatformCustomisation_C_AddSpecificAmmPouches final
{
public:
	struct FGameplayTagContainer                  CurrentPouchInvItemTags;                           // 0x0000(0x0020)(Edit, BlueprintVisible)
	struct FPrimaryAssetId                        CurrentPouchId;                                    // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  LocalAmmoPouchTypeTags;                            // 0x0030(0x0020)(Edit, BlueprintVisible)
	struct FGameplayTagContainer                  LocalInvItemTags;                                  // 0x0050(0x0020)(Edit, BlueprintVisible)
	struct FPrimaryAssetId                        CurrentAmmoId;                                     // 0x0070(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FPrimaryAssetId>                AmmoAssetIds;                                      // 0x0080(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidInvItemAssetId_bOutResult;         // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPrimaryAssetId>                CallFunc_GetInvItemAssetIds_OutItemAssetIds;       // 0x00A8(0x0010)(ReferenceParm)
	int32                                         CallFunc_GetFillCount_OutFillCount;                // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00C0(0x0040)(HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyTags_ReturnValue;                   // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UObject>                 CallFunc_GetARSSoftObjectPtrFromPrimaryAsset_OutSoftObjectPtr; // 0x0108(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_GetARSSoftObjectPtrFromPrimaryAsset_ReturnValue; // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetARSTextFromPrimaryAsset_OutText;       // 0x0138(0x0018)()
	bool                                          CallFunc_GetARSTextFromPrimaryAsset_ReturnValue;   // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0158(0x0040)(HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_GetInvItemTags_ReturnValue;               // 0x0198(0x0020)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x01B8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x01C8(0x0018)()
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E4[0x4];                                      // 0x01E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGBAmmoPouchDragDropPayload*            CallFunc_CreateAmmoPouchPayload_OutPayload;        // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPrimaryAssetId                        CallFunc_Array_Get_Item;                           // 0x01F8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x020C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_20D[0x3];                                      // 0x020D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_GameplayTagContainer_Filter_OutFilteredContainer; // 0x0210(0x0020)()
	bool                                          CallFunc_GameplayTagContainer_Filter_ReturnValue;  // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_231[0x7];                                      // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_GetInvItemTags_ReturnValue_1;             // 0x0238(0x0020)()
	TArray<struct FPrimaryAssetId>                CallFunc_GetInvItemAssetIds_OutItemAssetIds_1;     // 0x0258(0x0010)(ReferenceParm)
	TArray<struct FPrimaryAssetId>                CallFunc_SortPrimaryAssetIdList_OutPrimaryAssetIdList; // 0x0268(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPrimaryAssetId                        CallFunc_Array_Get_Item_1;                         // 0x027C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x028C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_PlatformCustomisation_C_AddSpecificAmmPouches) == 0x000008, "Wrong alignment on WBP_PlatformCustomisation_C_AddSpecificAmmPouches");
static_assert(sizeof(WBP_PlatformCustomisation_C_AddSpecificAmmPouches) == 0x000290, "Wrong size on WBP_PlatformCustomisation_C_AddSpecificAmmPouches");
static_assert(offsetof(WBP_PlatformCustomisation_C_AddSpecificAmmPouches, CurrentPouchInvItemTags) == 0x000000, "Member 'WBP_PlatformCustomisation_C_AddSpecificAmmPouches::CurrentPouchInvItemTags' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_AddSpecificAmmPouches, CurrentPouchId) == 0x000020, "Member 'WBP_PlatformCustomisation_C_AddSpecificAmmPouches::CurrentPouchId' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_AddSpecificAmmPouches, LocalAmmoPouchTypeTags) == 0x000030, "Member 'WBP_PlatformCustomisation_C_AddSpecificAmmPouches::LocalAmmoPouchTypeTags' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_AddSpecificAmmPouches, LocalInvItemTags) == 0x000050, "Member 'WBP_PlatformCustomisation_C_AddSpecificAmmPouches::LocalInvItemTags' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_AddSpecificAmmPouches, CurrentAmmoId) == 0x000070, "Member 'WBP_PlatformCustomisation_C_AddSpecificAmmPouches::CurrentAmmoId' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_AddSpecificAmmPouches, AmmoAssetIds) == 0x000080, "Member 'WBP_PlatformCustomisation_C_AddSpecificAmmPouches::AmmoAssetIds' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_AddSpecificAmmPouches, Temp_int_Loop_Counter_Variable) == 0x000090, "Member 'WBP_PlatformCustomisation_C_AddSpecificAmmPouches::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_AddSpecificAmmPouches, CallFunc_Add_IntInt_ReturnValue) == 0x000094, "Member 'WBP_PlatformCustomisation_C_AddSpecificAmmPouches::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_AddSpecificAmmPouches, Temp_int_Array_Index_Variable) == 0x000098, "Member 'WBP_PlatformCustomisation_C_AddSpecificAmmPouches::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_AddSpecificAmmPouches, Temp_int_Array_Index_Variable_1) == 0x00009C, "Member 'WBP_PlatformCustomisation_C_AddSpecificAmmPouches::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_AddSpecificAmmPouches, CallFunc_IsValidInvItemAssetId_bOutResult) == 0x0000A0, "Member 'WBP_PlatformCustomisation_C_AddSpecificAmmPouches::CallFunc_IsValidInvItemAssetId_bOutResult' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_AddSpecificAmmPouches, CallFunc_GetInvItemAssetIds_OutItemAssetIds) == 0x0000A8, "Member 'WBP_PlatformCustomisation_C_AddSpecificAmmPouches::CallFunc_GetInvItemAssetIds_OutItemAssetIds' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_AddSpecificAmmPouches, CallFunc_GetFillCount_OutFillCount) == 0x0000B8, "Member 'WBP_PlatformCustomisation_C_AddSpecificAmmPouches::CallFunc_GetFillCount_OutFillCount' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_AddSpecificAmmPouches, K2Node_MakeStruct_FormatArgumentData) == 0x0000C0, "Member 'WBP_PlatformCustomisation_C_AddSpecificAmmPouches::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_AddSpecificAmmPouches, CallFunc_HasAnyTags_ReturnValue) == 0x000100, "Member 'WBP_PlatformCustomisation_C_AddSpecificAmmPouches::CallFunc_HasAnyTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_AddSpecificAmmPouches, CallFunc_GetARSSoftObjectPtrFromPrimaryAsset_OutSoftObjectPtr) == 0x000108, "Member 'WBP_PlatformCustomisation_C_AddSpecificAmmPouches::CallFunc_GetARSSoftObjectPtrFromPrimaryAsset_OutSoftObjectPtr' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_AddSpecificAmmPouches, CallFunc_GetARSSoftObjectPtrFromPrimaryAsset_ReturnValue) == 0x000130, "Member 'WBP_PlatformCustomisation_C_AddSpecificAmmPouches::CallFunc_GetARSSoftObjectPtrFromPrimaryAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_AddSpecificAmmPouches, CallFunc_GetARSTextFromPrimaryAsset_OutText) == 0x000138, "Member 'WBP_PlatformCustomisation_C_AddSpecificAmmPouches::CallFunc_GetARSTextFromPrimaryAsset_OutText' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_AddSpecificAmmPouches, CallFunc_GetARSTextFromPrimaryAsset_ReturnValue) == 0x000150, "Member 'WBP_PlatformCustomisation_C_AddSpecificAmmPouches::CallFunc_GetARSTextFromPrimaryAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_AddSpecificAmmPouches, K2Node_MakeStruct_FormatArgumentData_1) == 0x000158, "Member 'WBP_PlatformCustomisation_C_AddSpecificAmmPouches::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_AddSpecificAmmPouches, CallFunc_GetInvItemTags_ReturnValue) == 0x000198, "Member 'WBP_PlatformCustomisation_C_AddSpecificAmmPouches::CallFunc_GetInvItemTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_AddSpecificAmmPouches, K2Node_MakeArray_Array) == 0x0001B8, "Member 'WBP_PlatformCustomisation_C_AddSpecificAmmPouches::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_AddSpecificAmmPouches, CallFunc_Format_ReturnValue) == 0x0001C8, "Member 'WBP_PlatformCustomisation_C_AddSpecificAmmPouches::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_AddSpecificAmmPouches, Temp_int_Loop_Counter_Variable_1) == 0x0001E0, "Member 'WBP_PlatformCustomisation_C_AddSpecificAmmPouches::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_AddSpecificAmmPouches, CallFunc_CreateAmmoPouchPayload_OutPayload) == 0x0001E8, "Member 'WBP_PlatformCustomisation_C_AddSpecificAmmPouches::CallFunc_CreateAmmoPouchPayload_OutPayload' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_AddSpecificAmmPouches, CallFunc_Array_Add_ReturnValue) == 0x0001F0, "Member 'WBP_PlatformCustomisation_C_AddSpecificAmmPouches::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_AddSpecificAmmPouches, CallFunc_Add_IntInt_ReturnValue_1) == 0x0001F4, "Member 'WBP_PlatformCustomisation_C_AddSpecificAmmPouches::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_AddSpecificAmmPouches, CallFunc_Array_Get_Item) == 0x0001F8, "Member 'WBP_PlatformCustomisation_C_AddSpecificAmmPouches::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_AddSpecificAmmPouches, CallFunc_Array_Length_ReturnValue) == 0x000208, "Member 'WBP_PlatformCustomisation_C_AddSpecificAmmPouches::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_AddSpecificAmmPouches, CallFunc_Less_IntInt_ReturnValue) == 0x00020C, "Member 'WBP_PlatformCustomisation_C_AddSpecificAmmPouches::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_AddSpecificAmmPouches, CallFunc_GameplayTagContainer_Filter_OutFilteredContainer) == 0x000210, "Member 'WBP_PlatformCustomisation_C_AddSpecificAmmPouches::CallFunc_GameplayTagContainer_Filter_OutFilteredContainer' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_AddSpecificAmmPouches, CallFunc_GameplayTagContainer_Filter_ReturnValue) == 0x000230, "Member 'WBP_PlatformCustomisation_C_AddSpecificAmmPouches::CallFunc_GameplayTagContainer_Filter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_AddSpecificAmmPouches, CallFunc_GetInvItemTags_ReturnValue_1) == 0x000238, "Member 'WBP_PlatformCustomisation_C_AddSpecificAmmPouches::CallFunc_GetInvItemTags_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_AddSpecificAmmPouches, CallFunc_GetInvItemAssetIds_OutItemAssetIds_1) == 0x000258, "Member 'WBP_PlatformCustomisation_C_AddSpecificAmmPouches::CallFunc_GetInvItemAssetIds_OutItemAssetIds_1' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_AddSpecificAmmPouches, CallFunc_SortPrimaryAssetIdList_OutPrimaryAssetIdList) == 0x000268, "Member 'WBP_PlatformCustomisation_C_AddSpecificAmmPouches::CallFunc_SortPrimaryAssetIdList_OutPrimaryAssetIdList' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_AddSpecificAmmPouches, CallFunc_Array_Length_ReturnValue_1) == 0x000278, "Member 'WBP_PlatformCustomisation_C_AddSpecificAmmPouches::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_AddSpecificAmmPouches, CallFunc_Array_Get_Item_1) == 0x00027C, "Member 'WBP_PlatformCustomisation_C_AddSpecificAmmPouches::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_PlatformCustomisation_C_AddSpecificAmmPouches, CallFunc_Less_IntInt_ReturnValue_1) == 0x00028C, "Member 'WBP_PlatformCustomisation_C_AddSpecificAmmPouches::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");

// Function WBP_PlatformCustomisation.WBP_PlatformCustomisation_C.AddModularAmmoPouchPayload
// 0x01D8 (0x01D8 - 0x0000)
struct WBP_PlatformCustomisation_C_AddModularAmmoPouchPayload final
{
public:
	class FText                                   InDisplayName;                                     // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FGameplayTagContainer                  InInvItemTags;                                     // 0x0018(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
	EGBAmmoPouchModularity                        InDesiredModularity;                               // 0x0038(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPrimaryAssetId                        InDefaultPouchId;                                  // 0x003C(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPrimaryAssetId                        InDefaultAmmoId;                                   // 0x004C(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UObject>                 InIcon;                                            // 0x0060(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, UObjectWrapper, HasGetValueTypeHash)
	TArray<struct FPrimaryAssetId>                LocalAmmoPouchIds;                                 // 0x0088(0x0010)(Edit, BlueprintVisible)
	struct FGameplayTagContainer                  LocalAmmoPouchTypeTags;                            // 0x0098(0x0020)(Edit, BlueprintVisible)
	struct FPrimaryAssetId                        LocalAmmoId;                                       // 0x00B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class AGBInvItem*>                     FirearmChildItems;                                 // 0x00C8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TArray<class UGBAmmunitionFeedComponent*>     AmmunitionFeedComponents;                          // 0x00D8(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	class AGBInvItem*                             Firearm;                                           // 0x00E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_GetInvItemTags_ReturnValue;               // 0x00F8(0x0020)()
	bool                                          CallFunc_IsValidPrimaryAssetId_ReturnValue;        // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x011A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11B[0x5];                                      // 0x011B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPrimaryAssetId>                CallFunc_GetInvItemAssetIds_OutItemAssetIds;       // 0x0120(0x0010)(ReferenceParm)
	bool                                          CallFunc_GameplayTagContainer_IsValid_ReturnValue; // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidPrimaryAssetId_ReturnValue_1;      // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0132(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
