#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HotspotMapIcon

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_HotspotMapIcon.WBP_HotspotMapIcon_C.Get_SizeBox_Global_ToolTipWidget_0
// 0x0010 (0x0010 - 0x0000)
struct WBP_HotspotMapIcon_C_Get_SizeBox_Global_ToolTipWidget_0 final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Tooltip_WorldMap_C*                CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HotspotMapIcon_C_Get_SizeBox_Global_ToolTipWidget_0) == 0x000008, "Wrong alignment on WBP_HotspotMapIcon_C_Get_SizeBox_Global_ToolTipWidget_0");
static_assert(sizeof(WBP_HotspotMapIcon_C_Get_SizeBox_Global_ToolTipWidget_0) == 0x000010, "Wrong size on WBP_HotspotMapIcon_C_Get_SizeBox_Global_ToolTipWidget_0");
static_assert(offsetof(WBP_HotspotMapIcon_C_Get_SizeBox_Global_ToolTipWidget_0, ReturnValue) == 0x000000, "Member 'WBP_HotspotMapIcon_C_Get_SizeBox_Global_ToolTipWidget_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HotspotMapIcon_C_Get_SizeBox_Global_ToolTipWidget_0, CallFunc_Create_ReturnValue) == 0x000008, "Member 'WBP_HotspotMapIcon_C_Get_SizeBox_Global_ToolTipWidget_0::CallFunc_Create_ReturnValue' has a wrong offset!");

// Function WBP_HotspotMapIcon.WBP_HotspotMapIcon_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_HotspotMapIcon_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_HotspotMapIcon_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_HotspotMapIcon_C_PreConstruct");
static_assert(sizeof(WBP_HotspotMapIcon_C_PreConstruct) == 0x000001, "Wrong size on WBP_HotspotMapIcon_C_PreConstruct");
static_assert(offsetof(WBP_HotspotMapIcon_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_HotspotMapIcon_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_HotspotMapIcon.WBP_HotspotMapIcon_C.ExecuteUbergraph_WBP_HotspotMapIcon
// 0x0050 (0x0050 - 0x0000)
struct WBP_HotspotMapIcon_C_ExecuteUbergraph_WBP_HotspotMapIcon final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDoubleClickTime_ReturnValue;           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHovered_ReturnValue;                    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTimeSeconds_ReturnValue;               // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTimeSeconds_ReturnValue_1;             // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_HotspotMapIcon_C_ExecuteUbergraph_WBP_HotspotMapIcon) == 0x000008, "Wrong alignment on WBP_HotspotMapIcon_C_ExecuteUbergraph_WBP_HotspotMapIcon");
static_assert(sizeof(WBP_HotspotMapIcon_C_ExecuteUbergraph_WBP_HotspotMapIcon) == 0x000050, "Wrong size on WBP_HotspotMapIcon_C_ExecuteUbergraph_WBP_HotspotMapIcon");
static_assert(offsetof(WBP_HotspotMapIcon_C_ExecuteUbergraph_WBP_HotspotMapIcon, EntryPoint) == 0x000000, "Member 'WBP_HotspotMapIcon_C_ExecuteUbergraph_WBP_HotspotMapIcon::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_HotspotMapIcon_C_ExecuteUbergraph_WBP_HotspotMapIcon, CallFunc_GetDoubleClickTime_ReturnValue) == 0x000004, "Member 'WBP_HotspotMapIcon_C_ExecuteUbergraph_WBP_HotspotMapIcon::CallFunc_GetDoubleClickTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HotspotMapIcon_C_ExecuteUbergraph_WBP_HotspotMapIcon, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_HotspotMapIcon_C_ExecuteUbergraph_WBP_HotspotMapIcon::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_HotspotMapIcon_C_ExecuteUbergraph_WBP_HotspotMapIcon, K2Node_Event_IsDesignTime) == 0x000018, "Member 'WBP_HotspotMapIcon_C_ExecuteUbergraph_WBP_HotspotMapIcon::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_HotspotMapIcon_C_ExecuteUbergraph_WBP_HotspotMapIcon, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000020, "Member 'WBP_HotspotMapIcon_C_ExecuteUbergraph_WBP_HotspotMapIcon::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HotspotMapIcon_C_ExecuteUbergraph_WBP_HotspotMapIcon, CallFunc_PlayAnimation_ReturnValue) == 0x000028, "Member 'WBP_HotspotMapIcon_C_ExecuteUbergraph_WBP_HotspotMapIcon::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HotspotMapIcon_C_ExecuteUbergraph_WBP_HotspotMapIcon, CallFunc_IsHovered_ReturnValue) == 0x000030, "Member 'WBP_HotspotMapIcon_C_ExecuteUbergraph_WBP_HotspotMapIcon::CallFunc_IsHovered_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HotspotMapIcon_C_ExecuteUbergraph_WBP_HotspotMapIcon, CallFunc_Not_PreBool_ReturnValue) == 0x000031, "Member 'WBP_HotspotMapIcon_C_ExecuteUbergraph_WBP_HotspotMapIcon::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HotspotMapIcon_C_ExecuteUbergraph_WBP_HotspotMapIcon, CallFunc_PlayAnimation_ReturnValue_1) == 0x000038, "Member 'WBP_HotspotMapIcon_C_ExecuteUbergraph_WBP_HotspotMapIcon::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HotspotMapIcon_C_ExecuteUbergraph_WBP_HotspotMapIcon, CallFunc_GetTimeSeconds_ReturnValue) == 0x000040, "Member 'WBP_HotspotMapIcon_C_ExecuteUbergraph_WBP_HotspotMapIcon::CallFunc_GetTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HotspotMapIcon_C_ExecuteUbergraph_WBP_HotspotMapIcon, CallFunc_GetTimeSeconds_ReturnValue_1) == 0x000044, "Member 'WBP_HotspotMapIcon_C_ExecuteUbergraph_WBP_HotspotMapIcon::CallFunc_GetTimeSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HotspotMapIcon_C_ExecuteUbergraph_WBP_HotspotMapIcon, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000048, "Member 'WBP_HotspotMapIcon_C_ExecuteUbergraph_WBP_HotspotMapIcon::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HotspotMapIcon_C_ExecuteUbergraph_WBP_HotspotMapIcon, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00004C, "Member 'WBP_HotspotMapIcon_C_ExecuteUbergraph_WBP_HotspotMapIcon::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");

}

