#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_RadialMenu

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GroundBranch_structs.hpp"
#include "FRadialMenEntryInfo_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_RadialMenu.WBP_RadialMenu_C
// 0x00B0 (0x0310 - 0x0260)
class UWBP_RadialMenu_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Border_0;                                          // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_1;                                          // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_2;                                          // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_3;                                          // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_4;                                          // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_5;                                          // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_Centre;                                     // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Canvas;                                            // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bMouseButtonConfirm;                               // 0x02A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	bool                                          bMustSelect;                                       // 0x02A9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	bool                                          bDebug;                                            // 0x02AA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2AB[0x1];                                      // 0x02AB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         InputScale;                                        // 0x02AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CancelDistance;                                    // 0x02B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ScreenRatio;                                       // 0x02B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Angle;                                             // 0x02B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CursorDeltaTotal;                                  // 0x02BC(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C4[0x4];                                      // 0x02C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UUserWidget*>                    Entries;                                           // 0x02C8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<struct FFRadialMenEntryInfo>           RadialMenuAngles;                                  // 0x02D8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         SelectedIndex;                                     // 0x02E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           EntryBackground;                                   // 0x02EC(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           EntryBackgroundSelected;                           // 0x02FC(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_RadialMenu(int32 EntryPoint);
	void ForceClosed();
	void Construct();
	void PreConstruct(bool IsDesignTime);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void UpdateAngle();
	void Clear();
	void Open();
	void AddEntry(class UUserWidget* UserWidget);
	void Close();
	void UpdateSelectedEntry();
	void SetupChildren();
	void GetRadialQuickbinds();
	bool OverrideInputKey(const struct FKey& Key, EBPInputEvent EventType, float AmountDepressed, bool bGamepad);
	bool OverrideInputAxis(const struct FKey& Key, float Delta, float DeltaTime, int32 NumSamples, bool bGamepad);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_RadialMenu_C">();
	}
	static class UWBP_RadialMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_RadialMenu_C>();
	}
};
static_assert(alignof(UWBP_RadialMenu_C) == 0x000008, "Wrong alignment on UWBP_RadialMenu_C");
static_assert(sizeof(UWBP_RadialMenu_C) == 0x000310, "Wrong size on UWBP_RadialMenu_C");
static_assert(offsetof(UWBP_RadialMenu_C, UberGraphFrame) == 0x000260, "Member 'UWBP_RadialMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_RadialMenu_C, Border_0) == 0x000268, "Member 'UWBP_RadialMenu_C::Border_0' has a wrong offset!");
static_assert(offsetof(UWBP_RadialMenu_C, Border_1) == 0x000270, "Member 'UWBP_RadialMenu_C::Border_1' has a wrong offset!");
static_assert(offsetof(UWBP_RadialMenu_C, Border_2) == 0x000278, "Member 'UWBP_RadialMenu_C::Border_2' has a wrong offset!");
static_assert(offsetof(UWBP_RadialMenu_C, Border_3) == 0x000280, "Member 'UWBP_RadialMenu_C::Border_3' has a wrong offset!");
static_assert(offsetof(UWBP_RadialMenu_C, Border_4) == 0x000288, "Member 'UWBP_RadialMenu_C::Border_4' has a wrong offset!");
static_assert(offsetof(UWBP_RadialMenu_C, Border_5) == 0x000290, "Member 'UWBP_RadialMenu_C::Border_5' has a wrong offset!");
static_assert(offsetof(UWBP_RadialMenu_C, Border_Centre) == 0x000298, "Member 'UWBP_RadialMenu_C::Border_Centre' has a wrong offset!");
static_assert(offsetof(UWBP_RadialMenu_C, Canvas) == 0x0002A0, "Member 'UWBP_RadialMenu_C::Canvas' has a wrong offset!");
static_assert(offsetof(UWBP_RadialMenu_C, bMouseButtonConfirm) == 0x0002A8, "Member 'UWBP_RadialMenu_C::bMouseButtonConfirm' has a wrong offset!");
static_assert(offsetof(UWBP_RadialMenu_C, bMustSelect) == 0x0002A9, "Member 'UWBP_RadialMenu_C::bMustSelect' has a wrong offset!");
static_assert(offsetof(UWBP_RadialMenu_C, bDebug) == 0x0002AA, "Member 'UWBP_RadialMenu_C::bDebug' has a wrong offset!");
static_assert(offsetof(UWBP_RadialMenu_C, InputScale) == 0x0002AC, "Member 'UWBP_RadialMenu_C::InputScale' has a wrong offset!");
static_assert(offsetof(UWBP_RadialMenu_C, CancelDistance) == 0x0002B0, "Member 'UWBP_RadialMenu_C::CancelDistance' has a wrong offset!");
static_assert(offsetof(UWBP_RadialMenu_C, ScreenRatio) == 0x0002B4, "Member 'UWBP_RadialMenu_C::ScreenRatio' has a wrong offset!");
static_assert(offsetof(UWBP_RadialMenu_C, Angle) == 0x0002B8, "Member 'UWBP_RadialMenu_C::Angle' has a wrong offset!");
static_assert(offsetof(UWBP_RadialMenu_C, CursorDeltaTotal) == 0x0002BC, "Member 'UWBP_RadialMenu_C::CursorDeltaTotal' has a wrong offset!");
static_assert(offsetof(UWBP_RadialMenu_C, Entries) == 0x0002C8, "Member 'UWBP_RadialMenu_C::Entries' has a wrong offset!");
static_assert(offsetof(UWBP_RadialMenu_C, RadialMenuAngles) == 0x0002D8, "Member 'UWBP_RadialMenu_C::RadialMenuAngles' has a wrong offset!");
static_assert(offsetof(UWBP_RadialMenu_C, SelectedIndex) == 0x0002E8, "Member 'UWBP_RadialMenu_C::SelectedIndex' has a wrong offset!");
static_assert(offsetof(UWBP_RadialMenu_C, EntryBackground) == 0x0002EC, "Member 'UWBP_RadialMenu_C::EntryBackground' has a wrong offset!");
static_assert(offsetof(UWBP_RadialMenu_C, EntryBackgroundSelected) == 0x0002FC, "Member 'UWBP_RadialMenu_C::EntryBackgroundSelected' has a wrong offset!");

}

