#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Vote

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Slate_structs.hpp"


namespace SDK::Params
{

// Function WBP_Vote.WBP_Vote_C.Parse Mission Option
// 0x00E8 (0x00E8 - 0x0000)
struct WBP_Vote_C_Parse_Mission_Option final
{
public:
	class FString                                 OptionString;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Parameter;                                         // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_FindSubstring_ReturnValue;                // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A[0x2];                                       // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Len_ReturnValue;                          // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_ProjectContentDir_ReturnValue;            // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetMissionExtension_ReturnValue;          // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_RightChop_ReturnValue;                    // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_FindSubstring_ReturnValue_1;              // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Left_ReturnValue;                         // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_Select_Default;                             // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Vote_C_Parse_Mission_Option) == 0x000008, "Wrong alignment on WBP_Vote_C_Parse_Mission_Option");
static_assert(sizeof(WBP_Vote_C_Parse_Mission_Option) == 0x0000E8, "Wrong size on WBP_Vote_C_Parse_Mission_Option");
static_assert(offsetof(WBP_Vote_C_Parse_Mission_Option, OptionString) == 0x000000, "Member 'WBP_Vote_C_Parse_Mission_Option::OptionString' has a wrong offset!");
static_assert(offsetof(WBP_Vote_C_Parse_Mission_Option, Parameter) == 0x000010, "Member 'WBP_Vote_C_Parse_Mission_Option::Parameter' has a wrong offset!");
static_assert(offsetof(WBP_Vote_C_Parse_Mission_Option, CallFunc_Concat_StrStr_ReturnValue) == 0x000020, "Member 'WBP_Vote_C_Parse_Mission_Option::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Vote_C_Parse_Mission_Option, CallFunc_FindSubstring_ReturnValue) == 0x000030, "Member 'WBP_Vote_C_Parse_Mission_Option::CallFunc_FindSubstring_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Vote_C_Parse_Mission_Option, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000038, "Member 'WBP_Vote_C_Parse_Mission_Option::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Vote_C_Parse_Mission_Option, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000048, "Member 'WBP_Vote_C_Parse_Mission_Option::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Vote_C_Parse_Mission_Option, Temp_bool_Variable) == 0x000049, "Member 'WBP_Vote_C_Parse_Mission_Option::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Vote_C_Parse_Mission_Option, CallFunc_Len_ReturnValue) == 0x00004C, "Member 'WBP_Vote_C_Parse_Mission_Option::CallFunc_Len_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Vote_C_Parse_Mission_Option, CallFunc_ProjectContentDir_ReturnValue) == 0x000050, "Member 'WBP_Vote_C_Parse_Mission_Option::CallFunc_ProjectContentDir_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Vote_C_Parse_Mission_Option, CallFunc_Add_IntInt_ReturnValue) == 0x000060, "Member 'WBP_Vote_C_Parse_Mission_Option::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Vote_C_Parse_Mission_Option, CallFunc_GetMissionExtension_ReturnValue) == 0x000068, "Member 'WBP_Vote_C_Parse_Mission_Option::CallFunc_GetMissionExtension_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Vote_C_Parse_Mission_Option, CallFunc_Add_IntInt_ReturnValue_1) == 0x000078, "Member 'WBP_Vote_C_Parse_Mission_Option::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Vote_C_Parse_Mission_Option, CallFunc_RightChop_ReturnValue) == 0x000080, "Member 'WBP_Vote_C_Parse_Mission_Option::CallFunc_RightChop_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Vote_C_Parse_Mission_Option, CallFunc_FindSubstring_ReturnValue_1) == 0x000090, "Member 'WBP_Vote_C_Parse_Mission_Option::CallFunc_FindSubstring_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Vote_C_Parse_Mission_Option, CallFunc_GreaterEqual_IntInt_ReturnValue_1) == 0x000094, "Member 'WBP_Vote_C_Parse_Mission_Option::CallFunc_GreaterEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Vote_C_Parse_Mission_Option, CallFunc_Left_ReturnValue) == 0x000098, "Member 'WBP_Vote_C_Parse_Mission_Option::CallFunc_Left_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Vote_C_Parse_Mission_Option, K2Node_Select_Default) == 0x0000A8, "Member 'WBP_Vote_C_Parse_Mission_Option::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Vote_C_Parse_Mission_Option, CallFunc_Concat_StrStr_ReturnValue_2) == 0x0000B8, "Member 'WBP_Vote_C_Parse_Mission_Option::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Vote_C_Parse_Mission_Option, CallFunc_Concat_StrStr_ReturnValue_3) == 0x0000C8, "Member 'WBP_Vote_C_Parse_Mission_Option::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Vote_C_Parse_Mission_Option, CallFunc_Concat_StrStr_ReturnValue_4) == 0x0000D8, "Member 'WBP_Vote_C_Parse_Mission_Option::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");

// Function WBP_Vote.WBP_Vote_C.GetMapAndOptions
// 0x0240 (0x0240 - 0x0000)
struct WBP_Vote_C_GetMapAndOptions final
{
public:
	class FString                                 Combined;                                          // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 MissionFileName;                                   // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Options;                                           // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Final;                                             // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 TimeOfDay;                                         // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 GameMode;                                          // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CommandLine;                                       // 0x0060(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEmpty_ReturnValue_1;                    // 0x0073(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Parse_Mission_Option_Parameter;           // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_FindSubstring_ReturnValue;                // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_RightChop_ReturnValue;                    // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_RightChop_ReturnValue_1;                  // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_StringToDisplayString_ReturnValue;        // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_StartsWith_ReturnValue;                   // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_ParseOption_ReturnValue;                  // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetBaseFilename_ReturnValue;              // 0x00E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_ParseOption_ReturnValue_1;                // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetOptionsFromCommandLine_ReturnValue;    // 0x0100(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0110(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0120(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0130(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0140(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue_2;                    // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_StringToDisplayString_ReturnValue_1;      // 0x0158(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x0170(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_5;              // 0x0180(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UHFSave*                                CallFunc_LoadFile_ReturnValue;                     // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGBMissionData*                         K2Node_DynamicCast_AsGBMission_Data;               // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEmpty_ReturnValue_3;                    // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x01A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A3[0x5];                                      // 0x01A3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetBaseFilename_ReturnValue_1;            // 0x01A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetMapInfo_OutTitle;                      // 0x01B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetMapInfo_OutAuthor;                     // 0x01C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetMapInfo_OutDescription;                // 0x01D8(0x0018)()
	bool                                          CallFunc_GetMapInfo_ReturnValue;                   // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F1[0x7];                                      // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GenerateMissionDisplayName_ReturnValue;   // 0x01F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetMapFromCommandLine_ReturnValue;        // 0x0208(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0218(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0230(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Vote_C_GetMapAndOptions) == 0x000008, "Wrong alignment on WBP_Vote_C_GetMapAndOptions");
static_assert(sizeof(WBP_Vote_C_GetMapAndOptions) == 0x000240, "Wrong size on WBP_Vote_C_GetMapAndOptions");
static_assert(offsetof(WBP_Vote_C_GetMapAndOptions, Combined) == 0x000000, "Member 'WBP_Vote_C_GetMapAndOptions::Combined' has a wrong offset!");
static_assert(offsetof(WBP_Vote_C_GetMapAndOptions, MissionFileName) == 0x000010, "Member 'WBP_Vote_C_GetMapAndOptions::MissionFileName' has a wrong offset!");
static_assert(offsetof(WBP_Vote_C_GetMapAndOptions, Options) == 0x000020, "Member 'WBP_Vote_C_GetMapAndOptions::Options' has a wrong offset!");
static_assert(offsetof(WBP_Vote_C_GetMapAndOptions, Final) == 0x000030, "Member 'WBP_Vote_C_GetMapAndOptions::Final' has a wrong offset!");
static_assert(offsetof(WBP_Vote_C_GetMapAndOptions, TimeOfDay) == 0x000040, "Member 'WBP_Vote_C_GetMapAndOptions::TimeOfDay' has a wrong offset!");
static_assert(offsetof(WBP_Vote_C_GetMapAndOptions, GameMode) == 0x000050, "Member 'WBP_Vote_C_GetMapAndOptions::GameMode' has a wrong offset!");
static_assert(offsetof(WBP_Vote_C_GetMapAndOptions, CommandLine) == 0x000060, "Member 'WBP_Vote_C_GetMapAndOptions::CommandLine' has a wrong offset!");
static_assert(offsetof(WBP_Vote_C_GetMapAndOptions, CallFunc_Contains_ReturnValue) == 0x000070, "Member 'WBP_Vote_C_GetMapAndOptions::CallFunc_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Vote_C_GetMapAndOptions, CallFunc_IsEmpty_ReturnValue) == 0x000071, "Member 'WBP_Vote_C_GetMapAndOptions::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Vote_C_GetMapAndOptions, CallFunc_Not_PreBool_ReturnValue) == 0x000072, "Member 'WBP_Vote_C_GetMapAndOptions::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Vote_C_GetMapAndOptions, CallFunc_IsEmpty_ReturnValue_1) == 0x000073, "Member 'WBP_Vote_C_GetMapAndOptions::CallFunc_IsEmpty_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Vote_C_GetMapAndOptions, CallFunc_Not_PreBool_ReturnValue_1) == 0x000074, "Member 'WBP_Vote_C_GetMapAndOptions::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Vote_C_GetMapAndOptions, CallFunc_Parse_Mission_Option_Parameter) == 0x000078, "Member 'WBP_Vote_C_GetMapAndOptions::CallFunc_Parse_Mission_Option_Parameter' has a wrong offset!");
static_assert(offsetof(WBP_Vote_C_GetMapAndOptions, CallFunc_FindSubstring_ReturnValue) == 0x000088, "Member 'WBP_Vote_C_GetMapAndOptions::CallFunc_FindSubstring_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Vote_C_GetMapAndOptions, CallFunc_RightChop_ReturnValue) == 0x000090, "Member 'WBP_Vote_C_GetMapAndOptions::CallFunc_RightChop_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Vote_C_GetMapAndOptions, CallFunc_Add_IntInt_ReturnValue) == 0x0000A0, "Member 'WBP_Vote_C_GetMapAndOptions::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Vote_C_GetMapAndOptions, CallFunc_RightChop_ReturnValue_1) == 0x0000A8, "Member 'WBP_Vote_C_GetMapAndOptions::CallFunc_RightChop_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Vote_C_GetMapAndOptions, CallFunc_StringToDisplayString_ReturnValue) == 0x0000B8, "Member 'WBP_Vote_C_GetMapAndOptions::CallFunc_StringToDisplayString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Vote_C_GetMapAndOptions, CallFunc_StartsWith_ReturnValue) == 0x0000C8, "Member 'WBP_Vote_C_GetMapAndOptions::CallFunc_StartsWith_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Vote_C_GetMapAndOptions, CallFunc_ParseOption_ReturnValue) == 0x0000D0, "Member 'WBP_Vote_C_GetMapAndOptions::CallFunc_ParseOption_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Vote_C_GetMapAndOptions, CallFunc_GetBaseFilename_ReturnValue) == 0x0000E0, "Member 'WBP_Vote_C_GetMapAndOptions::CallFunc_GetBaseFilename_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Vote_C_GetMapAndOptions, CallFunc_ParseOption_ReturnValue_1) == 0x0000F0, "Member 'WBP_Vote_C_GetMapAndOptions::CallFunc_ParseOption_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Vote_C_GetMapAndOptions, CallFunc_GetOptionsFromCommandLine_ReturnValue) == 0x000100, "Member 'WBP_Vote_C_GetMapAndOptions::CallFunc_GetOptionsFromCommandLine_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Vote_C_GetMapAndOptions, CallFunc_Concat_StrStr_ReturnValue) == 0x000110, "Member 'WBP_Vote_C_GetMapAndOptions::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Vote_C_GetMapAndOptions, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000120, "Member 'WBP_Vote_C_GetMapAndOptions::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Vote_C_GetMapAndOptions, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000130, "Member 'WBP_Vote_C_GetMapAndOptions::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Vote_C_GetMapAndOptions, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000140, "Member 'WBP_Vote_C_GetMapAndOptions::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Vote_C_GetMapAndOptions, CallFunc_IsEmpty_ReturnValue_2) == 0x000150, "Member 'WBP_Vote_C_GetMapAndOptions::CallFunc_IsEmpty_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Vote_C_GetMapAndOptions, CallFunc_StringToDisplayString_ReturnValue_1) == 0x000158, "Member 'WBP_Vote_C_GetMapAndOptions::CallFunc_StringToDisplayString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Vote_C_GetMapAndOptions, CallFunc_Not_PreBool_ReturnValue_2) == 0x000168, "Member 'WBP_Vote_C_GetMapAndOptions::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Vote_C_GetMapAndOptions, CallFunc_Concat_StrStr_ReturnValue_4) == 0x000170, "Member 'WBP_Vote_C_GetMapAndOptions::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_Vote_C_GetMapAndOptions, CallFunc_Concat_StrStr_ReturnValue_5) == 0x000180, "Member 'WBP_Vote_C_GetMapAndOptions::CallFunc_Concat_StrStr_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_Vote_C_GetMapAndOptions, CallFunc_LoadFile_ReturnValue) == 0x000190, "Member 'WBP_Vote_C_GetMapAndOptions::CallFunc_LoadFile_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Vote_C_GetMapAndOptions, K2Node_DynamicCast_AsGBMission_Data) == 0x000198, "Member 'WBP_Vote_C_GetMapAndOptions::K2Node_DynamicCast_AsGBMission_Data' has a wrong offset!");
static_assert(offsetof(WBP_Vote_C_GetMapAndOptions, K2Node_DynamicCast_bSuccess) == 0x0001A0, "Member 'WBP_Vote_C_GetMapAndOptions::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Vote_C_GetMapAndOptions, CallFunc_IsEmpty_ReturnValue_3) == 0x0001A1, "Member 'WBP_Vote_C_GetMapAndOptions::CallFunc_IsEmpty_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Vote_C_GetMapAndOptions, CallFunc_Not_PreBool_ReturnValue_3) == 0x0001A2, "Member 'WBP_Vote_C_GetMapAndOptions::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Vote_C_GetMapAndOptions, CallFunc_GetBaseFilename_ReturnValue_1) == 0x0001A8, "Member 'WBP_Vote_C_GetMapAndOptions::CallFunc_GetBaseFilename_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Vote_C_GetMapAndOptions, CallFunc_GetMapInfo_OutTitle) == 0x0001B8, "Member 'WBP_Vote_C_GetMapAndOptions::CallFunc_GetMapInfo_OutTitle' has a wrong offset!");
static_assert(offsetof(WBP_Vote_C_GetMapAndOptions, CallFunc_GetMapInfo_OutAuthor) == 0x0001C8, "Member 'WBP_Vote_C_GetMapAndOptions::CallFunc_GetMapInfo_OutAuthor' has a wrong offset!");
static_assert(offsetof(WBP_Vote_C_GetMapAndOptions, CallFunc_GetMapInfo_OutDescription) == 0x0001D8, "Member 'WBP_Vote_C_GetMapAndOptions::CallFunc_GetMapInfo_OutDescription' has a wrong offset!");
static_assert(offsetof(WBP_Vote_C_GetMapAndOptions, CallFunc_GetMapInfo_ReturnValue) == 0x0001F0, "Member 'WBP_Vote_C_GetMapAndOptions::CallFunc_GetMapInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Vote_C_GetMapAndOptions, CallFunc_GenerateMissionDisplayName_ReturnValue) == 0x0001F8, "Member 'WBP_Vote_C_GetMapAndOptions::CallFunc_GenerateMissionDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Vote_C_GetMapAndOptions, CallFunc_GetMapFromCommandLine_ReturnValue) == 0x000208, "Member 'WBP_Vote_C_GetMapAndOptions::CallFunc_GetMapFromCommandLine_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Vote_C_GetMapAndOptions, CallFunc_Conv_StringToText_ReturnValue) == 0x000218, "Member 'WBP_Vote_C_GetMapAndOptions::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Vote_C_GetMapAndOptions, CallFunc_Conv_TextToString_ReturnValue) == 0x000230, "Member 'WBP_Vote_C_GetMapAndOptions::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");

// Function WBP_Vote.WBP_Vote_C.GetVotesNo
// 0x0030 (0x0030 - 0x0000)
struct WBP_Vote_C_GetVotesNo final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0018(0x0018)()
};
static_assert(alignof(WBP_Vote_C_GetVotesNo) == 0x000008, "Wrong alignment on WBP_Vote_C_GetVotesNo");
static_assert(sizeof(WBP_Vote_C_GetVotesNo) == 0x000030, "Wrong size on WBP_Vote_C_GetVotesNo");
static_assert(offsetof(WBP_Vote_C_GetVotesNo, ReturnValue) == 0x000000, "Member 'WBP_Vote_C_GetVotesNo::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Vote_C_GetVotesNo, CallFunc_Conv_IntToText_ReturnValue) == 0x000018, "Member 'WBP_Vote_C_GetVotesNo::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");

// Function WBP_Vote.WBP_Vote_C.GetVotesYes
// 0x0030 (0x0030 - 0x0000)
struct WBP_Vote_C_GetVotesYes final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0018(0x0018)()
};
static_assert(alignof(WBP_Vote_C_GetVotesYes) == 0x000008, "Wrong alignment on WBP_Vote_C_GetVotesYes");
static_assert(sizeof(WBP_Vote_C_GetVotesYes) == 0x000030, "Wrong size on WBP_Vote_C_GetVotesYes");
static_assert(offsetof(WBP_Vote_C_GetVotesYes, ReturnValue) == 0x000000, "Member 'WBP_Vote_C_GetVotesYes::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Vote_C_GetVotesYes, CallFunc_Conv_IntToText_ReturnValue) == 0x000018, "Member 'WBP_Vote_C_GetVotesYes::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");

// Function WBP_Vote.WBP_Vote_C.GetVotingTimeLeft
// 0x0030 (0x0030 - 0x0000)
struct WBP_Vote_C_GetVotingTimeLeft final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0018(0x0018)()
};
static_assert(alignof(WBP_Vote_C_GetVotingTimeLeft) == 0x000008, "Wrong alignment on WBP_Vote_C_GetVotingTimeLeft");
static_assert(sizeof(WBP_Vote_C_GetVotingTimeLeft) == 0x000030, "Wrong size on WBP_Vote_C_GetVotingTimeLeft");
static_assert(offsetof(WBP_Vote_C_GetVotingTimeLeft, ReturnValue) == 0x000000, "Member 'WBP_Vote_C_GetVotingTimeLeft::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Vote_C_GetVotingTimeLeft, CallFunc_Conv_IntToText_ReturnValue) == 0x000018, "Member 'WBP_Vote_C_GetVotingTimeLeft::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");

// Function WBP_Vote.WBP_Vote_C.VoteEnded
// 0x0001 (0x0001 - 0x0000)
struct WBP_Vote_C_VoteEnded final
{
public:
	bool                                          bPassed_0;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Vote_C_VoteEnded) == 0x000001, "Wrong alignment on WBP_Vote_C_VoteEnded");
static_assert(sizeof(WBP_Vote_C_VoteEnded) == 0x000001, "Wrong size on WBP_Vote_C_VoteEnded");
static_assert(offsetof(WBP_Vote_C_VoteEnded, bPassed_0) == 0x000000, "Member 'WBP_Vote_C_VoteEnded::bPassed_0' has a wrong offset!");

// Function WBP_Vote.WBP_Vote_C.ExecuteUbergraph_WBP_Vote
// 0x0250 (0x0250 - 0x0000)
struct WBP_Vote_C_ExecuteUbergraph_WBP_Vote final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bPassed;                        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnchors                               K2Node_MakeStruct_Anchors;                         // 0x0008(0x0010)(NoDestructor)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Array_Get_Item;                           // 0x0020(0x0018)()
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetPlayerName_ReturnValue;                // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0068(0x0018)()
	bool                                          CallFunc_Contains_ReturnValue_1;                   // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Contains_ReturnValue_2;                   // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0088(0x0018)()
	class FString                                 CallFunc_GetMapAndOptions_Combined;                // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_ReplaceInline_ReturnValue;                // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FindSubstring_ReturnValue;                // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Len_ReturnValue;                          // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGBPlayerState*                         CallFunc_FindPlayerStateByPlayerNameOrUniqueId_ReturnValue; // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_2;            // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlayerName_ReturnValue_1;              // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Mid_ReturnValue;                          // 0x00E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_ReplaceInline_ReturnValue_1;              // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FD[0x3];                                       // 0x00FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_ReplaceInline_ReturnValue_2;              // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x0108(0x0018)()
	class FString                                 CallFunc_StringToDisplayString_ReturnValue;        // 0x0120(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_3;          // 0x0130(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_4;          // 0x0148(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0160(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x01A0(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x01E0(0x0010)(ReferenceParm)
	int32                                         Temp_int_Variable;                                 // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F4[0x4];                                      // 0x01F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x01F8(0x0018)()
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0211(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0212(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_213[0x1];                                      // 0x0213(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0214(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_224[0x4];                                      // 0x0224(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0228(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ReplaceInline_ReturnValue_3;              // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_234[0x4];                                      // 0x0234(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Left_ReturnValue;                         // 0x0238(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Vote_C_ExecuteUbergraph_WBP_Vote) == 0x000008, "Wrong alignment on WBP_Vote_C_ExecuteUbergraph_WBP_Vote");
static_assert(sizeof(WBP_Vote_C_ExecuteUbergraph_WBP_Vote) == 0x000250, "Wrong size on WBP_Vote_C_ExecuteUbergraph_WBP_Vote");
static_assert(offsetof(WBP_Vote_C_ExecuteUbergraph_WBP_Vote, EntryPoint) == 0x000000, "Member 'WBP_Vote_C_ExecuteUbergraph_WBP_Vote::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Vote_C_ExecuteUbergraph_WBP_Vote, K2Node_CustomEvent_bPassed) == 0x000004, "Member 'WBP_Vote_C_ExecuteUbergraph_WBP_Vote::K2Node_CustomEvent_bPassed' has a wrong offset!");
static_assert(offsetof(WBP_Vote_C_ExecuteUbergraph_WBP_Vote, K2Node_MakeStruct_Anchors) == 0x000008, "Member 'WBP_Vote_C_ExecuteUbergraph_WBP_Vote::K2Node_MakeStruct_Anchors' has a wrong offset!");
