#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Campaign_CurrentConditions_HumanFactors

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Campaign_CurrentConditions_HumanFactors.WBP_Campaign_CurrentConditions_HumanFactors_C
// 0x0050 (0x02B0 - 0x0260)
class UWBP_Campaign_CurrentConditions_HumanFactors_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             TextBlock_Alertness;                               // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_EnemyForces;                             // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Populace;                                // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FName                                   HotspotCodename;                                   // 0x0280(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         MissionSequenceNumber;                             // 0x0288(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FName                                   MissionDetailsTableId;                             // 0x028C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_294[0x4];                                      // 0x0294(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Text_Unknown;                                      // 0x0298(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_WBP_Campaign_CurrentConditions_HumanFactors(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Campaign_CurrentConditions_HumanFactors_C">();
	}
	static class UWBP_Campaign_CurrentConditions_HumanFactors_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Campaign_CurrentConditions_HumanFactors_C>();
	}
};
static_assert(alignof(UWBP_Campaign_CurrentConditions_HumanFactors_C) == 0x000008, "Wrong alignment on UWBP_Campaign_CurrentConditions_HumanFactors_C");
static_assert(sizeof(UWBP_Campaign_CurrentConditions_HumanFactors_C) == 0x0002B0, "Wrong size on UWBP_Campaign_CurrentConditions_HumanFactors_C");
static_assert(offsetof(UWBP_Campaign_CurrentConditions_HumanFactors_C, UberGraphFrame) == 0x000260, "Member 'UWBP_Campaign_CurrentConditions_HumanFactors_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Campaign_CurrentConditions_HumanFactors_C, TextBlock_Alertness) == 0x000268, "Member 'UWBP_Campaign_CurrentConditions_HumanFactors_C::TextBlock_Alertness' has a wrong offset!");
static_assert(offsetof(UWBP_Campaign_CurrentConditions_HumanFactors_C, TextBlock_EnemyForces) == 0x000270, "Member 'UWBP_Campaign_CurrentConditions_HumanFactors_C::TextBlock_EnemyForces' has a wrong offset!");
static_assert(offsetof(UWBP_Campaign_CurrentConditions_HumanFactors_C, TextBlock_Populace) == 0x000278, "Member 'UWBP_Campaign_CurrentConditions_HumanFactors_C::TextBlock_Populace' has a wrong offset!");
static_assert(offsetof(UWBP_Campaign_CurrentConditions_HumanFactors_C, HotspotCodename) == 0x000280, "Member 'UWBP_Campaign_CurrentConditions_HumanFactors_C::HotspotCodename' has a wrong offset!");
static_assert(offsetof(UWBP_Campaign_CurrentConditions_HumanFactors_C, MissionSequenceNumber) == 0x000288, "Member 'UWBP_Campaign_CurrentConditions_HumanFactors_C::MissionSequenceNumber' has a wrong offset!");
static_assert(offsetof(UWBP_Campaign_CurrentConditions_HumanFactors_C, MissionDetailsTableId) == 0x00028C, "Member 'UWBP_Campaign_CurrentConditions_HumanFactors_C::MissionDetailsTableId' has a wrong offset!");
static_assert(offsetof(UWBP_Campaign_CurrentConditions_HumanFactors_C, Text_Unknown) == 0x000298, "Member 'UWBP_Campaign_CurrentConditions_HumanFactors_C::Text_Unknown' has a wrong offset!");

}

