#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CampaignMainMenu

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_CampaignMainMenu.WBP_CampaignMainMenu_C.ExecuteUbergraph_WBP_CampaignMainMenu
// 0x0558 (0x0558 - 0x0000)
struct WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetConsoleVariableBoolValue_ReturnValue;  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_HotspotListEntry_C*                CallFunc_Create_ReturnValue;                       // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGBPlayerControllerBase*                K2Node_DynamicCast_AsGBPlayer_Controller_Base;     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_HotspotMapIcon_C*                  CallFunc_Create_ReturnValue_1;                     // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGBPlayerControllerBase*                K2Node_DynamicCast_AsGBPlayer_Controller_Base_1;   // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UGBHotspotDataAsset* SelectedHotspotData)> K2Node_CreateDelegate_OutputDelegate; // 0x0054(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_FrontEndMenuManager_C*             CallFunc_GetFirstWidgetOfClass_ReturnValue;        // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0078(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetMousePositionOnViewport_ReturnValue;   // 0x00B4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              CallFunc_GetCachedGeometry_ReturnValue;            // 0x00BC(0x0038)(ConstParm, IsPlainOldData, NoDestructor)
	struct FVector2D                              CallFunc_BreakGeometry_OutPosition;                // 0x00F4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_BreakGeometry_OutAbsolutePosition;        // 0x00FC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_BreakGeometry_OutSize;                    // 0x0104(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGeometry_OutScale;                   // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOverlaySlot*                           CallFunc_AddChildToOverlay_ReturnValue;            // 0x0110(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FPrimaryAssetId>                CallFunc_GetPrimaryAssetIdList_OutPrimaryAssetIdList; // 0x0118(0x0010)(ReferenceParm)
	struct FPrimaryAssetId                        CallFunc_Array_Get_Item;                           // 0x0128(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UObject>                 CallFunc_GetSoftObjectReferenceFromPrimaryAssetId_ReturnValue; // 0x0138(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_164[0x4];                                      // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_BlueprintSyncLoadAsset_ReturnValue;       // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_174[0x4];                                      // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGBHotspotDataAsset*                    K2Node_DynamicCast_AsGBHotspot_Data_Asset;         // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_181[0x3];                                      // 0x0181(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0189(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_18A[0x6];                                      // 0x018A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0190(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGBHotspotDataAsset*                    K2Node_CustomEvent_SelectedHotspotData;            // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGBHotspotDataAsset*                    K2Node_CustomEvent_HotspotToSelect;                // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B9[0x7];                                      // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_DialogueBox_C*                     CallFunc_Create_ReturnValue_2;                     // 0x01C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_DialogueBox_C*                     CallFunc_Create_ReturnValue_3;                     // 0x01C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWBP_DialogueBox_C* Dialogue)> K2Node_CreateDelegate_OutputDelegate_1;      // 0x01D0(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E1[0x3];                                      // 0x01E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              CallFunc_GetCachedGeometry_ReturnValue_1;          // 0x01E4(0x0038)(ConstParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21C[0x4];                                      // 0x021C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGBHotspotDataAsset*                    K2Node_CustomEvent_SelectedHotspot_4;              // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_BreakGeometry_OutPosition_1;              // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_BreakGeometry_OutAbsolutePosition_1;      // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_BreakGeometry_OutSize_1;                  // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGeometry_OutScale_1;                 // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DFloat_ReturnValue;       // 0x0244(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x024C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0250(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0260(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0278(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_289[0x3];                                      // 0x0289(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UGBHotspotDataAsset* SelectedHotspot)> K2Node_CreateDelegate_OutputDelegate_2; // 0x028C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x029C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29D[0x3];                                      // 0x029D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UGBHotspotDataAsset* SelectedHotspot)> K2Node_CreateDelegate_OutputDelegate_3; // 0x02A0(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x02B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B5[0x3];                                      // 0x02B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x02BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_CampaignHighlightIcon_C*           CallFunc_Create_ReturnValue_4;                     // 0x02C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue_1;                     // 0x02CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UGBHotspotDataAsset* SelectedHotspot)> K2Node_CreateDelegate_OutputDelegate_4; // 0x02D0(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_MultiplyMultiply_FloatFloat_ReturnValue;  // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x02E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F1[0x3];                                      // 0x02F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UGBHotspotDataAsset* SelectedHotspot)> K2Node_CreateDelegate_OutputDelegate_5; // 0x02F4(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_304[0x4];                                      // 0x0304(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue_1;             // 0x0308(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item_1;                         // 0x0318(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue_2;             // 0x0320(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWBP_HotspotListEntry_C*                K2Node_DynamicCast_AsWBP_Hotspot_List_Entry;       // 0x0330(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_339[0x7];                                      // 0x0339(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item_2;                         // 0x0340(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_HotspotMapIcon_C*                  K2Node_DynamicCast_AsWBP_Hotspot_Map_Icon;         // 0x0348(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0351(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_352[0x2];                                      // 0x0352(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0354(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x0358(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x035C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x035D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35E[0x2];                                      // 0x035E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0360(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0364(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0365(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_366[0x2];                                      // 0x0366(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0368(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x036C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_36D[0x3];                                      // 0x036D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              K2Node_CustomEvent_DesiredTranslation;             // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_ClampMapTranslationToAvailableSize_ClampedTranslation; // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable;                               // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_ClampMapTranslationToAvailableSize_ClampedTranslation_1; // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsUser_Widget;             // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_399[0x7];                                      // 0x0399(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_ShowScreen_CreatedMissionScreenWidget;    // 0x03A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_CampaignMissionMenu_C*             K2Node_DynamicCast_AsWBP_Campaign_Mission_Menu;    // 0x03A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x03B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B1[0x3];                                      // 0x03B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x03B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_Array_Get_Item_3;                         // 0x03B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_HotspotMapIcon_C*                  K2Node_DynamicCast_AsWBP_Hotspot_Map_Icon_1;       // 0x03C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x03C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C9[0x3];                                      // 0x03C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_Get_Hotspot_Screen_Location_RawMapPosition; // 0x03CC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Get_Hotspot_Screen_Location_CentredScreenPosition; // 0x03D4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Get_Hotspot_Screen_Location_TranslationNeededToCentreIcon; // 0x03DC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_2;    // 0x03E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E5[0x3];                                      // 0x03E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue;    // 0x03E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UObject>                    K2Node_CustomEvent_Loaded;                         // 0x03F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue_1;     // 0x03F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x03F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x03FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3FB[0x5];                                      // 0x03FB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0400(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0408(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x0410(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_Vector2DVector2D_ReturnValue;    // 0x0411(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_412[0x2];                                      // 0x0412(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Ease_ReturnValue;                         // 0x0414(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue_2;     // 0x0418(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0419(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41A[0x6];                                      // 0x041A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_2;       // 0x0420(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue_1;  // 0x0428(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECheckBoxState                                Temp_byte_Variable;                                // 0x0430(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_431[0x3];                                      // 0x0431(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_Multiply_Vector2DFloat_ReturnValue_1;     // 0x0434(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize2DSquared_ReturnValue;               // 0x043C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0440(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_441[0x3];                                      // 0x0441(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue;         // 0x0444(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x044C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Select_Default;                             // 0x0450(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0458(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_ClampMapTranslationToAvailableSize_ClampedTranslation_2; // 0x045C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0464(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue_2;                     // 0x0468(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_46C[0x4];                                      // 0x046C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGBHotspotDataAsset*                    K2Node_CustomEvent_SelectedHotspot_3;              // 0x0470(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECheckBoxState                                Temp_byte_Variable_1;                              // 0x0478(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0479(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x047A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_47B[0x5];                                      // 0x047B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UGBHotspotDataAsset*                    K2Node_CustomEvent_SelectedHotspot_2;              // 0x0480(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECheckBoxState                                K2Node_Select_Default_1;                           // 0x0488(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0489(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_48A[0x6];                                      // 0x048A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UOverlaySlot*                           CallFunc_AddChildToOverlay_ReturnValue_1;          // 0x0490(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0498(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x04A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomInteger_ReturnValue;                // 0x04A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x04AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x04B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B1[0x3];                                      // 0x04B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x04B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGBHotspotDataAsset*                    K2Node_CustomEvent_SelectedHotspot_1;              // 0x04B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_3;    // 0x04C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C1[0x7];                                      // 0x04C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGBHotspotDataAsset*                    K2Node_CustomEvent_SelectedHotspot;                // 0x04C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_4;    // 0x04D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D1[0x7];                                      // 0x04D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CampaignNewsFeed_C*                CallFunc_Create_ReturnValue_5;                     // 0x04D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_5;    // 0x04E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x04E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E2[0x2];                                      // 0x04E2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_Get_Hotspot_Screen_Location_RawMapPosition_1; // 0x04E4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Get_Hotspot_Screen_Location_CentredScreenPosition_1; // 0x04EC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Get_Hotspot_Screen_Location_TranslationNeededToCentreIcon_1; // 0x04F4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_ClampMapTranslationToAvailableSize_ClampedTranslation_3; // 0x04FC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0504(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x0505(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_506[0x2];                                      // 0x0506(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_Get_Hotspot_Screen_Location_RawMapPosition_2; // 0x0508(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Get_Hotspot_Screen_Location_CentredScreenPosition_2; // 0x0510(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Get_Hotspot_Screen_Location_TranslationNeededToCentreIcon_2; // 0x0518(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_6;    // 0x0520(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_521[0x3];                                      // 0x0521(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UGBHotspotDataAsset* SelectedHotspot)> K2Node_CreateDelegate_OutputDelegate_6; // 0x0524(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_534[0x4];                                      // 0x0534(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_DialogueBox_C*                     K2Node_CustomEvent_dialogue;                       // 0x0538(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGBCampaignSettings*                    CallFunc_Get_ReturnValue;                          // 0x0540(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(TSubclassOf<class UObject> Loaded)> K2Node_CreateDelegate_OutputDelegate_7;       // 0x0548(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu) == 0x000008, "Wrong alignment on WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu");
static_assert(sizeof(WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu) == 0x000558, "Wrong size on WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu");
static_assert(offsetof(WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu, EntryPoint) == 0x000000, "Member 'WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu, CallFunc_GetConsoleVariableBoolValue_ReturnValue) == 0x000004, "Member 'WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu::CallFunc_GetConsoleVariableBoolValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu, CallFunc_GetPlayerController_ReturnValue) == 0x000018, "Member 'WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu, CallFunc_Create_ReturnValue) == 0x000020, "Member 'WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu, K2Node_DynamicCast_AsGBPlayer_Controller_Base) == 0x000028, "Member 'WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu::K2Node_DynamicCast_AsGBPlayer_Controller_Base' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu, CallFunc_Create_ReturnValue_1) == 0x000038, "Member 'WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu, CallFunc_GetPlayerController_ReturnValue_1) == 0x000040, "Member 'WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu, K2Node_DynamicCast_AsGBPlayer_Controller_Base_1) == 0x000048, "Member 'WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu::K2Node_DynamicCast_AsGBPlayer_Controller_Base_1' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu, K2Node_DynamicCast_bSuccess_1) == 0x000050, "Member 'WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu, K2Node_CreateDelegate_OutputDelegate) == 0x000054, "Member 'WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu, CallFunc_GetFirstWidgetOfClass_ReturnValue) == 0x000068, "Member 'WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu::CallFunc_GetFirstWidgetOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu, CallFunc_IsValid_ReturnValue) == 0x000070, "Member 'WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu, Temp_int_Array_Index_Variable_1) == 0x000074, "Member 'WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu, K2Node_Event_MyGeometry) == 0x000078, "Member 'WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu, K2Node_Event_InDeltaTime) == 0x0000B0, "Member 'WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu, CallFunc_GetMousePositionOnViewport_ReturnValue) == 0x0000B4, "Member 'WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu::CallFunc_GetMousePositionOnViewport_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu, CallFunc_GetCachedGeometry_ReturnValue) == 0x0000BC, "Member 'WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu::CallFunc_GetCachedGeometry_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu, CallFunc_BreakGeometry_OutPosition) == 0x0000F4, "Member 'WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu::CallFunc_BreakGeometry_OutPosition' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu, CallFunc_BreakGeometry_OutAbsolutePosition) == 0x0000FC, "Member 'WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu::CallFunc_BreakGeometry_OutAbsolutePosition' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu, CallFunc_BreakGeometry_OutSize) == 0x000104, "Member 'WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu::CallFunc_BreakGeometry_OutSize' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu, CallFunc_BreakGeometry_OutScale) == 0x00010C, "Member 'WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu::CallFunc_BreakGeometry_OutScale' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu, CallFunc_AddChildToOverlay_ReturnValue) == 0x000110, "Member 'WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu::CallFunc_AddChildToOverlay_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu, CallFunc_GetPrimaryAssetIdList_OutPrimaryAssetIdList) == 0x000118, "Member 'WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu::CallFunc_GetPrimaryAssetIdList_OutPrimaryAssetIdList' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu, CallFunc_Array_Get_Item) == 0x000128, "Member 'WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu, CallFunc_GetSoftObjectReferenceFromPrimaryAssetId_ReturnValue) == 0x000138, "Member 'WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu::CallFunc_GetSoftObjectReferenceFromPrimaryAssetId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu, CallFunc_Array_Length_ReturnValue) == 0x000160, "Member 'WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu, CallFunc_BlueprintSyncLoadAsset_ReturnValue) == 0x000168, "Member 'WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu::CallFunc_BlueprintSyncLoadAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu, Temp_int_Loop_Counter_Variable_1) == 0x000170, "Member 'WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu, K2Node_DynamicCast_AsGBHotspot_Data_Asset) == 0x000178, "Member 'WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu::K2Node_DynamicCast_AsGBHotspot_Data_Asset' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu, K2Node_DynamicCast_bSuccess_2) == 0x000180, "Member 'WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu, CallFunc_Add_IntInt_ReturnValue_1) == 0x000184, "Member 'WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu, CallFunc_Not_PreBool_ReturnValue) == 0x000188, "Member 'WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu, CallFunc_BooleanOR_ReturnValue) == 0x000189, "Member 'WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu, CallFunc_GetAllChildren_ReturnValue) == 0x000190, "Member 'WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu, CallFunc_Array_Length_ReturnValue_1) == 0x0001A0, "Member 'WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu, Temp_int_Array_Index_Variable_2) == 0x0001A4, "Member 'WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu, K2Node_CustomEvent_SelectedHotspotData) == 0x0001A8, "Member 'WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu::K2Node_CustomEvent_SelectedHotspotData' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu, K2Node_CustomEvent_HotspotToSelect) == 0x0001B0, "Member 'WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu::K2Node_CustomEvent_HotspotToSelect' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu, CallFunc_IsValid_ReturnValue_1) == 0x0001B8, "Member 'WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu, CallFunc_Create_ReturnValue_2) == 0x0001C0, "Member 'WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu::CallFunc_Create_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu, CallFunc_Create_ReturnValue_3) == 0x0001C8, "Member 'WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu::CallFunc_Create_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu, K2Node_CreateDelegate_OutputDelegate_1) == 0x0001D0, "Member 'WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu, CallFunc_IsValid_ReturnValue_2) == 0x0001E0, "Member 'WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu, CallFunc_GetCachedGeometry_ReturnValue_1) == 0x0001E4, "Member 'WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu::CallFunc_GetCachedGeometry_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu, K2Node_CustomEvent_SelectedHotspot_4) == 0x000220, "Member 'WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu::K2Node_CustomEvent_SelectedHotspot_4' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu, CallFunc_BreakGeometry_OutPosition_1) == 0x000228, "Member 'WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu::CallFunc_BreakGeometry_OutPosition_1' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu, CallFunc_BreakGeometry_OutAbsolutePosition_1) == 0x000230, "Member 'WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu::CallFunc_BreakGeometry_OutAbsolutePosition_1' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu, CallFunc_BreakGeometry_OutSize_1) == 0x000238, "Member 'WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu::CallFunc_BreakGeometry_OutSize_1' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu, CallFunc_BreakGeometry_OutScale_1) == 0x000240, "Member 'WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu::CallFunc_BreakGeometry_OutScale_1' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu, CallFunc_Multiply_Vector2DFloat_ReturnValue) == 0x000244, "Member 'WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu::CallFunc_Multiply_Vector2DFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu, CallFunc_Array_Length_ReturnValue_2) == 0x00024C, "Member 'WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu, CallFunc_Conv_IntToString_ReturnValue) == 0x000250, "Member 'WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu, CallFunc_Concat_StrStr_ReturnValue) == 0x000260, "Member 'WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu, CallFunc_PlayAnimationForward_ReturnValue) == 0x000270, "Member 'WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000278, "Member 'WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu, CallFunc_NearlyEqual_FloatFloat_ReturnValue) == 0x000288, "Member 'WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu::CallFunc_NearlyEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu, K2Node_CreateDelegate_OutputDelegate_2) == 0x00028C, "Member 'WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu, CallFunc_Not_PreBool_ReturnValue_1) == 0x00029C, "Member 'WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu, K2Node_CreateDelegate_OutputDelegate_3) == 0x0002A0, "Member 'WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0002B0, "Member 'WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu, CallFunc_Greater_FloatFloat_ReturnValue) == 0x0002B4, "Member 'WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu, CallFunc_Add_FloatFloat_ReturnValue) == 0x0002B8, "Member 'WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0002BC, "Member 'WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu, CallFunc_Create_ReturnValue_4) == 0x0002C0, "Member 'WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu::CallFunc_Create_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu, CallFunc_FClamp_ReturnValue) == 0x0002C8, "Member 'WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu, CallFunc_FClamp_ReturnValue_1) == 0x0002CC, "Member 'WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu, K2Node_CreateDelegate_OutputDelegate_4) == 0x0002D0, "Member 'WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue) == 0x0002E0, "Member 'WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu, CallFunc_Lerp_ReturnValue) == 0x0002E4, "Member 'WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu, CallFunc_MakeVector2D_ReturnValue) == 0x0002E8, "Member 'WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x0002F0, "Member 'WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu, K2Node_CreateDelegate_OutputDelegate_5) == 0x0002F4, "Member 'WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu, CallFunc_GetAllChildren_ReturnValue_1) == 0x000308, "Member 'WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu::CallFunc_GetAllChildren_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu, CallFunc_Array_Get_Item_1) == 0x000318, "Member 'WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu, CallFunc_GetAllChildren_ReturnValue_2) == 0x000320, "Member 'WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu::CallFunc_GetAllChildren_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu, K2Node_DynamicCast_AsWBP_Hotspot_List_Entry) == 0x000330, "Member 'WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu::K2Node_DynamicCast_AsWBP_Hotspot_List_Entry' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu, K2Node_DynamicCast_bSuccess_3) == 0x000338, "Member 'WBP_CampaignMainMenu_C_ExecuteUbergraph_WBP_CampaignMainMenu::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
