#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Mission_PlayerListEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Mission_PlayerListEntry.WBP_Mission_PlayerListEntry_C
// 0x00C0 (0x0320 - 0x0260)
class UWBP_Mission_PlayerListEntry_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             TextBlock_313;                                     // 0x0268(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Accuracy;                                // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Kills;                                   // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_ShotsFired;                              // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_ShotsHit;                                // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Status;                                  // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class AGBPlayerState*                         PlayerState;                                       // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnUpdate;                                          // 0x02A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	int32                                         Kills;                                             // 0x02B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ShotsFired;                                        // 0x02B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ShotsHit;                                          // 0x02B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Accuracy;                                          // 0x02BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   StatusMIA;                                         // 0x02C0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   StatusKIA;                                         // 0x02D8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   StatusWIA;                                         // 0x02F0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   StatusOK;                                          // 0x0308(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_WBP_Mission_PlayerListEntry(int32 EntryPoint);
	void UpdateStatus(const class FString& StatusKey);
	void OnReplicatedPlayerStatsUpdated_Event_0(class AGBPlayerState* PlayerState_0);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Mission_PlayerListEntry_C">();
	}
	static class UWBP_Mission_PlayerListEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Mission_PlayerListEntry_C>();
	}
};
static_assert(alignof(UWBP_Mission_PlayerListEntry_C) == 0x000008, "Wrong alignment on UWBP_Mission_PlayerListEntry_C");
static_assert(sizeof(UWBP_Mission_PlayerListEntry_C) == 0x000320, "Wrong size on UWBP_Mission_PlayerListEntry_C");
static_assert(offsetof(UWBP_Mission_PlayerListEntry_C, UberGraphFrame) == 0x000260, "Member 'UWBP_Mission_PlayerListEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Mission_PlayerListEntry_C, TextBlock_313) == 0x000268, "Member 'UWBP_Mission_PlayerListEntry_C::TextBlock_313' has a wrong offset!");
static_assert(offsetof(UWBP_Mission_PlayerListEntry_C, TextBlock_Accuracy) == 0x000270, "Member 'UWBP_Mission_PlayerListEntry_C::TextBlock_Accuracy' has a wrong offset!");
static_assert(offsetof(UWBP_Mission_PlayerListEntry_C, TextBlock_Kills) == 0x000278, "Member 'UWBP_Mission_PlayerListEntry_C::TextBlock_Kills' has a wrong offset!");
static_assert(offsetof(UWBP_Mission_PlayerListEntry_C, TextBlock_ShotsFired) == 0x000280, "Member 'UWBP_Mission_PlayerListEntry_C::TextBlock_ShotsFired' has a wrong offset!");
static_assert(offsetof(UWBP_Mission_PlayerListEntry_C, TextBlock_ShotsHit) == 0x000288, "Member 'UWBP_Mission_PlayerListEntry_C::TextBlock_ShotsHit' has a wrong offset!");
static_assert(offsetof(UWBP_Mission_PlayerListEntry_C, TextBlock_Status) == 0x000290, "Member 'UWBP_Mission_PlayerListEntry_C::TextBlock_Status' has a wrong offset!");
static_assert(offsetof(UWBP_Mission_PlayerListEntry_C, PlayerState) == 0x000298, "Member 'UWBP_Mission_PlayerListEntry_C::PlayerState' has a wrong offset!");
static_assert(offsetof(UWBP_Mission_PlayerListEntry_C, OnUpdate) == 0x0002A0, "Member 'UWBP_Mission_PlayerListEntry_C::OnUpdate' has a wrong offset!");
static_assert(offsetof(UWBP_Mission_PlayerListEntry_C, Kills) == 0x0002B0, "Member 'UWBP_Mission_PlayerListEntry_C::Kills' has a wrong offset!");
static_assert(offsetof(UWBP_Mission_PlayerListEntry_C, ShotsFired) == 0x0002B4, "Member 'UWBP_Mission_PlayerListEntry_C::ShotsFired' has a wrong offset!");
static_assert(offsetof(UWBP_Mission_PlayerListEntry_C, ShotsHit) == 0x0002B8, "Member 'UWBP_Mission_PlayerListEntry_C::ShotsHit' has a wrong offset!");
static_assert(offsetof(UWBP_Mission_PlayerListEntry_C, Accuracy) == 0x0002BC, "Member 'UWBP_Mission_PlayerListEntry_C::Accuracy' has a wrong offset!");
static_assert(offsetof(UWBP_Mission_PlayerListEntry_C, StatusMIA) == 0x0002C0, "Member 'UWBP_Mission_PlayerListEntry_C::StatusMIA' has a wrong offset!");
static_assert(offsetof(UWBP_Mission_PlayerListEntry_C, StatusKIA) == 0x0002D8, "Member 'UWBP_Mission_PlayerListEntry_C::StatusKIA' has a wrong offset!");
static_assert(offsetof(UWBP_Mission_PlayerListEntry_C, StatusWIA) == 0x0002F0, "Member 'UWBP_Mission_PlayerListEntry_C::StatusWIA' has a wrong offset!");
static_assert(offsetof(UWBP_Mission_PlayerListEntry_C, StatusOK) == 0x000308, "Member 'UWBP_Mission_PlayerListEntry_C::StatusOK' has a wrong offset!");

}

