#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CampaignMissionListEntry

#include "Basic.hpp"

#include "ModKit_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_CampaignMissionListEntry.WBP_CampaignMissionListEntry_C.Get_CheckBox_WholeItem_ToolTipWidget_0
// 0x0010 (0x0010 - 0x0000)
struct WBP_CampaignMissionListEntry_C_Get_CheckBox_WholeItem_ToolTipWidget_0 final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Tooltip_WorldMap_C*                CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CampaignMissionListEntry_C_Get_CheckBox_WholeItem_ToolTipWidget_0) == 0x000008, "Wrong alignment on WBP_CampaignMissionListEntry_C_Get_CheckBox_WholeItem_ToolTipWidget_0");
static_assert(sizeof(WBP_CampaignMissionListEntry_C_Get_CheckBox_WholeItem_ToolTipWidget_0) == 0x000010, "Wrong size on WBP_CampaignMissionListEntry_C_Get_CheckBox_WholeItem_ToolTipWidget_0");
static_assert(offsetof(WBP_CampaignMissionListEntry_C_Get_CheckBox_WholeItem_ToolTipWidget_0, ReturnValue) == 0x000000, "Member 'WBP_CampaignMissionListEntry_C_Get_CheckBox_WholeItem_ToolTipWidget_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMissionListEntry_C_Get_CheckBox_WholeItem_ToolTipWidget_0, CallFunc_Create_ReturnValue) == 0x000008, "Member 'WBP_CampaignMissionListEntry_C_Get_CheckBox_WholeItem_ToolTipWidget_0::CallFunc_Create_ReturnValue' has a wrong offset!");

// Function WBP_CampaignMissionListEntry.WBP_CampaignMissionListEntry_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_CampaignMissionListEntry_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_CampaignMissionListEntry_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_CampaignMissionListEntry_C_PreConstruct");
static_assert(sizeof(WBP_CampaignMissionListEntry_C_PreConstruct) == 0x000001, "Wrong size on WBP_CampaignMissionListEntry_C_PreConstruct");
static_assert(offsetof(WBP_CampaignMissionListEntry_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_CampaignMissionListEntry_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_CampaignMissionListEntry.WBP_CampaignMissionListEntry_C.BndEvt__WBP_HotspotListEntry_CheckBox_WholeItem_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_CampaignMissionListEntry_C_BndEvt__WBP_HotspotListEntry_CheckBox_WholeItem_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_CampaignMissionListEntry_C_BndEvt__WBP_HotspotListEntry_CheckBox_WholeItem_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on WBP_CampaignMissionListEntry_C_BndEvt__WBP_HotspotListEntry_CheckBox_WholeItem_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(sizeof(WBP_CampaignMissionListEntry_C_BndEvt__WBP_HotspotListEntry_CheckBox_WholeItem_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong size on WBP_CampaignMissionListEntry_C_BndEvt__WBP_HotspotListEntry_CheckBox_WholeItem_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(offsetof(WBP_CampaignMissionListEntry_C_BndEvt__WBP_HotspotListEntry_CheckBox_WholeItem_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature, bIsChecked) == 0x000000, "Member 'WBP_CampaignMissionListEntry_C_BndEvt__WBP_HotspotListEntry_CheckBox_WholeItem_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature::bIsChecked' has a wrong offset!");

// Function WBP_CampaignMissionListEntry.WBP_CampaignMissionListEntry_C.ExecuteUbergraph_WBP_CampaignMissionListEntry
// 0x0170 (0x0170 - 0x0000)
struct WBP_CampaignMissionListEntry_C_ExecuteUbergraph_WBP_CampaignMissionListEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsChecked;             // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetTimeSeconds_ReturnValue;               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTimeSeconds_ReturnValue_1;             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDoubleClickTime_ReturnValue;           // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0020(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0038(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x0078(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0090(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00D0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00E0(0x0018)()
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_InitStringTable_ReturnValue;              // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUInt64                                CallFunc_MakeModIDForGame_ReturnValue;             // 0x0110(0x0008)(NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetCampaignMissionNameToken_ReturnValue;  // 0x0118(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetStringTableEntryOrDisplayString_ReturnValue; // 0x0128(0x0018)()
	class FString                                 CallFunc_GetCampaignMissionTypeToken_ReturnValue;  // 0x0140(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FUInt64                                CallFunc_MakeModIDForGame_ReturnValue_1;           // 0x0150(0x0008)(NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetStringTableEntryOrDisplayString_ReturnValue_1; // 0x0158(0x0018)()
};
static_assert(alignof(WBP_CampaignMissionListEntry_C_ExecuteUbergraph_WBP_CampaignMissionListEntry) == 0x000008, "Wrong alignment on WBP_CampaignMissionListEntry_C_ExecuteUbergraph_WBP_CampaignMissionListEntry");
static_assert(sizeof(WBP_CampaignMissionListEntry_C_ExecuteUbergraph_WBP_CampaignMissionListEntry) == 0x000170, "Wrong size on WBP_CampaignMissionListEntry_C_ExecuteUbergraph_WBP_CampaignMissionListEntry");
static_assert(offsetof(WBP_CampaignMissionListEntry_C_ExecuteUbergraph_WBP_CampaignMissionListEntry, EntryPoint) == 0x000000, "Member 'WBP_CampaignMissionListEntry_C_ExecuteUbergraph_WBP_CampaignMissionListEntry::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMissionListEntry_C_ExecuteUbergraph_WBP_CampaignMissionListEntry, Temp_bool_Variable) == 0x000004, "Member 'WBP_CampaignMissionListEntry_C_ExecuteUbergraph_WBP_CampaignMissionListEntry::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMissionListEntry_C_ExecuteUbergraph_WBP_CampaignMissionListEntry, Temp_byte_Variable) == 0x000005, "Member 'WBP_CampaignMissionListEntry_C_ExecuteUbergraph_WBP_CampaignMissionListEntry::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMissionListEntry_C_ExecuteUbergraph_WBP_CampaignMissionListEntry, Temp_byte_Variable_1) == 0x000006, "Member 'WBP_CampaignMissionListEntry_C_ExecuteUbergraph_WBP_CampaignMissionListEntry::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMissionListEntry_C_ExecuteUbergraph_WBP_CampaignMissionListEntry, K2Node_Event_IsDesignTime) == 0x000007, "Member 'WBP_CampaignMissionListEntry_C_ExecuteUbergraph_WBP_CampaignMissionListEntry::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMissionListEntry_C_ExecuteUbergraph_WBP_CampaignMissionListEntry, K2Node_Select_Default) == 0x000008, "Member 'WBP_CampaignMissionListEntry_C_ExecuteUbergraph_WBP_CampaignMissionListEntry::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMissionListEntry_C_ExecuteUbergraph_WBP_CampaignMissionListEntry, K2Node_ComponentBoundEvent_bIsChecked) == 0x000009, "Member 'WBP_CampaignMissionListEntry_C_ExecuteUbergraph_WBP_CampaignMissionListEntry::K2Node_ComponentBoundEvent_bIsChecked' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMissionListEntry_C_ExecuteUbergraph_WBP_CampaignMissionListEntry, CallFunc_GetTimeSeconds_ReturnValue) == 0x00000C, "Member 'WBP_CampaignMissionListEntry_C_ExecuteUbergraph_WBP_CampaignMissionListEntry::CallFunc_GetTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMissionListEntry_C_ExecuteUbergraph_WBP_CampaignMissionListEntry, CallFunc_GetTimeSeconds_ReturnValue_1) == 0x000010, "Member 'WBP_CampaignMissionListEntry_C_ExecuteUbergraph_WBP_CampaignMissionListEntry::CallFunc_GetTimeSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMissionListEntry_C_ExecuteUbergraph_WBP_CampaignMissionListEntry, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000014, "Member 'WBP_CampaignMissionListEntry_C_ExecuteUbergraph_WBP_CampaignMissionListEntry::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMissionListEntry_C_ExecuteUbergraph_WBP_CampaignMissionListEntry, CallFunc_GetDoubleClickTime_ReturnValue) == 0x000018, "Member 'WBP_CampaignMissionListEntry_C_ExecuteUbergraph_WBP_CampaignMissionListEntry::CallFunc_GetDoubleClickTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMissionListEntry_C_ExecuteUbergraph_WBP_CampaignMissionListEntry, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00001C, "Member 'WBP_CampaignMissionListEntry_C_ExecuteUbergraph_WBP_CampaignMissionListEntry::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMissionListEntry_C_ExecuteUbergraph_WBP_CampaignMissionListEntry, CallFunc_Conv_IntToText_ReturnValue) == 0x000020, "Member 'WBP_CampaignMissionListEntry_C_ExecuteUbergraph_WBP_CampaignMissionListEntry::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMissionListEntry_C_ExecuteUbergraph_WBP_CampaignMissionListEntry, K2Node_MakeStruct_FormatArgumentData) == 0x000038, "Member 'WBP_CampaignMissionListEntry_C_ExecuteUbergraph_WBP_CampaignMissionListEntry::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMissionListEntry_C_ExecuteUbergraph_WBP_CampaignMissionListEntry, CallFunc_TextToUpper_ReturnValue) == 0x000078, "Member 'WBP_CampaignMissionListEntry_C_ExecuteUbergraph_WBP_CampaignMissionListEntry::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMissionListEntry_C_ExecuteUbergraph_WBP_CampaignMissionListEntry, K2Node_MakeStruct_FormatArgumentData_1) == 0x000090, "Member 'WBP_CampaignMissionListEntry_C_ExecuteUbergraph_WBP_CampaignMissionListEntry::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMissionListEntry_C_ExecuteUbergraph_WBP_CampaignMissionListEntry, K2Node_MakeArray_Array) == 0x0000D0, "Member 'WBP_CampaignMissionListEntry_C_ExecuteUbergraph_WBP_CampaignMissionListEntry::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMissionListEntry_C_ExecuteUbergraph_WBP_CampaignMissionListEntry, CallFunc_Format_ReturnValue) == 0x0000E0, "Member 'WBP_CampaignMissionListEntry_C_ExecuteUbergraph_WBP_CampaignMissionListEntry::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMissionListEntry_C_ExecuteUbergraph_WBP_CampaignMissionListEntry, CallFunc_Conv_NameToString_ReturnValue) == 0x0000F8, "Member 'WBP_CampaignMissionListEntry_C_ExecuteUbergraph_WBP_CampaignMissionListEntry::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMissionListEntry_C_ExecuteUbergraph_WBP_CampaignMissionListEntry, CallFunc_InitStringTable_ReturnValue) == 0x000108, "Member 'WBP_CampaignMissionListEntry_C_ExecuteUbergraph_WBP_CampaignMissionListEntry::CallFunc_InitStringTable_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMissionListEntry_C_ExecuteUbergraph_WBP_CampaignMissionListEntry, CallFunc_MakeModIDForGame_ReturnValue) == 0x000110, "Member 'WBP_CampaignMissionListEntry_C_ExecuteUbergraph_WBP_CampaignMissionListEntry::CallFunc_MakeModIDForGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMissionListEntry_C_ExecuteUbergraph_WBP_CampaignMissionListEntry, CallFunc_GetCampaignMissionNameToken_ReturnValue) == 0x000118, "Member 'WBP_CampaignMissionListEntry_C_ExecuteUbergraph_WBP_CampaignMissionListEntry::CallFunc_GetCampaignMissionNameToken_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMissionListEntry_C_ExecuteUbergraph_WBP_CampaignMissionListEntry, CallFunc_GetStringTableEntryOrDisplayString_ReturnValue) == 0x000128, "Member 'WBP_CampaignMissionListEntry_C_ExecuteUbergraph_WBP_CampaignMissionListEntry::CallFunc_GetStringTableEntryOrDisplayString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMissionListEntry_C_ExecuteUbergraph_WBP_CampaignMissionListEntry, CallFunc_GetCampaignMissionTypeToken_ReturnValue) == 0x000140, "Member 'WBP_CampaignMissionListEntry_C_ExecuteUbergraph_WBP_CampaignMissionListEntry::CallFunc_GetCampaignMissionTypeToken_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMissionListEntry_C_ExecuteUbergraph_WBP_CampaignMissionListEntry, CallFunc_MakeModIDForGame_ReturnValue_1) == 0x000150, "Member 'WBP_CampaignMissionListEntry_C_ExecuteUbergraph_WBP_CampaignMissionListEntry::CallFunc_MakeModIDForGame_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMissionListEntry_C_ExecuteUbergraph_WBP_CampaignMissionListEntry, CallFunc_GetStringTableEntryOrDisplayString_ReturnValue_1) == 0x000158, "Member 'WBP_CampaignMissionListEntry_C_ExecuteUbergraph_WBP_CampaignMissionListEntry::CallFunc_GetStringTableEntryOrDisplayString_ReturnValue_1' has a wrong offset!");

}

