#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CampaignMissionObjectives

#include "Basic.hpp"

#include "GroundBranch_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_CampaignMissionObjectives.WBP_CampaignMissionObjectives_C.SetObjectiveData
// 0x0030 (0x0030 - 0x0000)
struct WBP_CampaignMissionObjectives_C_SetObjectiveData final
{
public:
	struct FGBObjectiveData                       InObjectiveData;                                   // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FName                                   InHotspotCodename;                                 // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InMissionSequenceNumber;                           // 0x0028(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CampaignMissionObjectives_C_SetObjectiveData) == 0x000008, "Wrong alignment on WBP_CampaignMissionObjectives_C_SetObjectiveData");
static_assert(sizeof(WBP_CampaignMissionObjectives_C_SetObjectiveData) == 0x000030, "Wrong size on WBP_CampaignMissionObjectives_C_SetObjectiveData");
static_assert(offsetof(WBP_CampaignMissionObjectives_C_SetObjectiveData, InObjectiveData) == 0x000000, "Member 'WBP_CampaignMissionObjectives_C_SetObjectiveData::InObjectiveData' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMissionObjectives_C_SetObjectiveData, InHotspotCodename) == 0x000020, "Member 'WBP_CampaignMissionObjectives_C_SetObjectiveData::InHotspotCodename' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMissionObjectives_C_SetObjectiveData, InMissionSequenceNumber) == 0x000028, "Member 'WBP_CampaignMissionObjectives_C_SetObjectiveData::InMissionSequenceNumber' has a wrong offset!");

// Function WBP_CampaignMissionObjectives.WBP_CampaignMissionObjectives_C.ExecuteUbergraph_WBP_CampaignMissionObjectives
// 0x0100 (0x0100 - 0x0000)
struct WBP_CampaignMissionObjectives_C_ExecuteUbergraph_WBP_CampaignMissionObjectives final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CampaignMissionBulletPointEntry_C* CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CampaignMissionBulletPointEntry_C* CallFunc_Create_ReturnValue_1;                     // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGBObjectiveData                       K2Node_CustomEvent_InObjectiveData;                // 0x0030(0x0020)()
	class FName                                   K2Node_CustomEvent_InHotspotCodename;              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_InMissionSequenceNumber;        // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGBSingleObjectiveData                 CallFunc_Array_Get_Item;                           // 0x0060(0x0030)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGBSingleObjectiveData                 CallFunc_Array_Get_Item_1;                         // 0x00A0(0x0030)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DD[0x3];                                       // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue_1;                   // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CampaignMissionObjectives_C_ExecuteUbergraph_WBP_CampaignMissionObjectives) == 0x000008, "Wrong alignment on WBP_CampaignMissionObjectives_C_ExecuteUbergraph_WBP_CampaignMissionObjectives");
static_assert(sizeof(WBP_CampaignMissionObjectives_C_ExecuteUbergraph_WBP_CampaignMissionObjectives) == 0x000100, "Wrong size on WBP_CampaignMissionObjectives_C_ExecuteUbergraph_WBP_CampaignMissionObjectives");
static_assert(offsetof(WBP_CampaignMissionObjectives_C_ExecuteUbergraph_WBP_CampaignMissionObjectives, EntryPoint) == 0x000000, "Member 'WBP_CampaignMissionObjectives_C_ExecuteUbergraph_WBP_CampaignMissionObjectives::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMissionObjectives_C_ExecuteUbergraph_WBP_CampaignMissionObjectives, Temp_byte_Variable) == 0x000004, "Member 'WBP_CampaignMissionObjectives_C_ExecuteUbergraph_WBP_CampaignMissionObjectives::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMissionObjectives_C_ExecuteUbergraph_WBP_CampaignMissionObjectives, CallFunc_Create_ReturnValue) == 0x000008, "Member 'WBP_CampaignMissionObjectives_C_ExecuteUbergraph_WBP_CampaignMissionObjectives::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMissionObjectives_C_ExecuteUbergraph_WBP_CampaignMissionObjectives, Temp_int_Array_Index_Variable) == 0x000010, "Member 'WBP_CampaignMissionObjectives_C_ExecuteUbergraph_WBP_CampaignMissionObjectives::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMissionObjectives_C_ExecuteUbergraph_WBP_CampaignMissionObjectives, CallFunc_Create_ReturnValue_1) == 0x000018, "Member 'WBP_CampaignMissionObjectives_C_ExecuteUbergraph_WBP_CampaignMissionObjectives::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMissionObjectives_C_ExecuteUbergraph_WBP_CampaignMissionObjectives, Temp_bool_Variable) == 0x000020, "Member 'WBP_CampaignMissionObjectives_C_ExecuteUbergraph_WBP_CampaignMissionObjectives::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMissionObjectives_C_ExecuteUbergraph_WBP_CampaignMissionObjectives, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'WBP_CampaignMissionObjectives_C_ExecuteUbergraph_WBP_CampaignMissionObjectives::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMissionObjectives_C_ExecuteUbergraph_WBP_CampaignMissionObjectives, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'WBP_CampaignMissionObjectives_C_ExecuteUbergraph_WBP_CampaignMissionObjectives::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMissionObjectives_C_ExecuteUbergraph_WBP_CampaignMissionObjectives, Temp_int_Array_Index_Variable_1) == 0x00002C, "Member 'WBP_CampaignMissionObjectives_C_ExecuteUbergraph_WBP_CampaignMissionObjectives::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMissionObjectives_C_ExecuteUbergraph_WBP_CampaignMissionObjectives, K2Node_CustomEvent_InObjectiveData) == 0x000030, "Member 'WBP_CampaignMissionObjectives_C_ExecuteUbergraph_WBP_CampaignMissionObjectives::K2Node_CustomEvent_InObjectiveData' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMissionObjectives_C_ExecuteUbergraph_WBP_CampaignMissionObjectives, K2Node_CustomEvent_InHotspotCodename) == 0x000050, "Member 'WBP_CampaignMissionObjectives_C_ExecuteUbergraph_WBP_CampaignMissionObjectives::K2Node_CustomEvent_InHotspotCodename' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMissionObjectives_C_ExecuteUbergraph_WBP_CampaignMissionObjectives, K2Node_CustomEvent_InMissionSequenceNumber) == 0x000058, "Member 'WBP_CampaignMissionObjectives_C_ExecuteUbergraph_WBP_CampaignMissionObjectives::K2Node_CustomEvent_InMissionSequenceNumber' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMissionObjectives_C_ExecuteUbergraph_WBP_CampaignMissionObjectives, Temp_int_Loop_Counter_Variable_1) == 0x00005C, "Member 'WBP_CampaignMissionObjectives_C_ExecuteUbergraph_WBP_CampaignMissionObjectives::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMissionObjectives_C_ExecuteUbergraph_WBP_CampaignMissionObjectives, CallFunc_Array_Get_Item) == 0x000060, "Member 'WBP_CampaignMissionObjectives_C_ExecuteUbergraph_WBP_CampaignMissionObjectives::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMissionObjectives_C_ExecuteUbergraph_WBP_CampaignMissionObjectives, CallFunc_Array_Length_ReturnValue) == 0x000090, "Member 'WBP_CampaignMissionObjectives_C_ExecuteUbergraph_WBP_CampaignMissionObjectives::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMissionObjectives_C_ExecuteUbergraph_WBP_CampaignMissionObjectives, CallFunc_Less_IntInt_ReturnValue) == 0x000094, "Member 'WBP_CampaignMissionObjectives_C_ExecuteUbergraph_WBP_CampaignMissionObjectives::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMissionObjectives_C_ExecuteUbergraph_WBP_CampaignMissionObjectives, CallFunc_Array_Length_ReturnValue_1) == 0x000098, "Member 'WBP_CampaignMissionObjectives_C_ExecuteUbergraph_WBP_CampaignMissionObjectives::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMissionObjectives_C_ExecuteUbergraph_WBP_CampaignMissionObjectives, CallFunc_Array_Get_Item_1) == 0x0000A0, "Member 'WBP_CampaignMissionObjectives_C_ExecuteUbergraph_WBP_CampaignMissionObjectives::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMissionObjectives_C_ExecuteUbergraph_WBP_CampaignMissionObjectives, CallFunc_Greater_IntInt_ReturnValue) == 0x0000D0, "Member 'WBP_CampaignMissionObjectives_C_ExecuteUbergraph_WBP_CampaignMissionObjectives::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMissionObjectives_C_ExecuteUbergraph_WBP_CampaignMissionObjectives, CallFunc_Array_Length_ReturnValue_2) == 0x0000D4, "Member 'WBP_CampaignMissionObjectives_C_ExecuteUbergraph_WBP_CampaignMissionObjectives::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMissionObjectives_C_ExecuteUbergraph_WBP_CampaignMissionObjectives, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000D8, "Member 'WBP_CampaignMissionObjectives_C_ExecuteUbergraph_WBP_CampaignMissionObjectives::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMissionObjectives_C_ExecuteUbergraph_WBP_CampaignMissionObjectives, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000DC, "Member 'WBP_CampaignMissionObjectives_C_ExecuteUbergraph_WBP_CampaignMissionObjectives::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMissionObjectives_C_ExecuteUbergraph_WBP_CampaignMissionObjectives, CallFunc_AddChild_ReturnValue) == 0x0000E0, "Member 'WBP_CampaignMissionObjectives_C_ExecuteUbergraph_WBP_CampaignMissionObjectives::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMissionObjectives_C_ExecuteUbergraph_WBP_CampaignMissionObjectives, Temp_byte_Variable_1) == 0x0000E8, "Member 'WBP_CampaignMissionObjectives_C_ExecuteUbergraph_WBP_CampaignMissionObjectives::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMissionObjectives_C_ExecuteUbergraph_WBP_CampaignMissionObjectives, CallFunc_AddChild_ReturnValue_1) == 0x0000F0, "Member 'WBP_CampaignMissionObjectives_C_ExecuteUbergraph_WBP_CampaignMissionObjectives::CallFunc_AddChild_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CampaignMissionObjectives_C_ExecuteUbergraph_WBP_CampaignMissionObjectives, K2Node_Select_Default) == 0x0000F8, "Member 'WBP_CampaignMissionObjectives_C_ExecuteUbergraph_WBP_CampaignMissionObjectives::K2Node_Select_Default' has a wrong offset!");

}

