#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CampaignTextBox

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_CampaignTextBox.WBP_CampaignTextBox_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_CampaignTextBox_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_CampaignTextBox_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_CampaignTextBox_C_PreConstruct");
static_assert(sizeof(WBP_CampaignTextBox_C_PreConstruct) == 0x000001, "Wrong size on WBP_CampaignTextBox_C_PreConstruct");
static_assert(offsetof(WBP_CampaignTextBox_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_CampaignTextBox_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_CampaignTextBox.WBP_CampaignTextBox_C.AddChildItem
// 0x0008 (0x0008 - 0x0000)
struct WBP_CampaignTextBox_C_AddChildItem final
{
public:
	class UUserWidget*                            Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CampaignTextBox_C_AddChildItem) == 0x000008, "Wrong alignment on WBP_CampaignTextBox_C_AddChildItem");
static_assert(sizeof(WBP_CampaignTextBox_C_AddChildItem) == 0x000008, "Wrong size on WBP_CampaignTextBox_C_AddChildItem");
static_assert(offsetof(WBP_CampaignTextBox_C_AddChildItem, Widget) == 0x000000, "Member 'WBP_CampaignTextBox_C_AddChildItem::Widget' has a wrong offset!");

// Function WBP_CampaignTextBox.WBP_CampaignTextBox_C.ClearChildItems
// 0x0001 (0x0001 - 0x0000)
struct WBP_CampaignTextBox_C_ClearChildItems final
{
public:
	bool                                          bCloseWindowImmediately;                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_CampaignTextBox_C_ClearChildItems) == 0x000001, "Wrong alignment on WBP_CampaignTextBox_C_ClearChildItems");
static_assert(sizeof(WBP_CampaignTextBox_C_ClearChildItems) == 0x000001, "Wrong size on WBP_CampaignTextBox_C_ClearChildItems");
static_assert(offsetof(WBP_CampaignTextBox_C_ClearChildItems, bCloseWindowImmediately) == 0x000000, "Member 'WBP_CampaignTextBox_C_ClearChildItems::bCloseWindowImmediately' has a wrong offset!");

// Function WBP_CampaignTextBox.WBP_CampaignTextBox_C.SetBoxTitle
// 0x0018 (0x0018 - 0x0000)
struct WBP_CampaignTextBox_C_SetBoxTitle final
{
public:
	class FText                                   NewBoxTitle;                                       // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_CampaignTextBox_C_SetBoxTitle) == 0x000008, "Wrong alignment on WBP_CampaignTextBox_C_SetBoxTitle");
static_assert(sizeof(WBP_CampaignTextBox_C_SetBoxTitle) == 0x000018, "Wrong size on WBP_CampaignTextBox_C_SetBoxTitle");
static_assert(offsetof(WBP_CampaignTextBox_C_SetBoxTitle, NewBoxTitle) == 0x000000, "Member 'WBP_CampaignTextBox_C_SetBoxTitle::NewBoxTitle' has a wrong offset!");

// Function WBP_CampaignTextBox.WBP_CampaignTextBox_C.ExecuteUbergraph_WBP_CampaignTextBox
// 0x0058 (0x0058 - 0x0000)
struct WBP_CampaignTextBox_C_ExecuteUbergraph_WBP_CampaignTextBox final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_NewBoxTitle;                    // 0x0008(0x0018)()
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            K2Node_CustomEvent_Widget;                         // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bCloseWindowImmediately;        // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_CampaignTextBox_C_ExecuteUbergraph_WBP_CampaignTextBox) == 0x000008, "Wrong alignment on WBP_CampaignTextBox_C_ExecuteUbergraph_WBP_CampaignTextBox");
static_assert(sizeof(WBP_CampaignTextBox_C_ExecuteUbergraph_WBP_CampaignTextBox) == 0x000058, "Wrong size on WBP_CampaignTextBox_C_ExecuteUbergraph_WBP_CampaignTextBox");
static_assert(offsetof(WBP_CampaignTextBox_C_ExecuteUbergraph_WBP_CampaignTextBox, EntryPoint) == 0x000000, "Member 'WBP_CampaignTextBox_C_ExecuteUbergraph_WBP_CampaignTextBox::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CampaignTextBox_C_ExecuteUbergraph_WBP_CampaignTextBox, K2Node_CustomEvent_NewBoxTitle) == 0x000008, "Member 'WBP_CampaignTextBox_C_ExecuteUbergraph_WBP_CampaignTextBox::K2Node_CustomEvent_NewBoxTitle' has a wrong offset!");
static_assert(offsetof(WBP_CampaignTextBox_C_ExecuteUbergraph_WBP_CampaignTextBox, K2Node_Event_IsDesignTime) == 0x000020, "Member 'WBP_CampaignTextBox_C_ExecuteUbergraph_WBP_CampaignTextBox::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_CampaignTextBox_C_ExecuteUbergraph_WBP_CampaignTextBox, K2Node_CustomEvent_Widget) == 0x000028, "Member 'WBP_CampaignTextBox_C_ExecuteUbergraph_WBP_CampaignTextBox::K2Node_CustomEvent_Widget' has a wrong offset!");
static_assert(offsetof(WBP_CampaignTextBox_C_ExecuteUbergraph_WBP_CampaignTextBox, K2Node_CustomEvent_bCloseWindowImmediately) == 0x000030, "Member 'WBP_CampaignTextBox_C_ExecuteUbergraph_WBP_CampaignTextBox::K2Node_CustomEvent_bCloseWindowImmediately' has a wrong offset!");
static_assert(offsetof(WBP_CampaignTextBox_C_ExecuteUbergraph_WBP_CampaignTextBox, CallFunc_Not_PreBool_ReturnValue) == 0x000031, "Member 'WBP_CampaignTextBox_C_ExecuteUbergraph_WBP_CampaignTextBox::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CampaignTextBox_C_ExecuteUbergraph_WBP_CampaignTextBox, CallFunc_AddChild_ReturnValue) == 0x000038, "Member 'WBP_CampaignTextBox_C_ExecuteUbergraph_WBP_CampaignTextBox::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CampaignTextBox_C_ExecuteUbergraph_WBP_CampaignTextBox, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000040, "Member 'WBP_CampaignTextBox_C_ExecuteUbergraph_WBP_CampaignTextBox::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CampaignTextBox_C_ExecuteUbergraph_WBP_CampaignTextBox, CallFunc_PlayAnimationForward_ReturnValue) == 0x000048, "Member 'WBP_CampaignTextBox_C_ExecuteUbergraph_WBP_CampaignTextBox::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CampaignTextBox_C_ExecuteUbergraph_WBP_CampaignTextBox, CallFunc_Not_PreBool_ReturnValue_1) == 0x000050, "Member 'WBP_CampaignTextBox_C_ExecuteUbergraph_WBP_CampaignTextBox::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");

}

