#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Mission_Objectives

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "GroundBranch_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Mission_Objectives.WBP_Mission_Objectives_C
// 0x0070 (0x02D0 - 0x0260)
class UWBP_Mission_Objectives_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVerticalBox*                           PrimaryObjectiveList;                              // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           SecondaryObjectiveList;                            // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_PrimaryObjectives;                       // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_SecondaryObjectives;                     // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_PrimaryObjectives;                     // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_SecondaryObjectives;                   // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint8                                         TeamId;                                            // 0x0298(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_299[0x7];                                      // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         CompletedObjectives;                               // 0x02A0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bIsCampaignMission;                                // 0x02B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B1[0x3];                                      // 0x02B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   MissionActorTag;                                   // 0x02B4(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BC[0x4];                                      // 0x02BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           NamesOfCompletedCampaignMissionObjectives;         // 0x02C0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void Construct();
	void UpdateVisibilityOfObjectiveLists();
	void AddCampaignMissionObjectives(const TArray<class AGBMissionObjective*>& ObjectiveList, const bool bIsPrimary);
	void OnInitialized();
	void ExecuteUbergraph_WBP_Mission_Objectives(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Mission_Objectives_C">();
	}
	static class UWBP_Mission_Objectives_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Mission_Objectives_C>();
	}
};
static_assert(alignof(UWBP_Mission_Objectives_C) == 0x000008, "Wrong alignment on UWBP_Mission_Objectives_C");
static_assert(sizeof(UWBP_Mission_Objectives_C) == 0x0002D0, "Wrong size on UWBP_Mission_Objectives_C");
static_assert(offsetof(UWBP_Mission_Objectives_C, UberGraphFrame) == 0x000260, "Member 'UWBP_Mission_Objectives_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Mission_Objectives_C, PrimaryObjectiveList) == 0x000268, "Member 'UWBP_Mission_Objectives_C::PrimaryObjectiveList' has a wrong offset!");
static_assert(offsetof(UWBP_Mission_Objectives_C, SecondaryObjectiveList) == 0x000270, "Member 'UWBP_Mission_Objectives_C::SecondaryObjectiveList' has a wrong offset!");
static_assert(offsetof(UWBP_Mission_Objectives_C, TextBlock_PrimaryObjectives) == 0x000278, "Member 'UWBP_Mission_Objectives_C::TextBlock_PrimaryObjectives' has a wrong offset!");
static_assert(offsetof(UWBP_Mission_Objectives_C, TextBlock_SecondaryObjectives) == 0x000280, "Member 'UWBP_Mission_Objectives_C::TextBlock_SecondaryObjectives' has a wrong offset!");
static_assert(offsetof(UWBP_Mission_Objectives_C, VerticalBox_PrimaryObjectives) == 0x000288, "Member 'UWBP_Mission_Objectives_C::VerticalBox_PrimaryObjectives' has a wrong offset!");
static_assert(offsetof(UWBP_Mission_Objectives_C, VerticalBox_SecondaryObjectives) == 0x000290, "Member 'UWBP_Mission_Objectives_C::VerticalBox_SecondaryObjectives' has a wrong offset!");
static_assert(offsetof(UWBP_Mission_Objectives_C, TeamId) == 0x000298, "Member 'UWBP_Mission_Objectives_C::TeamId' has a wrong offset!");
static_assert(offsetof(UWBP_Mission_Objectives_C, CompletedObjectives) == 0x0002A0, "Member 'UWBP_Mission_Objectives_C::CompletedObjectives' has a wrong offset!");
static_assert(offsetof(UWBP_Mission_Objectives_C, bIsCampaignMission) == 0x0002B0, "Member 'UWBP_Mission_Objectives_C::bIsCampaignMission' has a wrong offset!");
static_assert(offsetof(UWBP_Mission_Objectives_C, MissionActorTag) == 0x0002B4, "Member 'UWBP_Mission_Objectives_C::MissionActorTag' has a wrong offset!");
static_assert(offsetof(UWBP_Mission_Objectives_C, NamesOfCompletedCampaignMissionObjectives) == 0x0002C0, "Member 'UWBP_Mission_Objectives_C::NamesOfCompletedCampaignMissionObjectives' has a wrong offset!");

}

