#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UserMenuManager

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FUserMenuData_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Slate_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UserMenuManager.WBP_UserMenuManager_C
// 0x0098 (0x02F8 - 0x0260)
class UWBP_UserMenuManager_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCanvasPanel*                           CanvasPanel_0;                                     // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<struct FFUserMenuData>                 UserMenus;                                         // 0x0270(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FString>                         UserMenuCommands;                                  // 0x0280(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FAnchors                               LinearMenuAnchors;                                 // 0x0290(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FVector2D                              LinearMenuPosition;                                // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnchors                               RadialMenuAnchors;                                 // 0x02A8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FVector2D                              RadialMenuPosition;                                // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                RadialMenuOffsets;                                 // 0x02C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UWBP_RadialMenu_C*                      RadialMenu;                                        // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   MenuType;                                          // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 LastOpenMenu;                                      // 0x02E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FVector2D                              RadialMenuAlignment;                               // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_UserMenuManager(int32 EntryPoint);
	void ForceClosed();
	void OnSelected_Event(int32 Index_0);
	void BuildRadialMenu(const struct FFUserMenuData& UserMenu);
	void OnSelected_Event_0(int32 Index_0);
	void BuildLinearMenu(const struct FFUserMenuData& UserMenu);
	void BuildMenu(const struct FFUserMenuData& UserMenu);
	void Open(const class FString& MenuName, class FName MenuType_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UserMenuManager_C">();
	}
	static class UWBP_UserMenuManager_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UserMenuManager_C>();
	}
};
static_assert(alignof(UWBP_UserMenuManager_C) == 0x000008, "Wrong alignment on UWBP_UserMenuManager_C");
static_assert(sizeof(UWBP_UserMenuManager_C) == 0x0002F8, "Wrong size on UWBP_UserMenuManager_C");
static_assert(offsetof(UWBP_UserMenuManager_C, UberGraphFrame) == 0x000260, "Member 'UWBP_UserMenuManager_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UserMenuManager_C, CanvasPanel_0) == 0x000268, "Member 'UWBP_UserMenuManager_C::CanvasPanel_0' has a wrong offset!");
static_assert(offsetof(UWBP_UserMenuManager_C, UserMenus) == 0x000270, "Member 'UWBP_UserMenuManager_C::UserMenus' has a wrong offset!");
static_assert(offsetof(UWBP_UserMenuManager_C, UserMenuCommands) == 0x000280, "Member 'UWBP_UserMenuManager_C::UserMenuCommands' has a wrong offset!");
static_assert(offsetof(UWBP_UserMenuManager_C, LinearMenuAnchors) == 0x000290, "Member 'UWBP_UserMenuManager_C::LinearMenuAnchors' has a wrong offset!");
static_assert(offsetof(UWBP_UserMenuManager_C, LinearMenuPosition) == 0x0002A0, "Member 'UWBP_UserMenuManager_C::LinearMenuPosition' has a wrong offset!");
static_assert(offsetof(UWBP_UserMenuManager_C, RadialMenuAnchors) == 0x0002A8, "Member 'UWBP_UserMenuManager_C::RadialMenuAnchors' has a wrong offset!");
static_assert(offsetof(UWBP_UserMenuManager_C, RadialMenuPosition) == 0x0002B8, "Member 'UWBP_UserMenuManager_C::RadialMenuPosition' has a wrong offset!");
static_assert(offsetof(UWBP_UserMenuManager_C, RadialMenuOffsets) == 0x0002C0, "Member 'UWBP_UserMenuManager_C::RadialMenuOffsets' has a wrong offset!");
static_assert(offsetof(UWBP_UserMenuManager_C, RadialMenu) == 0x0002D0, "Member 'UWBP_UserMenuManager_C::RadialMenu' has a wrong offset!");
static_assert(offsetof(UWBP_UserMenuManager_C, MenuType) == 0x0002D8, "Member 'UWBP_UserMenuManager_C::MenuType' has a wrong offset!");
static_assert(offsetof(UWBP_UserMenuManager_C, LastOpenMenu) == 0x0002E0, "Member 'UWBP_UserMenuManager_C::LastOpenMenu' has a wrong offset!");
static_assert(offsetof(UWBP_UserMenuManager_C, RadialMenuAlignment) == 0x0002F0, "Member 'UWBP_UserMenuManager_C::RadialMenuAlignment' has a wrong offset!");

}

