#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Transition

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_Transition.WBP_Transition_C.SetMessageText
// 0x0018 (0x0018 - 0x0000)
struct WBP_Transition_C_SetMessageText final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_Transition_C_SetMessageText) == 0x000008, "Wrong alignment on WBP_Transition_C_SetMessageText");
static_assert(sizeof(WBP_Transition_C_SetMessageText) == 0x000018, "Wrong size on WBP_Transition_C_SetMessageText");
static_assert(offsetof(WBP_Transition_C_SetMessageText, InText) == 0x000000, "Member 'WBP_Transition_C_SetMessageText::InText' has a wrong offset!");

// Function WBP_Transition.WBP_Transition_C.ExecuteUbergraph_WBP_Transition
// 0x00B8 (0x00B8 - 0x0000)
struct WBP_Transition_C_ExecuteUbergraph_WBP_Transition final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWBP_Transition_C*>              CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWBP_Transition_C*                      CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E[0x2];                                       // 0x003E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue_1;       // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_GameState_C*                        K2Node_DynamicCast_AsBP_Game_State;                // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetRoundStage_ReturnValue;                // 0x0074(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_1;        // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_RoundStage_C*                      CallFunc_Create_ReturnValue;                       // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_CustomEvent_InText;                         // 0x0090(0x0018)()
	float                                         Temp_float_Variable;                               // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Transition_C_ExecuteUbergraph_WBP_Transition) == 0x000008, "Wrong alignment on WBP_Transition_C_ExecuteUbergraph_WBP_Transition");
static_assert(sizeof(WBP_Transition_C_ExecuteUbergraph_WBP_Transition) == 0x0000B8, "Wrong size on WBP_Transition_C_ExecuteUbergraph_WBP_Transition");
static_assert(offsetof(WBP_Transition_C_ExecuteUbergraph_WBP_Transition, EntryPoint) == 0x000000, "Member 'WBP_Transition_C_ExecuteUbergraph_WBP_Transition::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Transition_C_ExecuteUbergraph_WBP_Transition, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000004, "Member 'WBP_Transition_C_ExecuteUbergraph_WBP_Transition::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Transition_C_ExecuteUbergraph_WBP_Transition, Temp_int_Array_Index_Variable) == 0x000008, "Member 'WBP_Transition_C_ExecuteUbergraph_WBP_Transition::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Transition_C_ExecuteUbergraph_WBP_Transition, CallFunc_SelectFloat_ReturnValue) == 0x00000C, "Member 'WBP_Transition_C_ExecuteUbergraph_WBP_Transition::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Transition_C_ExecuteUbergraph_WBP_Transition, Temp_bool_Variable) == 0x000010, "Member 'WBP_Transition_C_ExecuteUbergraph_WBP_Transition::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Transition_C_ExecuteUbergraph_WBP_Transition, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x000014, "Member 'WBP_Transition_C_ExecuteUbergraph_WBP_Transition::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Transition_C_ExecuteUbergraph_WBP_Transition, CallFunc_GetAllWidgetsOfClass_FoundWidgets) == 0x000018, "Member 'WBP_Transition_C_ExecuteUbergraph_WBP_Transition::CallFunc_GetAllWidgetsOfClass_FoundWidgets' has a wrong offset!");
static_assert(offsetof(WBP_Transition_C_ExecuteUbergraph_WBP_Transition, CallFunc_Array_Get_Item) == 0x000028, "Member 'WBP_Transition_C_ExecuteUbergraph_WBP_Transition::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Transition_C_ExecuteUbergraph_WBP_Transition, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'WBP_Transition_C_ExecuteUbergraph_WBP_Transition::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Transition_C_ExecuteUbergraph_WBP_Transition, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000034, "Member 'WBP_Transition_C_ExecuteUbergraph_WBP_Transition::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Transition_C_ExecuteUbergraph_WBP_Transition, Temp_int_Loop_Counter_Variable) == 0x000038, "Member 'WBP_Transition_C_ExecuteUbergraph_WBP_Transition::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Transition_C_ExecuteUbergraph_WBP_Transition, K2Node_SwitchName_CmpSuccess) == 0x00003C, "Member 'WBP_Transition_C_ExecuteUbergraph_WBP_Transition::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Transition_C_ExecuteUbergraph_WBP_Transition, CallFunc_Less_IntInt_ReturnValue) == 0x00003D, "Member 'WBP_Transition_C_ExecuteUbergraph_WBP_Transition::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Transition_C_ExecuteUbergraph_WBP_Transition, CallFunc_Add_IntInt_ReturnValue) == 0x000040, "Member 'WBP_Transition_C_ExecuteUbergraph_WBP_Transition::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Transition_C_ExecuteUbergraph_WBP_Transition, CallFunc_GetGameTimeInSeconds_ReturnValue_1) == 0x000044, "Member 'WBP_Transition_C_ExecuteUbergraph_WBP_Transition::CallFunc_GetGameTimeInSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Transition_C_ExecuteUbergraph_WBP_Transition, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000048, "Member 'WBP_Transition_C_ExecuteUbergraph_WBP_Transition::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Transition_C_ExecuteUbergraph_WBP_Transition, CallFunc_Less_FloatFloat_ReturnValue) == 0x00004C, "Member 'WBP_Transition_C_ExecuteUbergraph_WBP_Transition::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Transition_C_ExecuteUbergraph_WBP_Transition, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000050, "Member 'WBP_Transition_C_ExecuteUbergraph_WBP_Transition::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Transition_C_ExecuteUbergraph_WBP_Transition, CallFunc_GetGameState_ReturnValue) == 0x000058, "Member 'WBP_Transition_C_ExecuteUbergraph_WBP_Transition::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Transition_C_ExecuteUbergraph_WBP_Transition, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x000060, "Member 'WBP_Transition_C_ExecuteUbergraph_WBP_Transition::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Transition_C_ExecuteUbergraph_WBP_Transition, K2Node_DynamicCast_AsBP_Game_State) == 0x000068, "Member 'WBP_Transition_C_ExecuteUbergraph_WBP_Transition::K2Node_DynamicCast_AsBP_Game_State' has a wrong offset!");
static_assert(offsetof(WBP_Transition_C_ExecuteUbergraph_WBP_Transition, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'WBP_Transition_C_ExecuteUbergraph_WBP_Transition::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Transition_C_ExecuteUbergraph_WBP_Transition, CallFunc_GetRoundStage_ReturnValue) == 0x000074, "Member 'WBP_Transition_C_ExecuteUbergraph_WBP_Transition::CallFunc_GetRoundStage_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Transition_C_ExecuteUbergraph_WBP_Transition, CallFunc_EqualEqual_NameName_ReturnValue_1) == 0x00007C, "Member 'WBP_Transition_C_ExecuteUbergraph_WBP_Transition::CallFunc_EqualEqual_NameName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Transition_C_ExecuteUbergraph_WBP_Transition, CallFunc_PlayAnimation_ReturnValue) == 0x000080, "Member 'WBP_Transition_C_ExecuteUbergraph_WBP_Transition::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Transition_C_ExecuteUbergraph_WBP_Transition, CallFunc_Create_ReturnValue) == 0x000088, "Member 'WBP_Transition_C_ExecuteUbergraph_WBP_Transition::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Transition_C_ExecuteUbergraph_WBP_Transition, K2Node_CustomEvent_InText) == 0x000090, "Member 'WBP_Transition_C_ExecuteUbergraph_WBP_Transition::K2Node_CustomEvent_InText' has a wrong offset!");
static_assert(offsetof(WBP_Transition_C_ExecuteUbergraph_WBP_Transition, Temp_float_Variable) == 0x0000A8, "Member 'WBP_Transition_C_ExecuteUbergraph_WBP_Transition::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Transition_C_ExecuteUbergraph_WBP_Transition, K2Node_Select_Default) == 0x0000AC, "Member 'WBP_Transition_C_ExecuteUbergraph_WBP_Transition::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Transition_C_ExecuteUbergraph_WBP_Transition, CallFunc_PlayAnimation_ReturnValue_1) == 0x0000B0, "Member 'WBP_Transition_C_ExecuteUbergraph_WBP_Transition::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");

}

