#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_IE_Customisation_Master

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "FGBIECustomisationFilter_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FGBIECustomisationHelper_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_IE_Customisation_Master.WBP_IE_Customisation_Master_C
// 0x0128 (0x0388 - 0x0260)
class UWBP_IE_Customisation_Master_C : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class FName                                   ProfileName;                                       // 0x0268(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class AGBCharacter*                           CharacterRef;                                      // 0x0270(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class AGBInvItem*                             RootItemRef;                                       // 0x0278(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UCanvasPanel*                           FloatingCanvasRef;                                 // 0x0280(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FString                                 MasterSuffix;                                      // 0x0288(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<struct FFGBIECustomisationFilter>      Filters;                                           // 0x0298(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<struct FPrimaryAssetId, struct FFGBIECustomisationHelper> InvItemAssetIdToHelperMap;        // 0x02A8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UGBInvItemDragDropPayload*>      Payloads;                                          // 0x02F8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FName                                   DragDropOperationsTagKey;                          // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   DisplayNameTagKey;                                 // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   IconTagKey;                                        // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   ItemDisplayNameWithSkin;                           // 0x0320(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  ExcludeInvItemTags;                                // 0x0338(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTag                           RootInvItemSkinNameTag;                            // 0x0358(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  RootSubstitudeInvItemSkinNameTags;                 // 0x0360(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTag                           DragDropOperationTag;                              // 0x0380(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_IE_Customisation_Master(int32 EntryPoint);
	void Construct();
	void AddFilter(const struct FGameplayTagContainer& InIncludeTags, const struct FGameplayTag& InParentTypeTag, const struct FGameplayTagContainer& InTypeTags);
	void Filter(const struct FGameplayTagContainer& InInvItemTags, bool* bPassed);
	void GetDragDropOperationTag(const struct FPrimaryAssetId& InInvItemAssetId, TSoftClassPtr<class UClass>* OutDragDropOperation, bool* bOutValid);
	void GetInvItemSkinDisplayName(const struct FPrimaryAssetId& InItemSkinId, class FText* OutDisplayName);
	void IsValidInvItemAssetId(const struct FPrimaryAssetId& InItemAssetId, bool* bOutResult);
	void ShouldGenerateHelper(const struct FPrimaryAssetId& InInvItemAssetId, bool* bResult);
	void GenerateHelper(const struct FPrimaryAssetId& InInvItemAssetId, const struct FGameplayTagContainer& InInvItemTags, const struct FPrimaryAssetId& InInvItemSkinAssetId);
	void Determine_Payloads();
	void MaybeAddInvItem(const struct FPrimaryAssetId& InInvItemAssetId);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_IE_Customisation_Master_C">();
	}
	static class UWBP_IE_Customisation_Master_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_IE_Customisation_Master_C>();
	}
};
static_assert(alignof(UWBP_IE_Customisation_Master_C) == 0x000008, "Wrong alignment on UWBP_IE_Customisation_Master_C");
static_assert(sizeof(UWBP_IE_Customisation_Master_C) == 0x000388, "Wrong size on UWBP_IE_Customisation_Master_C");
static_assert(offsetof(UWBP_IE_Customisation_Master_C, UberGraphFrame) == 0x000260, "Member 'UWBP_IE_Customisation_Master_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_IE_Customisation_Master_C, ProfileName) == 0x000268, "Member 'UWBP_IE_Customisation_Master_C::ProfileName' has a wrong offset!");
static_assert(offsetof(UWBP_IE_Customisation_Master_C, CharacterRef) == 0x000270, "Member 'UWBP_IE_Customisation_Master_C::CharacterRef' has a wrong offset!");
static_assert(offsetof(UWBP_IE_Customisation_Master_C, RootItemRef) == 0x000278, "Member 'UWBP_IE_Customisation_Master_C::RootItemRef' has a wrong offset!");
static_assert(offsetof(UWBP_IE_Customisation_Master_C, FloatingCanvasRef) == 0x000280, "Member 'UWBP_IE_Customisation_Master_C::FloatingCanvasRef' has a wrong offset!");
static_assert(offsetof(UWBP_IE_Customisation_Master_C, MasterSuffix) == 0x000288, "Member 'UWBP_IE_Customisation_Master_C::MasterSuffix' has a wrong offset!");
static_assert(offsetof(UWBP_IE_Customisation_Master_C, Filters) == 0x000298, "Member 'UWBP_IE_Customisation_Master_C::Filters' has a wrong offset!");
static_assert(offsetof(UWBP_IE_Customisation_Master_C, InvItemAssetIdToHelperMap) == 0x0002A8, "Member 'UWBP_IE_Customisation_Master_C::InvItemAssetIdToHelperMap' has a wrong offset!");
static_assert(offsetof(UWBP_IE_Customisation_Master_C, Payloads) == 0x0002F8, "Member 'UWBP_IE_Customisation_Master_C::Payloads' has a wrong offset!");
static_assert(offsetof(UWBP_IE_Customisation_Master_C, DragDropOperationsTagKey) == 0x000308, "Member 'UWBP_IE_Customisation_Master_C::DragDropOperationsTagKey' has a wrong offset!");
static_assert(offsetof(UWBP_IE_Customisation_Master_C, DisplayNameTagKey) == 0x000310, "Member 'UWBP_IE_Customisation_Master_C::DisplayNameTagKey' has a wrong offset!");
static_assert(offsetof(UWBP_IE_Customisation_Master_C, IconTagKey) == 0x000318, "Member 'UWBP_IE_Customisation_Master_C::IconTagKey' has a wrong offset!");
static_assert(offsetof(UWBP_IE_Customisation_Master_C, ItemDisplayNameWithSkin) == 0x000320, "Member 'UWBP_IE_Customisation_Master_C::ItemDisplayNameWithSkin' has a wrong offset!");
static_assert(offsetof(UWBP_IE_Customisation_Master_C, ExcludeInvItemTags) == 0x000338, "Member 'UWBP_IE_Customisation_Master_C::ExcludeInvItemTags' has a wrong offset!");
static_assert(offsetof(UWBP_IE_Customisation_Master_C, RootInvItemSkinNameTag) == 0x000358, "Member 'UWBP_IE_Customisation_Master_C::RootInvItemSkinNameTag' has a wrong offset!");
static_assert(offsetof(UWBP_IE_Customisation_Master_C, RootSubstitudeInvItemSkinNameTags) == 0x000360, "Member 'UWBP_IE_Customisation_Master_C::RootSubstitudeInvItemSkinNameTags' has a wrong offset!");
static_assert(offsetof(UWBP_IE_Customisation_Master_C, DragDropOperationTag) == 0x000380, "Member 'UWBP_IE_Customisation_Master_C::DragDropOperationTag' has a wrong offset!");

}

