#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Mission_ObjectiveEntry

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "ModKit_structs.hpp"


namespace SDK::Params
{

// Function WBP_Mission_ObjectiveEntry.WBP_Mission_ObjectiveEntry_C.ExecuteUbergraph_WBP_Mission_ObjectiveEntry
// 0x0098 (0x0098 - 0x0000)
struct WBP_Mission_ObjectiveEntry_C_ExecuteUbergraph_WBP_Mission_ObjectiveEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGBGameState*                           K2Node_DynamicCast_AsGBGame_State;                 // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUInt64                                CallFunc_GetGameModeModID_ReturnValue;             // 0x0040(0x0008)(NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetLocalisedGameText_ReturnValue;         // 0x0048(0x0018)()
	bool                                          K2Node_CustomEvent_bIsPrimary;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0068(0x0018)()
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x0080(0x0018)()
};
static_assert(alignof(WBP_Mission_ObjectiveEntry_C_ExecuteUbergraph_WBP_Mission_ObjectiveEntry) == 0x000008, "Wrong alignment on WBP_Mission_ObjectiveEntry_C_ExecuteUbergraph_WBP_Mission_ObjectiveEntry");
static_assert(sizeof(WBP_Mission_ObjectiveEntry_C_ExecuteUbergraph_WBP_Mission_ObjectiveEntry) == 0x000098, "Wrong size on WBP_Mission_ObjectiveEntry_C_ExecuteUbergraph_WBP_Mission_ObjectiveEntry");
static_assert(offsetof(WBP_Mission_ObjectiveEntry_C_ExecuteUbergraph_WBP_Mission_ObjectiveEntry, EntryPoint) == 0x000000, "Member 'WBP_Mission_ObjectiveEntry_C_ExecuteUbergraph_WBP_Mission_ObjectiveEntry::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Mission_ObjectiveEntry_C_ExecuteUbergraph_WBP_Mission_ObjectiveEntry, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000004, "Member 'WBP_Mission_ObjectiveEntry_C_ExecuteUbergraph_WBP_Mission_ObjectiveEntry::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Mission_ObjectiveEntry_C_ExecuteUbergraph_WBP_Mission_ObjectiveEntry, CallFunc_Conv_NameToString_ReturnValue) == 0x000008, "Member 'WBP_Mission_ObjectiveEntry_C_ExecuteUbergraph_WBP_Mission_ObjectiveEntry::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Mission_ObjectiveEntry_C_ExecuteUbergraph_WBP_Mission_ObjectiveEntry, CallFunc_Concat_StrStr_ReturnValue) == 0x000018, "Member 'WBP_Mission_ObjectiveEntry_C_ExecuteUbergraph_WBP_Mission_ObjectiveEntry::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Mission_ObjectiveEntry_C_ExecuteUbergraph_WBP_Mission_ObjectiveEntry, CallFunc_GetGameState_ReturnValue) == 0x000028, "Member 'WBP_Mission_ObjectiveEntry_C_ExecuteUbergraph_WBP_Mission_ObjectiveEntry::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Mission_ObjectiveEntry_C_ExecuteUbergraph_WBP_Mission_ObjectiveEntry, K2Node_DynamicCast_AsGBGame_State) == 0x000030, "Member 'WBP_Mission_ObjectiveEntry_C_ExecuteUbergraph_WBP_Mission_ObjectiveEntry::K2Node_DynamicCast_AsGBGame_State' has a wrong offset!");
static_assert(offsetof(WBP_Mission_ObjectiveEntry_C_ExecuteUbergraph_WBP_Mission_ObjectiveEntry, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'WBP_Mission_ObjectiveEntry_C_ExecuteUbergraph_WBP_Mission_ObjectiveEntry::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Mission_ObjectiveEntry_C_ExecuteUbergraph_WBP_Mission_ObjectiveEntry, CallFunc_TextIsEmpty_ReturnValue) == 0x000039, "Member 'WBP_Mission_ObjectiveEntry_C_ExecuteUbergraph_WBP_Mission_ObjectiveEntry::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Mission_ObjectiveEntry_C_ExecuteUbergraph_WBP_Mission_ObjectiveEntry, CallFunc_GetGameModeModID_ReturnValue) == 0x000040, "Member 'WBP_Mission_ObjectiveEntry_C_ExecuteUbergraph_WBP_Mission_ObjectiveEntry::CallFunc_GetGameModeModID_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Mission_ObjectiveEntry_C_ExecuteUbergraph_WBP_Mission_ObjectiveEntry, CallFunc_GetLocalisedGameText_ReturnValue) == 0x000048, "Member 'WBP_Mission_ObjectiveEntry_C_ExecuteUbergraph_WBP_Mission_ObjectiveEntry::CallFunc_GetLocalisedGameText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Mission_ObjectiveEntry_C_ExecuteUbergraph_WBP_Mission_ObjectiveEntry, K2Node_CustomEvent_bIsPrimary) == 0x000060, "Member 'WBP_Mission_ObjectiveEntry_C_ExecuteUbergraph_WBP_Mission_ObjectiveEntry::K2Node_CustomEvent_bIsPrimary' has a wrong offset!");
static_assert(offsetof(WBP_Mission_ObjectiveEntry_C_ExecuteUbergraph_WBP_Mission_ObjectiveEntry, Temp_bool_Variable) == 0x000061, "Member 'WBP_Mission_ObjectiveEntry_C_ExecuteUbergraph_WBP_Mission_ObjectiveEntry::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Mission_ObjectiveEntry_C_ExecuteUbergraph_WBP_Mission_ObjectiveEntry, K2Node_Select_Default) == 0x000068, "Member 'WBP_Mission_ObjectiveEntry_C_ExecuteUbergraph_WBP_Mission_ObjectiveEntry::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Mission_ObjectiveEntry_C_ExecuteUbergraph_WBP_Mission_ObjectiveEntry, CallFunc_TextToUpper_ReturnValue) == 0x000080, "Member 'WBP_Mission_ObjectiveEntry_C_ExecuteUbergraph_WBP_Mission_ObjectiveEntry::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");

// Function WBP_Mission_ObjectiveEntry.WBP_Mission_ObjectiveEntry_C.SetIsPrimary
// 0x0001 (0x0001 - 0x0000)
struct WBP_Mission_ObjectiveEntry_C_SetIsPrimary final
{
public:
	bool                                          bIsPrimary;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Mission_ObjectiveEntry_C_SetIsPrimary) == 0x000001, "Wrong alignment on WBP_Mission_ObjectiveEntry_C_SetIsPrimary");
static_assert(sizeof(WBP_Mission_ObjectiveEntry_C_SetIsPrimary) == 0x000001, "Wrong size on WBP_Mission_ObjectiveEntry_C_SetIsPrimary");
static_assert(offsetof(WBP_Mission_ObjectiveEntry_C_SetIsPrimary, bIsPrimary) == 0x000000, "Member 'WBP_Mission_ObjectiveEntry_C_SetIsPrimary::bIsPrimary' has a wrong offset!");

// Function WBP_Mission_ObjectiveEntry.WBP_Mission_ObjectiveEntry_C.Get_TextBlock_Completion_ColorAndOpacity_0
// 0x00A8 (0x00A8 - 0x0000)
struct WBP_Mission_ObjectiveEntry_C_Get_TextBlock_Completion_ColorAndOpacity_0 final
{
public:
	struct FSlateColor                            ReturnValue;                                       // 0x0000(0x0028)(Parm, OutParm, ReturnParm)
	bool                                          Temp_bool_Variable;                                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0030(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0058(0x0028)()
	struct FSlateColor                            K2Node_Select_Default;                             // 0x0080(0x0028)()
};
static_assert(alignof(WBP_Mission_ObjectiveEntry_C_Get_TextBlock_Completion_ColorAndOpacity_0) == 0x000008, "Wrong alignment on WBP_Mission_ObjectiveEntry_C_Get_TextBlock_Completion_ColorAndOpacity_0");
static_assert(sizeof(WBP_Mission_ObjectiveEntry_C_Get_TextBlock_Completion_ColorAndOpacity_0) == 0x0000A8, "Wrong size on WBP_Mission_ObjectiveEntry_C_Get_TextBlock_Completion_ColorAndOpacity_0");
static_assert(offsetof(WBP_Mission_ObjectiveEntry_C_Get_TextBlock_Completion_ColorAndOpacity_0, ReturnValue) == 0x000000, "Member 'WBP_Mission_ObjectiveEntry_C_Get_TextBlock_Completion_ColorAndOpacity_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Mission_ObjectiveEntry_C_Get_TextBlock_Completion_ColorAndOpacity_0, Temp_bool_Variable) == 0x000028, "Member 'WBP_Mission_ObjectiveEntry_C_Get_TextBlock_Completion_ColorAndOpacity_0::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Mission_ObjectiveEntry_C_Get_TextBlock_Completion_ColorAndOpacity_0, K2Node_MakeStruct_SlateColor) == 0x000030, "Member 'WBP_Mission_ObjectiveEntry_C_Get_TextBlock_Completion_ColorAndOpacity_0::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WBP_Mission_ObjectiveEntry_C_Get_TextBlock_Completion_ColorAndOpacity_0, K2Node_MakeStruct_SlateColor_1) == 0x000058, "Member 'WBP_Mission_ObjectiveEntry_C_Get_TextBlock_Completion_ColorAndOpacity_0::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(WBP_Mission_ObjectiveEntry_C_Get_TextBlock_Completion_ColorAndOpacity_0, K2Node_Select_Default) == 0x000080, "Member 'WBP_Mission_ObjectiveEntry_C_Get_TextBlock_Completion_ColorAndOpacity_0::K2Node_Select_Default' has a wrong offset!");

}

