#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Mission_PlayerListEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_Mission_PlayerListEntry.WBP_Mission_PlayerListEntry_C.ExecuteUbergraph_WBP_Mission_PlayerListEntry
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_Mission_PlayerListEntry_C_ExecuteUbergraph_WBP_Mission_PlayerListEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AGBPlayerState* PlayerState)> K2Node_CreateDelegate_OutputDelegate;         // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGBPlayerState*                         K2Node_CustomEvent_PlayerState;                    // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         CallFunc_GetReplicatedPlayerStats_ReturnValue;     // 0x0028(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Array_Get_Item;                           // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetKeyValue_Key;                          // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetKeyValue_Value;                        // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_StringToInt_ReturnValue;             // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchString_CmpSuccess;                    // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_93[0x5];                                       // 0x0093(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue;             // 0x0098(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00B0(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x00F0(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0108(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0118(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0130(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_2;             // 0x0148(0x0018)()
	class FString                                 K2Node_CustomEvent_StatusKey;                      // 0x0160(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchString_CmpSuccess_1;                  // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0178(0x0018)()
	bool                                          Temp_bool_Variable;                                // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0198(0x0018)()
};
static_assert(alignof(WBP_Mission_PlayerListEntry_C_ExecuteUbergraph_WBP_Mission_PlayerListEntry) == 0x000008, "Wrong alignment on WBP_Mission_PlayerListEntry_C_ExecuteUbergraph_WBP_Mission_PlayerListEntry");
static_assert(sizeof(WBP_Mission_PlayerListEntry_C_ExecuteUbergraph_WBP_Mission_PlayerListEntry) == 0x0001B0, "Wrong size on WBP_Mission_PlayerListEntry_C_ExecuteUbergraph_WBP_Mission_PlayerListEntry");
static_assert(offsetof(WBP_Mission_PlayerListEntry_C_ExecuteUbergraph_WBP_Mission_PlayerListEntry, EntryPoint) == 0x000000, "Member 'WBP_Mission_PlayerListEntry_C_ExecuteUbergraph_WBP_Mission_PlayerListEntry::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Mission_PlayerListEntry_C_ExecuteUbergraph_WBP_Mission_PlayerListEntry, Temp_int_Array_Index_Variable) == 0x000004, "Member 'WBP_Mission_PlayerListEntry_C_ExecuteUbergraph_WBP_Mission_PlayerListEntry::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Mission_PlayerListEntry_C_ExecuteUbergraph_WBP_Mission_PlayerListEntry, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_Mission_PlayerListEntry_C_ExecuteUbergraph_WBP_Mission_PlayerListEntry::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Mission_PlayerListEntry_C_ExecuteUbergraph_WBP_Mission_PlayerListEntry, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'WBP_Mission_PlayerListEntry_C_ExecuteUbergraph_WBP_Mission_PlayerListEntry::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Mission_PlayerListEntry_C_ExecuteUbergraph_WBP_Mission_PlayerListEntry, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'WBP_Mission_PlayerListEntry_C_ExecuteUbergraph_WBP_Mission_PlayerListEntry::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Mission_PlayerListEntry_C_ExecuteUbergraph_WBP_Mission_PlayerListEntry, K2Node_CustomEvent_PlayerState) == 0x000020, "Member 'WBP_Mission_PlayerListEntry_C_ExecuteUbergraph_WBP_Mission_PlayerListEntry::K2Node_CustomEvent_PlayerState' has a wrong offset!");
static_assert(offsetof(WBP_Mission_PlayerListEntry_C_ExecuteUbergraph_WBP_Mission_PlayerListEntry, CallFunc_GetReplicatedPlayerStats_ReturnValue) == 0x000028, "Member 'WBP_Mission_PlayerListEntry_C_ExecuteUbergraph_WBP_Mission_PlayerListEntry::CallFunc_GetReplicatedPlayerStats_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Mission_PlayerListEntry_C_ExecuteUbergraph_WBP_Mission_PlayerListEntry, CallFunc_Array_Get_Item) == 0x000038, "Member 'WBP_Mission_PlayerListEntry_C_ExecuteUbergraph_WBP_Mission_PlayerListEntry::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Mission_PlayerListEntry_C_ExecuteUbergraph_WBP_Mission_PlayerListEntry, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'WBP_Mission_PlayerListEntry_C_ExecuteUbergraph_WBP_Mission_PlayerListEntry::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Mission_PlayerListEntry_C_ExecuteUbergraph_WBP_Mission_PlayerListEntry, CallFunc_GetKeyValue_Key) == 0x000050, "Member 'WBP_Mission_PlayerListEntry_C_ExecuteUbergraph_WBP_Mission_PlayerListEntry::CallFunc_GetKeyValue_Key' has a wrong offset!");
static_assert(offsetof(WBP_Mission_PlayerListEntry_C_ExecuteUbergraph_WBP_Mission_PlayerListEntry, CallFunc_GetKeyValue_Value) == 0x000060, "Member 'WBP_Mission_PlayerListEntry_C_ExecuteUbergraph_WBP_Mission_PlayerListEntry::CallFunc_GetKeyValue_Value' has a wrong offset!");
static_assert(offsetof(WBP_Mission_PlayerListEntry_C_ExecuteUbergraph_WBP_Mission_PlayerListEntry, CallFunc_Less_IntInt_ReturnValue) == 0x000070, "Member 'WBP_Mission_PlayerListEntry_C_ExecuteUbergraph_WBP_Mission_PlayerListEntry::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Mission_PlayerListEntry_C_ExecuteUbergraph_WBP_Mission_PlayerListEntry, CallFunc_Conv_StringToInt_ReturnValue) == 0x000074, "Member 'WBP_Mission_PlayerListEntry_C_ExecuteUbergraph_WBP_Mission_PlayerListEntry::CallFunc_Conv_StringToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Mission_PlayerListEntry_C_ExecuteUbergraph_WBP_Mission_PlayerListEntry, K2Node_SwitchString_CmpSuccess) == 0x000078, "Member 'WBP_Mission_PlayerListEntry_C_ExecuteUbergraph_WBP_Mission_PlayerListEntry::K2Node_SwitchString_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Mission_PlayerListEntry_C_ExecuteUbergraph_WBP_Mission_PlayerListEntry, CallFunc_Conv_IntToFloat_ReturnValue) == 0x00007C, "Member 'WBP_Mission_PlayerListEntry_C_ExecuteUbergraph_WBP_Mission_PlayerListEntry::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Mission_PlayerListEntry_C_ExecuteUbergraph_WBP_Mission_PlayerListEntry, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x000080, "Member 'WBP_Mission_PlayerListEntry_C_ExecuteUbergraph_WBP_Mission_PlayerListEntry::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Mission_PlayerListEntry_C_ExecuteUbergraph_WBP_Mission_PlayerListEntry, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000084, "Member 'WBP_Mission_PlayerListEntry_C_ExecuteUbergraph_WBP_Mission_PlayerListEntry::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Mission_PlayerListEntry_C_ExecuteUbergraph_WBP_Mission_PlayerListEntry, CallFunc_Greater_IntInt_ReturnValue) == 0x000088, "Member 'WBP_Mission_PlayerListEntry_C_ExecuteUbergraph_WBP_Mission_PlayerListEntry::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Mission_PlayerListEntry_C_ExecuteUbergraph_WBP_Mission_PlayerListEntry, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00008C, "Member 'WBP_Mission_PlayerListEntry_C_ExecuteUbergraph_WBP_Mission_PlayerListEntry::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Mission_PlayerListEntry_C_ExecuteUbergraph_WBP_Mission_PlayerListEntry, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000090, "Member 'WBP_Mission_PlayerListEntry_C_ExecuteUbergraph_WBP_Mission_PlayerListEntry::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Mission_PlayerListEntry_C_ExecuteUbergraph_WBP_Mission_PlayerListEntry, CallFunc_BooleanAND_ReturnValue) == 0x000091, "Member 'WBP_Mission_PlayerListEntry_C_ExecuteUbergraph_WBP_Mission_PlayerListEntry::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Mission_PlayerListEntry_C_ExecuteUbergraph_WBP_Mission_PlayerListEntry, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000092, "Member 'WBP_Mission_PlayerListEntry_C_ExecuteUbergraph_WBP_Mission_PlayerListEntry::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Mission_PlayerListEntry_C_ExecuteUbergraph_WBP_Mission_PlayerListEntry, CallFunc_Conv_FloatToText_ReturnValue) == 0x000098, "Member 'WBP_Mission_PlayerListEntry_C_ExecuteUbergraph_WBP_Mission_PlayerListEntry::CallFunc_Conv_FloatToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Mission_PlayerListEntry_C_ExecuteUbergraph_WBP_Mission_PlayerListEntry, K2Node_MakeStruct_FormatArgumentData) == 0x0000B0, "Member 'WBP_Mission_PlayerListEntry_C_ExecuteUbergraph_WBP_Mission_PlayerListEntry::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_Mission_PlayerListEntry_C_ExecuteUbergraph_WBP_Mission_PlayerListEntry, CallFunc_Conv_IntToText_ReturnValue) == 0x0000F0, "Member 'WBP_Mission_PlayerListEntry_C_ExecuteUbergraph_WBP_Mission_PlayerListEntry::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Mission_PlayerListEntry_C_ExecuteUbergraph_WBP_Mission_PlayerListEntry, K2Node_MakeArray_Array) == 0x000108, "Member 'WBP_Mission_PlayerListEntry_C_ExecuteUbergraph_WBP_Mission_PlayerListEntry::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Mission_PlayerListEntry_C_ExecuteUbergraph_WBP_Mission_PlayerListEntry, CallFunc_Format_ReturnValue) == 0x000118, "Member 'WBP_Mission_PlayerListEntry_C_ExecuteUbergraph_WBP_Mission_PlayerListEntry::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Mission_PlayerListEntry_C_ExecuteUbergraph_WBP_Mission_PlayerListEntry, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000130, "Member 'WBP_Mission_PlayerListEntry_C_ExecuteUbergraph_WBP_Mission_PlayerListEntry::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Mission_PlayerListEntry_C_ExecuteUbergraph_WBP_Mission_PlayerListEntry, CallFunc_Conv_IntToText_ReturnValue_2) == 0x000148, "Member 'WBP_Mission_PlayerListEntry_C_ExecuteUbergraph_WBP_Mission_PlayerListEntry::CallFunc_Conv_IntToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Mission_PlayerListEntry_C_ExecuteUbergraph_WBP_Mission_PlayerListEntry, K2Node_CustomEvent_StatusKey) == 0x000160, "Member 'WBP_Mission_PlayerListEntry_C_ExecuteUbergraph_WBP_Mission_PlayerListEntry::K2Node_CustomEvent_StatusKey' has a wrong offset!");
static_assert(offsetof(WBP_Mission_PlayerListEntry_C_ExecuteUbergraph_WBP_Mission_PlayerListEntry, K2Node_SwitchString_CmpSuccess_1) == 0x000170, "Member 'WBP_Mission_PlayerListEntry_C_ExecuteUbergraph_WBP_Mission_PlayerListEntry::K2Node_SwitchString_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_Mission_PlayerListEntry_C_ExecuteUbergraph_WBP_Mission_PlayerListEntry, Temp_text_Variable) == 0x000178, "Member 'WBP_Mission_PlayerListEntry_C_ExecuteUbergraph_WBP_Mission_PlayerListEntry::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Mission_PlayerListEntry_C_ExecuteUbergraph_WBP_Mission_PlayerListEntry, Temp_bool_Variable) == 0x000190, "Member 'WBP_Mission_PlayerListEntry_C_ExecuteUbergraph_WBP_Mission_PlayerListEntry::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Mission_PlayerListEntry_C_ExecuteUbergraph_WBP_Mission_PlayerListEntry, K2Node_Select_Default) == 0x000198, "Member 'WBP_Mission_PlayerListEntry_C_ExecuteUbergraph_WBP_Mission_PlayerListEntry::K2Node_Select_Default' has a wrong offset!");

// Function WBP_Mission_PlayerListEntry.WBP_Mission_PlayerListEntry_C.UpdateStatus
// 0x0010 (0x0010 - 0x0000)
struct WBP_Mission_PlayerListEntry_C_UpdateStatus final
{
public:
	class FString                                 StatusKey;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Mission_PlayerListEntry_C_UpdateStatus) == 0x000008, "Wrong alignment on WBP_Mission_PlayerListEntry_C_UpdateStatus");
static_assert(sizeof(WBP_Mission_PlayerListEntry_C_UpdateStatus) == 0x000010, "Wrong size on WBP_Mission_PlayerListEntry_C_UpdateStatus");
static_assert(offsetof(WBP_Mission_PlayerListEntry_C_UpdateStatus, StatusKey) == 0x000000, "Member 'WBP_Mission_PlayerListEntry_C_UpdateStatus::StatusKey' has a wrong offset!");

// Function WBP_Mission_PlayerListEntry.WBP_Mission_PlayerListEntry_C.OnReplicatedPlayerStatsUpdated_Event_0
// 0x0008 (0x0008 - 0x0000)
struct WBP_Mission_PlayerListEntry_C_OnReplicatedPlayerStatsUpdated_Event_0 final
{
public:
	class AGBPlayerState*                         PlayerState_0;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Mission_PlayerListEntry_C_OnReplicatedPlayerStatsUpdated_Event_0) == 0x000008, "Wrong alignment on WBP_Mission_PlayerListEntry_C_OnReplicatedPlayerStatsUpdated_Event_0");
static_assert(sizeof(WBP_Mission_PlayerListEntry_C_OnReplicatedPlayerStatsUpdated_Event_0) == 0x000008, "Wrong size on WBP_Mission_PlayerListEntry_C_OnReplicatedPlayerStatsUpdated_Event_0");
static_assert(offsetof(WBP_Mission_PlayerListEntry_C_OnReplicatedPlayerStatsUpdated_Event_0, PlayerState_0) == 0x000000, "Member 'WBP_Mission_PlayerListEntry_C_OnReplicatedPlayerStatsUpdated_Event_0::PlayerState_0' has a wrong offset!");

}

