#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CharacterEditorScreen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CharacterEditorScreen.WBP_CharacterEditorScreen_C
// 0x0088 (0x02E8 - 0x0260)
class UWBP_CharacterEditorScreen_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_CharacterEditor_C*                 WBP_CharacterEditor;                               // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_0;                                  // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FName                                   ProfileName;                                       // 0x0278(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OldViewTarget;                                     // 0x0280(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   MissingRequiredTitle;                              // 0x0288(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   MissingRequiredMessage;                            // 0x02A0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   SaveFailedTitle;                                   // 0x02B8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   SaveFailedMessage;                                 // 0x02D0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_WBP_CharacterEditorScreen(int32 EntryPoint);
	void Close();
	void BndEvt__WBP_CharacterEditor_NEW_K2Node_ComponentBoundEvent_2_CancelClicked__DelegateSignature();
	void BndEvt__WBP_CharacterEditor_NEW_K2Node_ComponentBoundEvent_1_OkClicked__DelegateSignature(class UVaRestJsonObject* JsonObj);
	void Setup();
	struct FEventReply OnPreviewKeyDown(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CharacterEditorScreen_C">();
	}
	static class UWBP_CharacterEditorScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CharacterEditorScreen_C>();
	}
};
static_assert(alignof(UWBP_CharacterEditorScreen_C) == 0x000008, "Wrong alignment on UWBP_CharacterEditorScreen_C");
static_assert(sizeof(UWBP_CharacterEditorScreen_C) == 0x0002E8, "Wrong size on UWBP_CharacterEditorScreen_C");
static_assert(offsetof(UWBP_CharacterEditorScreen_C, UberGraphFrame) == 0x000260, "Member 'UWBP_CharacterEditorScreen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterEditorScreen_C, WBP_CharacterEditor) == 0x000268, "Member 'UWBP_CharacterEditorScreen_C::WBP_CharacterEditor' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterEditorScreen_C, WidgetSwitcher_0) == 0x000270, "Member 'UWBP_CharacterEditorScreen_C::WidgetSwitcher_0' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterEditorScreen_C, ProfileName) == 0x000278, "Member 'UWBP_CharacterEditorScreen_C::ProfileName' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterEditorScreen_C, OldViewTarget) == 0x000280, "Member 'UWBP_CharacterEditorScreen_C::OldViewTarget' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterEditorScreen_C, MissingRequiredTitle) == 0x000288, "Member 'UWBP_CharacterEditorScreen_C::MissingRequiredTitle' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterEditorScreen_C, MissingRequiredMessage) == 0x0002A0, "Member 'UWBP_CharacterEditorScreen_C::MissingRequiredMessage' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterEditorScreen_C, SaveFailedTitle) == 0x0002B8, "Member 'UWBP_CharacterEditorScreen_C::SaveFailedTitle' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterEditorScreen_C, SaveFailedMessage) == 0x0002D0, "Member 'UWBP_CharacterEditorScreen_C::SaveFailedMessage' has a wrong offset!");

}

