#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ME_MapWidgetListItem

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_ME_MapWidgetListItem.WBP_ME_MapWidgetListItem_C.ExecuteUbergraph_WBP_ME_MapWidgetListItem
// 0x0068 (0x0068 - 0x0000)
struct WBP_ME_MapWidgetListItem_C_ExecuteUbergraph_WBP_ME_MapWidgetListItem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UDragDropOperation* Operation)> K2Node_CreateDelegate_OutputDelegate;       // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_1;            // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	class UDragDropOperation*                     K2Node_CustomEvent_DragDropOp;                     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDragDropOperation*                     K2Node_CustomEvent_Operation;                      // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetMousePositionOnViewport_ReturnValue;   // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable;                              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_ME_MapAnnotator_C*                 CallFunc_GetParentWidgetOfClass_ReturnValue;       // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ME_MapWidgetListItem_C_ExecuteUbergraph_WBP_ME_MapWidgetListItem) == 0x000008, "Wrong alignment on WBP_ME_MapWidgetListItem_C_ExecuteUbergraph_WBP_ME_MapWidgetListItem");
static_assert(sizeof(WBP_ME_MapWidgetListItem_C_ExecuteUbergraph_WBP_ME_MapWidgetListItem) == 0x000068, "Wrong size on WBP_ME_MapWidgetListItem_C_ExecuteUbergraph_WBP_ME_MapWidgetListItem");
static_assert(offsetof(WBP_ME_MapWidgetListItem_C_ExecuteUbergraph_WBP_ME_MapWidgetListItem, EntryPoint) == 0x000000, "Member 'WBP_ME_MapWidgetListItem_C_ExecuteUbergraph_WBP_ME_MapWidgetListItem::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ME_MapWidgetListItem_C_ExecuteUbergraph_WBP_ME_MapWidgetListItem, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_ME_MapWidgetListItem_C_ExecuteUbergraph_WBP_ME_MapWidgetListItem::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_ME_MapWidgetListItem_C_ExecuteUbergraph_WBP_ME_MapWidgetListItem, CallFunc_IsValid_ReturnValue) == 0x000014, "Member 'WBP_ME_MapWidgetListItem_C_ExecuteUbergraph_WBP_ME_MapWidgetListItem::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ME_MapWidgetListItem_C_ExecuteUbergraph_WBP_ME_MapWidgetListItem, K2Node_CreateDelegate_OutputDelegate_1) == 0x000018, "Member 'WBP_ME_MapWidgetListItem_C_ExecuteUbergraph_WBP_ME_MapWidgetListItem::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_ME_MapWidgetListItem_C_ExecuteUbergraph_WBP_ME_MapWidgetListItem, K2Node_CustomEvent_DragDropOp) == 0x000028, "Member 'WBP_ME_MapWidgetListItem_C_ExecuteUbergraph_WBP_ME_MapWidgetListItem::K2Node_CustomEvent_DragDropOp' has a wrong offset!");
static_assert(offsetof(WBP_ME_MapWidgetListItem_C_ExecuteUbergraph_WBP_ME_MapWidgetListItem, K2Node_CustomEvent_Operation) == 0x000030, "Member 'WBP_ME_MapWidgetListItem_C_ExecuteUbergraph_WBP_ME_MapWidgetListItem::K2Node_CustomEvent_Operation' has a wrong offset!");
static_assert(offsetof(WBP_ME_MapWidgetListItem_C_ExecuteUbergraph_WBP_ME_MapWidgetListItem, CallFunc_GetMousePositionOnViewport_ReturnValue) == 0x000038, "Member 'WBP_ME_MapWidgetListItem_C_ExecuteUbergraph_WBP_ME_MapWidgetListItem::CallFunc_GetMousePositionOnViewport_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ME_MapWidgetListItem_C_ExecuteUbergraph_WBP_ME_MapWidgetListItem, Temp_object_Variable) == 0x000040, "Member 'WBP_ME_MapWidgetListItem_C_ExecuteUbergraph_WBP_ME_MapWidgetListItem::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ME_MapWidgetListItem_C_ExecuteUbergraph_WBP_ME_MapWidgetListItem, K2Node_DynamicCast_AsTexture_2D) == 0x000048, "Member 'WBP_ME_MapWidgetListItem_C_ExecuteUbergraph_WBP_ME_MapWidgetListItem::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(WBP_ME_MapWidgetListItem_C_ExecuteUbergraph_WBP_ME_MapWidgetListItem, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'WBP_ME_MapWidgetListItem_C_ExecuteUbergraph_WBP_ME_MapWidgetListItem::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ME_MapWidgetListItem_C_ExecuteUbergraph_WBP_ME_MapWidgetListItem, CallFunc_GetParentWidgetOfClass_ReturnValue) == 0x000058, "Member 'WBP_ME_MapWidgetListItem_C_ExecuteUbergraph_WBP_ME_MapWidgetListItem::CallFunc_GetParentWidgetOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ME_MapWidgetListItem_C_ExecuteUbergraph_WBP_ME_MapWidgetListItem, K2Node_CustomEvent_Loaded) == 0x000060, "Member 'WBP_ME_MapWidgetListItem_C_ExecuteUbergraph_WBP_ME_MapWidgetListItem::K2Node_CustomEvent_Loaded' has a wrong offset!");

// Function WBP_ME_MapWidgetListItem.WBP_ME_MapWidgetListItem_C.DragCancelled
// 0x0008 (0x0008 - 0x0000)
struct WBP_ME_MapWidgetListItem_C_DragCancelled final
{
public:
	class UDragDropOperation*                     Operation;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ME_MapWidgetListItem_C_DragCancelled) == 0x000008, "Wrong alignment on WBP_ME_MapWidgetListItem_C_DragCancelled");
static_assert(sizeof(WBP_ME_MapWidgetListItem_C_DragCancelled) == 0x000008, "Wrong size on WBP_ME_MapWidgetListItem_C_DragCancelled");
static_assert(offsetof(WBP_ME_MapWidgetListItem_C_DragCancelled, Operation) == 0x000000, "Member 'WBP_ME_MapWidgetListItem_C_DragCancelled::Operation' has a wrong offset!");

// Function WBP_ME_MapWidgetListItem.WBP_ME_MapWidgetListItem_C.BindDragDropOperation
// 0x0008 (0x0008 - 0x0000)
struct WBP_ME_MapWidgetListItem_C_BindDragDropOperation final
{
public:
	class UDragDropOperation*                     DragDropOp;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ME_MapWidgetListItem_C_BindDragDropOperation) == 0x000008, "Wrong alignment on WBP_ME_MapWidgetListItem_C_BindDragDropOperation");
static_assert(sizeof(WBP_ME_MapWidgetListItem_C_BindDragDropOperation) == 0x000008, "Wrong size on WBP_ME_MapWidgetListItem_C_BindDragDropOperation");
static_assert(offsetof(WBP_ME_MapWidgetListItem_C_BindDragDropOperation, DragDropOp) == 0x000000, "Member 'WBP_ME_MapWidgetListItem_C_BindDragDropOperation::DragDropOp' has a wrong offset!");

// Function WBP_ME_MapWidgetListItem.WBP_ME_MapWidgetListItem_C.OnLoaded_CCEA74F146EB214E46A765B498F9C9A3
// 0x0008 (0x0008 - 0x0000)
struct WBP_ME_MapWidgetListItem_C_OnLoaded_CCEA74F146EB214E46A765B498F9C9A3 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ME_MapWidgetListItem_C_OnLoaded_CCEA74F146EB214E46A765B498F9C9A3) == 0x000008, "Wrong alignment on WBP_ME_MapWidgetListItem_C_OnLoaded_CCEA74F146EB214E46A765B498F9C9A3");
static_assert(sizeof(WBP_ME_MapWidgetListItem_C_OnLoaded_CCEA74F146EB214E46A765B498F9C9A3) == 0x000008, "Wrong size on WBP_ME_MapWidgetListItem_C_OnLoaded_CCEA74F146EB214E46A765B498F9C9A3");
static_assert(offsetof(WBP_ME_MapWidgetListItem_C_OnLoaded_CCEA74F146EB214E46A765B498F9C9A3, Loaded) == 0x000000, "Member 'WBP_ME_MapWidgetListItem_C_OnLoaded_CCEA74F146EB214E46A765B498F9C9A3::Loaded' has a wrong offset!");

// Function WBP_ME_MapWidgetListItem.WBP_ME_MapWidgetListItem_C.OnDragDetected
// 0x00C0 (0x00C0 - 0x0000)
struct WBP_ME_MapWidgetListItem_C_OnDragDetected final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          PointerEvent;                                      // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UDragDropOperation*                     Operation;                                         // 0x00A8(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_HF_PlaceableDragIcon_C*            CallFunc_Create_ReturnValue;                       // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHFDragDropOperation*                   CallFunc_CreateDragDropOperation_ReturnValue;      // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ME_MapWidgetListItem_C_OnDragDetected) == 0x000008, "Wrong alignment on WBP_ME_MapWidgetListItem_C_OnDragDetected");
static_assert(sizeof(WBP_ME_MapWidgetListItem_C_OnDragDetected) == 0x0000C0, "Wrong size on WBP_ME_MapWidgetListItem_C_OnDragDetected");
static_assert(offsetof(WBP_ME_MapWidgetListItem_C_OnDragDetected, MyGeometry) == 0x000000, "Member 'WBP_ME_MapWidgetListItem_C_OnDragDetected::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_ME_MapWidgetListItem_C_OnDragDetected, PointerEvent) == 0x000038, "Member 'WBP_ME_MapWidgetListItem_C_OnDragDetected::PointerEvent' has a wrong offset!");
static_assert(offsetof(WBP_ME_MapWidgetListItem_C_OnDragDetected, Operation) == 0x0000A8, "Member 'WBP_ME_MapWidgetListItem_C_OnDragDetected::Operation' has a wrong offset!");
static_assert(offsetof(WBP_ME_MapWidgetListItem_C_OnDragDetected, CallFunc_Create_ReturnValue) == 0x0000B0, "Member 'WBP_ME_MapWidgetListItem_C_OnDragDetected::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ME_MapWidgetListItem_C_OnDragDetected, CallFunc_CreateDragDropOperation_ReturnValue) == 0x0000B8, "Member 'WBP_ME_MapWidgetListItem_C_OnDragDetected::CallFunc_CreateDragDropOperation_ReturnValue' has a wrong offset!");

// Function WBP_ME_MapWidgetListItem.WBP_ME_MapWidgetListItem_C.OnMouseButtonDown
// 0x0218 (0x0218 - 0x0000)
struct WBP_ME_MapWidgetListItem_C_OnMouseButtonDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_DetectDragIfPressed_ReturnValue;          // 0x0160(0x00B8)()
};
static_assert(alignof(WBP_ME_MapWidgetListItem_C_OnMouseButtonDown) == 0x000008, "Wrong alignment on WBP_ME_MapWidgetListItem_C_OnMouseButtonDown");
static_assert(sizeof(WBP_ME_MapWidgetListItem_C_OnMouseButtonDown) == 0x000218, "Wrong size on WBP_ME_MapWidgetListItem_C_OnMouseButtonDown");
static_assert(offsetof(WBP_ME_MapWidgetListItem_C_OnMouseButtonDown, MyGeometry) == 0x000000, "Member 'WBP_ME_MapWidgetListItem_C_OnMouseButtonDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_ME_MapWidgetListItem_C_OnMouseButtonDown, MouseEvent) == 0x000038, "Member 'WBP_ME_MapWidgetListItem_C_OnMouseButtonDown::MouseEvent' has a wrong offset!");
static_assert(offsetof(WBP_ME_MapWidgetListItem_C_OnMouseButtonDown, ReturnValue) == 0x0000A8, "Member 'WBP_ME_MapWidgetListItem_C_OnMouseButtonDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ME_MapWidgetListItem_C_OnMouseButtonDown, CallFunc_DetectDragIfPressed_ReturnValue) == 0x000160, "Member 'WBP_ME_MapWidgetListItem_C_OnMouseButtonDown::CallFunc_DetectDragIfPressed_ReturnValue' has a wrong offset!");

// Function WBP_ME_MapWidgetListItem.WBP_ME_MapWidgetListItem_C.GetBrushColor_0
// 0x0014 (0x0014 - 0x0000)
struct WBP_ME_MapWidgetListItem_C_GetBrushColor_0 final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHovered_ReturnValue;                    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_ME_MapWidgetListItem_C_GetBrushColor_0) == 0x000004, "Wrong alignment on WBP_ME_MapWidgetListItem_C_GetBrushColor_0");
static_assert(sizeof(WBP_ME_MapWidgetListItem_C_GetBrushColor_0) == 0x000014, "Wrong size on WBP_ME_MapWidgetListItem_C_GetBrushColor_0");
static_assert(offsetof(WBP_ME_MapWidgetListItem_C_GetBrushColor_0, ReturnValue) == 0x000000, "Member 'WBP_ME_MapWidgetListItem_C_GetBrushColor_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ME_MapWidgetListItem_C_GetBrushColor_0, CallFunc_IsHovered_ReturnValue) == 0x000010, "Member 'WBP_ME_MapWidgetListItem_C_GetBrushColor_0::CallFunc_IsHovered_ReturnValue' has a wrong offset!");

}

