#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CampaignMissionBulletPointEntry

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GroundBranch_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CampaignMissionBulletPointEntry.WBP_CampaignMissionBulletPointEntry_C
// 0x00D0 (0x0330 - 0x0260)
class UWBP_CampaignMissionBulletPointEntry_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       SpinCircle;                                        // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_MissionCompleted;                            // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_MissionFailed;                               // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_MissionObjective;                            // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_MissionInProgress;                         // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         RichTextBlock_ObjectiveTitle;                      // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FString                                 ObjectiveTitleToken;                               // 0x0298(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FName                                   MissionDetailsTableId;                             // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   MissionTitleNotFoundText;                          // 0x02B0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FName                                   HotspotCodename;                                   // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         MissionSequenceNumber;                             // 0x02D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	EGBMissionObjectiveStatus                     DisplayAsStatus;                                   // 0x02D4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_2D5[0x3];                                      // 0x02D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Colour_Inactive;                                   // 0x02D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Colour_Active;                                     // 0x02E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Colour_PartiallyComplete;                          // 0x02F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Colour_Failed;                                     // 0x0308(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Colour_Completed;                                  // 0x0318(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bPutBracketsAroundObjectiveText;                   // 0x0328(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	bool                                          bListAsStarted;                                    // 0x0329(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)

public:
	void Construct();
	void ExecuteUbergraph_WBP_CampaignMissionBulletPointEntry(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CampaignMissionBulletPointEntry_C">();
	}
	static class UWBP_CampaignMissionBulletPointEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CampaignMissionBulletPointEntry_C>();
	}
};
static_assert(alignof(UWBP_CampaignMissionBulletPointEntry_C) == 0x000008, "Wrong alignment on UWBP_CampaignMissionBulletPointEntry_C");
static_assert(sizeof(UWBP_CampaignMissionBulletPointEntry_C) == 0x000330, "Wrong size on UWBP_CampaignMissionBulletPointEntry_C");
static_assert(offsetof(UWBP_CampaignMissionBulletPointEntry_C, UberGraphFrame) == 0x000260, "Member 'UWBP_CampaignMissionBulletPointEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CampaignMissionBulletPointEntry_C, SpinCircle) == 0x000268, "Member 'UWBP_CampaignMissionBulletPointEntry_C::SpinCircle' has a wrong offset!");
static_assert(offsetof(UWBP_CampaignMissionBulletPointEntry_C, Image_MissionCompleted) == 0x000270, "Member 'UWBP_CampaignMissionBulletPointEntry_C::Image_MissionCompleted' has a wrong offset!");
static_assert(offsetof(UWBP_CampaignMissionBulletPointEntry_C, Image_MissionFailed) == 0x000278, "Member 'UWBP_CampaignMissionBulletPointEntry_C::Image_MissionFailed' has a wrong offset!");
static_assert(offsetof(UWBP_CampaignMissionBulletPointEntry_C, Image_MissionObjective) == 0x000280, "Member 'UWBP_CampaignMissionBulletPointEntry_C::Image_MissionObjective' has a wrong offset!");
static_assert(offsetof(UWBP_CampaignMissionBulletPointEntry_C, Overlay_MissionInProgress) == 0x000288, "Member 'UWBP_CampaignMissionBulletPointEntry_C::Overlay_MissionInProgress' has a wrong offset!");
static_assert(offsetof(UWBP_CampaignMissionBulletPointEntry_C, RichTextBlock_ObjectiveTitle) == 0x000290, "Member 'UWBP_CampaignMissionBulletPointEntry_C::RichTextBlock_ObjectiveTitle' has a wrong offset!");
static_assert(offsetof(UWBP_CampaignMissionBulletPointEntry_C, ObjectiveTitleToken) == 0x000298, "Member 'UWBP_CampaignMissionBulletPointEntry_C::ObjectiveTitleToken' has a wrong offset!");
static_assert(offsetof(UWBP_CampaignMissionBulletPointEntry_C, MissionDetailsTableId) == 0x0002A8, "Member 'UWBP_CampaignMissionBulletPointEntry_C::MissionDetailsTableId' has a wrong offset!");
static_assert(offsetof(UWBP_CampaignMissionBulletPointEntry_C, MissionTitleNotFoundText) == 0x0002B0, "Member 'UWBP_CampaignMissionBulletPointEntry_C::MissionTitleNotFoundText' has a wrong offset!");
static_assert(offsetof(UWBP_CampaignMissionBulletPointEntry_C, HotspotCodename) == 0x0002C8, "Member 'UWBP_CampaignMissionBulletPointEntry_C::HotspotCodename' has a wrong offset!");
static_assert(offsetof(UWBP_CampaignMissionBulletPointEntry_C, MissionSequenceNumber) == 0x0002D0, "Member 'UWBP_CampaignMissionBulletPointEntry_C::MissionSequenceNumber' has a wrong offset!");
static_assert(offsetof(UWBP_CampaignMissionBulletPointEntry_C, DisplayAsStatus) == 0x0002D4, "Member 'UWBP_CampaignMissionBulletPointEntry_C::DisplayAsStatus' has a wrong offset!");
static_assert(offsetof(UWBP_CampaignMissionBulletPointEntry_C, Colour_Inactive) == 0x0002D8, "Member 'UWBP_CampaignMissionBulletPointEntry_C::Colour_Inactive' has a wrong offset!");
static_assert(offsetof(UWBP_CampaignMissionBulletPointEntry_C, Colour_Active) == 0x0002E8, "Member 'UWBP_CampaignMissionBulletPointEntry_C::Colour_Active' has a wrong offset!");
static_assert(offsetof(UWBP_CampaignMissionBulletPointEntry_C, Colour_PartiallyComplete) == 0x0002F8, "Member 'UWBP_CampaignMissionBulletPointEntry_C::Colour_PartiallyComplete' has a wrong offset!");
static_assert(offsetof(UWBP_CampaignMissionBulletPointEntry_C, Colour_Failed) == 0x000308, "Member 'UWBP_CampaignMissionBulletPointEntry_C::Colour_Failed' has a wrong offset!");
static_assert(offsetof(UWBP_CampaignMissionBulletPointEntry_C, Colour_Completed) == 0x000318, "Member 'UWBP_CampaignMissionBulletPointEntry_C::Colour_Completed' has a wrong offset!");
static_assert(offsetof(UWBP_CampaignMissionBulletPointEntry_C, bPutBracketsAroundObjectiveText) == 0x000328, "Member 'UWBP_CampaignMissionBulletPointEntry_C::bPutBracketsAroundObjectiveText' has a wrong offset!");
static_assert(offsetof(UWBP_CampaignMissionBulletPointEntry_C, bListAsStarted) == 0x000329, "Member 'UWBP_CampaignMissionBulletPointEntry_C::bListAsStarted' has a wrong offset!");

}

