#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_BuildInfo

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_BuildInfo.WBP_BuildInfo_C
// 0x0028 (0x0288 - 0x0260)
class UWBP_BuildInfo_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             BuildNumber;                                       // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             BuildType;                                         // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             EngineVersion;                                     // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Version;                                           // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_BuildInfo(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_BuildInfo_C">();
	}
	static class UWBP_BuildInfo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_BuildInfo_C>();
	}
};
static_assert(alignof(UWBP_BuildInfo_C) == 0x000008, "Wrong alignment on UWBP_BuildInfo_C");
static_assert(sizeof(UWBP_BuildInfo_C) == 0x000288, "Wrong size on UWBP_BuildInfo_C");
static_assert(offsetof(UWBP_BuildInfo_C, UberGraphFrame) == 0x000260, "Member 'UWBP_BuildInfo_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_BuildInfo_C, BuildNumber) == 0x000268, "Member 'UWBP_BuildInfo_C::BuildNumber' has a wrong offset!");
static_assert(offsetof(UWBP_BuildInfo_C, BuildType) == 0x000270, "Member 'UWBP_BuildInfo_C::BuildType' has a wrong offset!");
static_assert(offsetof(UWBP_BuildInfo_C, EngineVersion) == 0x000278, "Member 'UWBP_BuildInfo_C::EngineVersion' has a wrong offset!");
static_assert(offsetof(UWBP_BuildInfo_C, Version) == 0x000280, "Member 'UWBP_BuildInfo_C::Version' has a wrong offset!");

}

