#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TeamKillOptions

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_TeamKillOptions.WBP_TeamKillOptions_C.ExecuteUbergraph_WBP_TeamKillOptions
// 0x0150 (0x0150 - 0x0000)
struct WBP_TeamKillOptions_C_ExecuteUbergraph_WBP_TeamKillOptions final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0008(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0020(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0060(0x0010)(ReferenceParm)
	class FText                                   K2Node_CustomEvent_InText;                         // 0x0070(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0088(0x0018)()
	class FString                                 K2Node_CustomEvent_InString;                       // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Value;                          // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00B8(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x00D0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00E8(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0128(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0138(0x0018)()
};
static_assert(alignof(WBP_TeamKillOptions_C_ExecuteUbergraph_WBP_TeamKillOptions) == 0x000008, "Wrong alignment on WBP_TeamKillOptions_C_ExecuteUbergraph_WBP_TeamKillOptions");
static_assert(sizeof(WBP_TeamKillOptions_C_ExecuteUbergraph_WBP_TeamKillOptions) == 0x000150, "Wrong size on WBP_TeamKillOptions_C_ExecuteUbergraph_WBP_TeamKillOptions");
static_assert(offsetof(WBP_TeamKillOptions_C_ExecuteUbergraph_WBP_TeamKillOptions, EntryPoint) == 0x000000, "Member 'WBP_TeamKillOptions_C_ExecuteUbergraph_WBP_TeamKillOptions::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_TeamKillOptions_C_ExecuteUbergraph_WBP_TeamKillOptions, CallFunc_GetText_ReturnValue) == 0x000008, "Member 'WBP_TeamKillOptions_C_ExecuteUbergraph_WBP_TeamKillOptions::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TeamKillOptions_C_ExecuteUbergraph_WBP_TeamKillOptions, K2Node_MakeStruct_FormatArgumentData) == 0x000020, "Member 'WBP_TeamKillOptions_C_ExecuteUbergraph_WBP_TeamKillOptions::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_TeamKillOptions_C_ExecuteUbergraph_WBP_TeamKillOptions, K2Node_MakeArray_Array) == 0x000060, "Member 'WBP_TeamKillOptions_C_ExecuteUbergraph_WBP_TeamKillOptions::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_TeamKillOptions_C_ExecuteUbergraph_WBP_TeamKillOptions, K2Node_CustomEvent_InText) == 0x000070, "Member 'WBP_TeamKillOptions_C_ExecuteUbergraph_WBP_TeamKillOptions::K2Node_CustomEvent_InText' has a wrong offset!");
static_assert(offsetof(WBP_TeamKillOptions_C_ExecuteUbergraph_WBP_TeamKillOptions, CallFunc_Format_ReturnValue) == 0x000088, "Member 'WBP_TeamKillOptions_C_ExecuteUbergraph_WBP_TeamKillOptions::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TeamKillOptions_C_ExecuteUbergraph_WBP_TeamKillOptions, K2Node_CustomEvent_InString) == 0x0000A0, "Member 'WBP_TeamKillOptions_C_ExecuteUbergraph_WBP_TeamKillOptions::K2Node_CustomEvent_InString' has a wrong offset!");
static_assert(offsetof(WBP_TeamKillOptions_C_ExecuteUbergraph_WBP_TeamKillOptions, K2Node_CustomEvent_Value) == 0x0000B0, "Member 'WBP_TeamKillOptions_C_ExecuteUbergraph_WBP_TeamKillOptions::K2Node_CustomEvent_Value' has a wrong offset!");
static_assert(offsetof(WBP_TeamKillOptions_C_ExecuteUbergraph_WBP_TeamKillOptions, CallFunc_Conv_StringToText_ReturnValue) == 0x0000B8, "Member 'WBP_TeamKillOptions_C_ExecuteUbergraph_WBP_TeamKillOptions::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TeamKillOptions_C_ExecuteUbergraph_WBP_TeamKillOptions, CallFunc_Conv_IntToText_ReturnValue) == 0x0000D0, "Member 'WBP_TeamKillOptions_C_ExecuteUbergraph_WBP_TeamKillOptions::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TeamKillOptions_C_ExecuteUbergraph_WBP_TeamKillOptions, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000E8, "Member 'WBP_TeamKillOptions_C_ExecuteUbergraph_WBP_TeamKillOptions::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_TeamKillOptions_C_ExecuteUbergraph_WBP_TeamKillOptions, K2Node_MakeArray_Array_1) == 0x000128, "Member 'WBP_TeamKillOptions_C_ExecuteUbergraph_WBP_TeamKillOptions::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_TeamKillOptions_C_ExecuteUbergraph_WBP_TeamKillOptions, CallFunc_Format_ReturnValue_1) == 0x000138, "Member 'WBP_TeamKillOptions_C_ExecuteUbergraph_WBP_TeamKillOptions::CallFunc_Format_ReturnValue_1' has a wrong offset!");

// Function WBP_TeamKillOptions.WBP_TeamKillOptions_C.SetNameAndPrevKills
// 0x0018 (0x0018 - 0x0000)
struct WBP_TeamKillOptions_C_SetNameAndPrevKills final
{
public:
	class FString                                 inString;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         Value;                                             // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TeamKillOptions_C_SetNameAndPrevKills) == 0x000008, "Wrong alignment on WBP_TeamKillOptions_C_SetNameAndPrevKills");
static_assert(sizeof(WBP_TeamKillOptions_C_SetNameAndPrevKills) == 0x000018, "Wrong size on WBP_TeamKillOptions_C_SetNameAndPrevKills");
static_assert(offsetof(WBP_TeamKillOptions_C_SetNameAndPrevKills, inString) == 0x000000, "Member 'WBP_TeamKillOptions_C_SetNameAndPrevKills::inString' has a wrong offset!");
static_assert(offsetof(WBP_TeamKillOptions_C_SetNameAndPrevKills, Value) == 0x000010, "Member 'WBP_TeamKillOptions_C_SetNameAndPrevKills::Value' has a wrong offset!");

// Function WBP_TeamKillOptions.WBP_TeamKillOptions_C.ShowMessage
// 0x0018 (0x0018 - 0x0000)
struct WBP_TeamKillOptions_C_ShowMessage final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_TeamKillOptions_C_ShowMessage) == 0x000008, "Wrong alignment on WBP_TeamKillOptions_C_ShowMessage");
static_assert(sizeof(WBP_TeamKillOptions_C_ShowMessage) == 0x000018, "Wrong size on WBP_TeamKillOptions_C_ShowMessage");
static_assert(offsetof(WBP_TeamKillOptions_C_ShowMessage, InText) == 0x000000, "Member 'WBP_TeamKillOptions_C_ShowMessage::InText' has a wrong offset!");

}

