#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Mission_PlayerScoreList

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Mission_PlayerScoreList.WBP_Mission_PlayerScoreList_C
// 0x0038 (0x0298 - 0x0260)
class UWBP_Mission_PlayerScoreList_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UScrollBox*                             ScrollBox_List;                                    // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         TeamTotal_Box;                                     // 0x0270(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_PlayerName;                              // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_TotalScore;                              // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         TotalScore;                                        // 0x0288(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28C[0x4];                                      // 0x028C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGBPlayerState*                         PlayerState;                                       // 0x0290(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	ESlateVisibility GetTotalTeamBoxVis();
	void Construct();
	void BindPlayerScores();
	void OnPlayerScoresUpdated(class AGBPlayerState* PlayerState_0);
	void ExecuteUbergraph_WBP_Mission_PlayerScoreList(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Mission_PlayerScoreList_C">();
	}
	static class UWBP_Mission_PlayerScoreList_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Mission_PlayerScoreList_C>();
	}
};
static_assert(alignof(UWBP_Mission_PlayerScoreList_C) == 0x000008, "Wrong alignment on UWBP_Mission_PlayerScoreList_C");
static_assert(sizeof(UWBP_Mission_PlayerScoreList_C) == 0x000298, "Wrong size on UWBP_Mission_PlayerScoreList_C");
static_assert(offsetof(UWBP_Mission_PlayerScoreList_C, UberGraphFrame) == 0x000260, "Member 'UWBP_Mission_PlayerScoreList_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Mission_PlayerScoreList_C, ScrollBox_List) == 0x000268, "Member 'UWBP_Mission_PlayerScoreList_C::ScrollBox_List' has a wrong offset!");
static_assert(offsetof(UWBP_Mission_PlayerScoreList_C, TeamTotal_Box) == 0x000270, "Member 'UWBP_Mission_PlayerScoreList_C::TeamTotal_Box' has a wrong offset!");
static_assert(offsetof(UWBP_Mission_PlayerScoreList_C, TextBlock_PlayerName) == 0x000278, "Member 'UWBP_Mission_PlayerScoreList_C::TextBlock_PlayerName' has a wrong offset!");
static_assert(offsetof(UWBP_Mission_PlayerScoreList_C, TextBlock_TotalScore) == 0x000280, "Member 'UWBP_Mission_PlayerScoreList_C::TextBlock_TotalScore' has a wrong offset!");
static_assert(offsetof(UWBP_Mission_PlayerScoreList_C, TotalScore) == 0x000288, "Member 'UWBP_Mission_PlayerScoreList_C::TotalScore' has a wrong offset!");
static_assert(offsetof(UWBP_Mission_PlayerScoreList_C, PlayerState) == 0x000290, "Member 'UWBP_Mission_PlayerScoreList_C::PlayerState' has a wrong offset!");

}

