#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HotspotListEntry

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_HotspotListEntry.WBP_HotspotListEntry_C.Get_CheckBox_WholeItem_ToolTipWidget_0
// 0x0008 (0x0008 - 0x0000)
struct WBP_HotspotListEntry_C_Get_CheckBox_WholeItem_ToolTipWidget_0 final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HotspotListEntry_C_Get_CheckBox_WholeItem_ToolTipWidget_0) == 0x000008, "Wrong alignment on WBP_HotspotListEntry_C_Get_CheckBox_WholeItem_ToolTipWidget_0");
static_assert(sizeof(WBP_HotspotListEntry_C_Get_CheckBox_WholeItem_ToolTipWidget_0) == 0x000008, "Wrong size on WBP_HotspotListEntry_C_Get_CheckBox_WholeItem_ToolTipWidget_0");
static_assert(offsetof(WBP_HotspotListEntry_C_Get_CheckBox_WholeItem_ToolTipWidget_0, ReturnValue) == 0x000000, "Member 'WBP_HotspotListEntry_C_Get_CheckBox_WholeItem_ToolTipWidget_0::ReturnValue' has a wrong offset!");

// Function WBP_HotspotListEntry.WBP_HotspotListEntry_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_HotspotListEntry_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_HotspotListEntry_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_HotspotListEntry_C_PreConstruct");
static_assert(sizeof(WBP_HotspotListEntry_C_PreConstruct) == 0x000001, "Wrong size on WBP_HotspotListEntry_C_PreConstruct");
static_assert(offsetof(WBP_HotspotListEntry_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_HotspotListEntry_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_HotspotListEntry.WBP_HotspotListEntry_C.BndEvt__WBP_HotspotListEntry_CheckBox_WholeItem_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_HotspotListEntry_C_BndEvt__WBP_HotspotListEntry_CheckBox_WholeItem_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_HotspotListEntry_C_BndEvt__WBP_HotspotListEntry_CheckBox_WholeItem_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on WBP_HotspotListEntry_C_BndEvt__WBP_HotspotListEntry_CheckBox_WholeItem_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(sizeof(WBP_HotspotListEntry_C_BndEvt__WBP_HotspotListEntry_CheckBox_WholeItem_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong size on WBP_HotspotListEntry_C_BndEvt__WBP_HotspotListEntry_CheckBox_WholeItem_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(offsetof(WBP_HotspotListEntry_C_BndEvt__WBP_HotspotListEntry_CheckBox_WholeItem_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature, bIsChecked) == 0x000000, "Member 'WBP_HotspotListEntry_C_BndEvt__WBP_HotspotListEntry_CheckBox_WholeItem_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature::bIsChecked' has a wrong offset!");

// Function WBP_HotspotListEntry.WBP_HotspotListEntry_C.ExecuteUbergraph_WBP_HotspotListEntry
// 0x0020 (0x0020 - 0x0000)
struct WBP_HotspotListEntry_C_ExecuteUbergraph_WBP_HotspotListEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDoubleClickTime_ReturnValue;           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_ComponentBoundEvent_bIsChecked;             // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetTimeSeconds_ReturnValue;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTimeSeconds_ReturnValue_1;             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_HotspotListEntry_C_ExecuteUbergraph_WBP_HotspotListEntry) == 0x000004, "Wrong alignment on WBP_HotspotListEntry_C_ExecuteUbergraph_WBP_HotspotListEntry");
static_assert(sizeof(WBP_HotspotListEntry_C_ExecuteUbergraph_WBP_HotspotListEntry) == 0x000020, "Wrong size on WBP_HotspotListEntry_C_ExecuteUbergraph_WBP_HotspotListEntry");
static_assert(offsetof(WBP_HotspotListEntry_C_ExecuteUbergraph_WBP_HotspotListEntry, EntryPoint) == 0x000000, "Member 'WBP_HotspotListEntry_C_ExecuteUbergraph_WBP_HotspotListEntry::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_HotspotListEntry_C_ExecuteUbergraph_WBP_HotspotListEntry, CallFunc_GetDoubleClickTime_ReturnValue) == 0x000004, "Member 'WBP_HotspotListEntry_C_ExecuteUbergraph_WBP_HotspotListEntry::CallFunc_GetDoubleClickTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HotspotListEntry_C_ExecuteUbergraph_WBP_HotspotListEntry, Temp_bool_Variable) == 0x000008, "Member 'WBP_HotspotListEntry_C_ExecuteUbergraph_WBP_HotspotListEntry::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HotspotListEntry_C_ExecuteUbergraph_WBP_HotspotListEntry, Temp_byte_Variable) == 0x000009, "Member 'WBP_HotspotListEntry_C_ExecuteUbergraph_WBP_HotspotListEntry::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HotspotListEntry_C_ExecuteUbergraph_WBP_HotspotListEntry, Temp_byte_Variable_1) == 0x00000A, "Member 'WBP_HotspotListEntry_C_ExecuteUbergraph_WBP_HotspotListEntry::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_HotspotListEntry_C_ExecuteUbergraph_WBP_HotspotListEntry, K2Node_Event_IsDesignTime) == 0x00000B, "Member 'WBP_HotspotListEntry_C_ExecuteUbergraph_WBP_HotspotListEntry::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_HotspotListEntry_C_ExecuteUbergraph_WBP_HotspotListEntry, K2Node_ComponentBoundEvent_bIsChecked) == 0x00000C, "Member 'WBP_HotspotListEntry_C_ExecuteUbergraph_WBP_HotspotListEntry::K2Node_ComponentBoundEvent_bIsChecked' has a wrong offset!");
static_assert(offsetof(WBP_HotspotListEntry_C_ExecuteUbergraph_WBP_HotspotListEntry, K2Node_Select_Default) == 0x00000D, "Member 'WBP_HotspotListEntry_C_ExecuteUbergraph_WBP_HotspotListEntry::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_HotspotListEntry_C_ExecuteUbergraph_WBP_HotspotListEntry, CallFunc_GetTimeSeconds_ReturnValue) == 0x000010, "Member 'WBP_HotspotListEntry_C_ExecuteUbergraph_WBP_HotspotListEntry::CallFunc_GetTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HotspotListEntry_C_ExecuteUbergraph_WBP_HotspotListEntry, CallFunc_GetTimeSeconds_ReturnValue_1) == 0x000014, "Member 'WBP_HotspotListEntry_C_ExecuteUbergraph_WBP_HotspotListEntry::CallFunc_GetTimeSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HotspotListEntry_C_ExecuteUbergraph_WBP_HotspotListEntry, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000018, "Member 'WBP_HotspotListEntry_C_ExecuteUbergraph_WBP_HotspotListEntry::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HotspotListEntry_C_ExecuteUbergraph_WBP_HotspotListEntry, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00001C, "Member 'WBP_HotspotListEntry_C_ExecuteUbergraph_WBP_HotspotListEntry::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");

}

