#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CampaignNewsFeed

#include "Basic.hpp"

#include "GroundBranch_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_CampaignNewsFeed.WBP_CampaignNewsFeed_C.ExecuteUbergraph_WBP_CampaignNewsFeed
// 0x00E8 (0x00E8 - 0x0000)
struct WBP_CampaignNewsFeed_C_ExecuteUbergraph_WBP_CampaignNewsFeed final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UGBHotspotDataAsset*                    K2Node_CustomEvent_NewHotspotRef;                  // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHotspotNews                           CallFunc_Array_Get_Item;                           // 0x0028(0x0018)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_47[0x1];                                       // 0x0047(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E[0x2];                                       // 0x004E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0060(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_2;             // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_76[0x2];                                       // 0x0076(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Min_ReturnValue;                          // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRangeFromStream_ReturnValue; // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              CallFunc_FromDays_ReturnValue;                     // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDateTime                              CallFunc_Add_DateTimeTimespan_ReturnValue;         // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRangeFromStream_ReturnValue; // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_CampaignNewsEntry_C*               CallFunc_Create_ReturnValue;                       // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRandomStream                          CallFunc_MakeRandomStream_ReturnValue;             // 0x00C0(0x0008)(ZeroConstructor, NoDestructor)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Array_Get_Item_1;                         // 0x00D0(0x0018)()
};
static_assert(alignof(WBP_CampaignNewsFeed_C_ExecuteUbergraph_WBP_CampaignNewsFeed) == 0x000008, "Wrong alignment on WBP_CampaignNewsFeed_C_ExecuteUbergraph_WBP_CampaignNewsFeed");
static_assert(sizeof(WBP_CampaignNewsFeed_C_ExecuteUbergraph_WBP_CampaignNewsFeed) == 0x0000E8, "Wrong size on WBP_CampaignNewsFeed_C_ExecuteUbergraph_WBP_CampaignNewsFeed");
static_assert(offsetof(WBP_CampaignNewsFeed_C_ExecuteUbergraph_WBP_CampaignNewsFeed, EntryPoint) == 0x000000, "Member 'WBP_CampaignNewsFeed_C_ExecuteUbergraph_WBP_CampaignNewsFeed::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CampaignNewsFeed_C_ExecuteUbergraph_WBP_CampaignNewsFeed, Temp_int_Array_Index_Variable) == 0x000004, "Member 'WBP_CampaignNewsFeed_C_ExecuteUbergraph_WBP_CampaignNewsFeed::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CampaignNewsFeed_C_ExecuteUbergraph_WBP_CampaignNewsFeed, Temp_int_Variable) == 0x000008, "Member 'WBP_CampaignNewsFeed_C_ExecuteUbergraph_WBP_CampaignNewsFeed::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CampaignNewsFeed_C_ExecuteUbergraph_WBP_CampaignNewsFeed, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'WBP_CampaignNewsFeed_C_ExecuteUbergraph_WBP_CampaignNewsFeed::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_CampaignNewsFeed_C_ExecuteUbergraph_WBP_CampaignNewsFeed, K2Node_Event_IsDesignTime) == 0x00001C, "Member 'WBP_CampaignNewsFeed_C_ExecuteUbergraph_WBP_CampaignNewsFeed::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_CampaignNewsFeed_C_ExecuteUbergraph_WBP_CampaignNewsFeed, K2Node_CustomEvent_NewHotspotRef) == 0x000020, "Member 'WBP_CampaignNewsFeed_C_ExecuteUbergraph_WBP_CampaignNewsFeed::K2Node_CustomEvent_NewHotspotRef' has a wrong offset!");
static_assert(offsetof(WBP_CampaignNewsFeed_C_ExecuteUbergraph_WBP_CampaignNewsFeed, CallFunc_Array_Get_Item) == 0x000028, "Member 'WBP_CampaignNewsFeed_C_ExecuteUbergraph_WBP_CampaignNewsFeed::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_CampaignNewsFeed_C_ExecuteUbergraph_WBP_CampaignNewsFeed, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'WBP_CampaignNewsFeed_C_ExecuteUbergraph_WBP_CampaignNewsFeed::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CampaignNewsFeed_C_ExecuteUbergraph_WBP_CampaignNewsFeed, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000044, "Member 'WBP_CampaignNewsFeed_C_ExecuteUbergraph_WBP_CampaignNewsFeed::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CampaignNewsFeed_C_ExecuteUbergraph_WBP_CampaignNewsFeed, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000045, "Member 'WBP_CampaignNewsFeed_C_ExecuteUbergraph_WBP_CampaignNewsFeed::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CampaignNewsFeed_C_ExecuteUbergraph_WBP_CampaignNewsFeed, CallFunc_BooleanAND_ReturnValue) == 0x000046, "Member 'WBP_CampaignNewsFeed_C_ExecuteUbergraph_WBP_CampaignNewsFeed::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CampaignNewsFeed_C_ExecuteUbergraph_WBP_CampaignNewsFeed, Temp_int_Loop_Counter_Variable) == 0x000048, "Member 'WBP_CampaignNewsFeed_C_ExecuteUbergraph_WBP_CampaignNewsFeed::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CampaignNewsFeed_C_ExecuteUbergraph_WBP_CampaignNewsFeed, CallFunc_IsValid_ReturnValue) == 0x00004C, "Member 'WBP_CampaignNewsFeed_C_ExecuteUbergraph_WBP_CampaignNewsFeed::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CampaignNewsFeed_C_ExecuteUbergraph_WBP_CampaignNewsFeed, CallFunc_Less_IntInt_ReturnValue) == 0x00004D, "Member 'WBP_CampaignNewsFeed_C_ExecuteUbergraph_WBP_CampaignNewsFeed::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CampaignNewsFeed_C_ExecuteUbergraph_WBP_CampaignNewsFeed, CallFunc_Add_IntInt_ReturnValue) == 0x000050, "Member 'WBP_CampaignNewsFeed_C_ExecuteUbergraph_WBP_CampaignNewsFeed::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CampaignNewsFeed_C_ExecuteUbergraph_WBP_CampaignNewsFeed, CallFunc_Greater_IntInt_ReturnValue) == 0x000054, "Member 'WBP_CampaignNewsFeed_C_ExecuteUbergraph_WBP_CampaignNewsFeed::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CampaignNewsFeed_C_ExecuteUbergraph_WBP_CampaignNewsFeed, CallFunc_Subtract_IntInt_ReturnValue) == 0x000058, "Member 'WBP_CampaignNewsFeed_C_ExecuteUbergraph_WBP_CampaignNewsFeed::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CampaignNewsFeed_C_ExecuteUbergraph_WBP_CampaignNewsFeed, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000060, "Member 'WBP_CampaignNewsFeed_C_ExecuteUbergraph_WBP_CampaignNewsFeed::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CampaignNewsFeed_C_ExecuteUbergraph_WBP_CampaignNewsFeed, CallFunc_Array_Length_ReturnValue_1) == 0x000068, "Member 'WBP_CampaignNewsFeed_C_ExecuteUbergraph_WBP_CampaignNewsFeed::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CampaignNewsFeed_C_ExecuteUbergraph_WBP_CampaignNewsFeed, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x00006C, "Member 'WBP_CampaignNewsFeed_C_ExecuteUbergraph_WBP_CampaignNewsFeed::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CampaignNewsFeed_C_ExecuteUbergraph_WBP_CampaignNewsFeed, CallFunc_Array_Length_ReturnValue_2) == 0x000070, "Member 'WBP_CampaignNewsFeed_C_ExecuteUbergraph_WBP_CampaignNewsFeed::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CampaignNewsFeed_C_ExecuteUbergraph_WBP_CampaignNewsFeed, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000074, "Member 'WBP_CampaignNewsFeed_C_ExecuteUbergraph_WBP_CampaignNewsFeed::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CampaignNewsFeed_C_ExecuteUbergraph_WBP_CampaignNewsFeed, CallFunc_Greater_IntInt_ReturnValue_2) == 0x000075, "Member 'WBP_CampaignNewsFeed_C_ExecuteUbergraph_WBP_CampaignNewsFeed::CallFunc_Greater_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CampaignNewsFeed_C_ExecuteUbergraph_WBP_CampaignNewsFeed, CallFunc_Min_ReturnValue) == 0x000078, "Member 'WBP_CampaignNewsFeed_C_ExecuteUbergraph_WBP_CampaignNewsFeed::CallFunc_Min_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CampaignNewsFeed_C_ExecuteUbergraph_WBP_CampaignNewsFeed, CallFunc_BooleanAND_ReturnValue_1) == 0x00007C, "Member 'WBP_CampaignNewsFeed_C_ExecuteUbergraph_WBP_CampaignNewsFeed::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CampaignNewsFeed_C_ExecuteUbergraph_WBP_CampaignNewsFeed, CallFunc_RandomFloatInRangeFromStream_ReturnValue) == 0x000080, "Member 'WBP_CampaignNewsFeed_C_ExecuteUbergraph_WBP_CampaignNewsFeed::CallFunc_RandomFloatInRangeFromStream_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CampaignNewsFeed_C_ExecuteUbergraph_WBP_CampaignNewsFeed, CallFunc_FromDays_ReturnValue) == 0x000088, "Member 'WBP_CampaignNewsFeed_C_ExecuteUbergraph_WBP_CampaignNewsFeed::CallFunc_FromDays_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CampaignNewsFeed_C_ExecuteUbergraph_WBP_CampaignNewsFeed, CallFunc_BreakVector2D_X) == 0x000090, "Member 'WBP_CampaignNewsFeed_C_ExecuteUbergraph_WBP_CampaignNewsFeed::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WBP_CampaignNewsFeed_C_ExecuteUbergraph_WBP_CampaignNewsFeed, CallFunc_BreakVector2D_Y) == 0x000094, "Member 'WBP_CampaignNewsFeed_C_ExecuteUbergraph_WBP_CampaignNewsFeed::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WBP_CampaignNewsFeed_C_ExecuteUbergraph_WBP_CampaignNewsFeed, CallFunc_Add_DateTimeTimespan_ReturnValue) == 0x000098, "Member 'WBP_CampaignNewsFeed_C_ExecuteUbergraph_WBP_CampaignNewsFeed::CallFunc_Add_DateTimeTimespan_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CampaignNewsFeed_C_ExecuteUbergraph_WBP_CampaignNewsFeed, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000A0, "Member 'WBP_CampaignNewsFeed_C_ExecuteUbergraph_WBP_CampaignNewsFeed::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CampaignNewsFeed_C_ExecuteUbergraph_WBP_CampaignNewsFeed, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x0000A4, "Member 'WBP_CampaignNewsFeed_C_ExecuteUbergraph_WBP_CampaignNewsFeed::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CampaignNewsFeed_C_ExecuteUbergraph_WBP_CampaignNewsFeed, CallFunc_Add_FloatFloat_ReturnValue) == 0x0000A8, "Member 'WBP_CampaignNewsFeed_C_ExecuteUbergraph_WBP_CampaignNewsFeed::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CampaignNewsFeed_C_ExecuteUbergraph_WBP_CampaignNewsFeed, CallFunc_RandomIntegerInRangeFromStream_ReturnValue) == 0x0000AC, "Member 'WBP_CampaignNewsFeed_C_ExecuteUbergraph_WBP_CampaignNewsFeed::CallFunc_RandomIntegerInRangeFromStream_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CampaignNewsFeed_C_ExecuteUbergraph_WBP_CampaignNewsFeed, CallFunc_FTrunc_ReturnValue) == 0x0000B0, "Member 'WBP_CampaignNewsFeed_C_ExecuteUbergraph_WBP_CampaignNewsFeed::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CampaignNewsFeed_C_ExecuteUbergraph_WBP_CampaignNewsFeed, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000B4, "Member 'WBP_CampaignNewsFeed_C_ExecuteUbergraph_WBP_CampaignNewsFeed::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CampaignNewsFeed_C_ExecuteUbergraph_WBP_CampaignNewsFeed, CallFunc_Create_ReturnValue) == 0x0000B8, "Member 'WBP_CampaignNewsFeed_C_ExecuteUbergraph_WBP_CampaignNewsFeed::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CampaignNewsFeed_C_ExecuteUbergraph_WBP_CampaignNewsFeed, CallFunc_MakeRandomStream_ReturnValue) == 0x0000C0, "Member 'WBP_CampaignNewsFeed_C_ExecuteUbergraph_WBP_CampaignNewsFeed::CallFunc_MakeRandomStream_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CampaignNewsFeed_C_ExecuteUbergraph_WBP_CampaignNewsFeed, CallFunc_AddChild_ReturnValue) == 0x0000C8, "Member 'WBP_CampaignNewsFeed_C_ExecuteUbergraph_WBP_CampaignNewsFeed::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CampaignNewsFeed_C_ExecuteUbergraph_WBP_CampaignNewsFeed, CallFunc_Array_Get_Item_1) == 0x0000D0, "Member 'WBP_CampaignNewsFeed_C_ExecuteUbergraph_WBP_CampaignNewsFeed::CallFunc_Array_Get_Item_1' has a wrong offset!");

// Function WBP_CampaignNewsFeed.WBP_CampaignNewsFeed_C.SetCurrentHotspot
// 0x0008 (0x0008 - 0x0000)
struct WBP_CampaignNewsFeed_C_SetCurrentHotspot final
{
public:
	class UGBHotspotDataAsset*                    NewHotspotRef;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CampaignNewsFeed_C_SetCurrentHotspot) == 0x000008, "Wrong alignment on WBP_CampaignNewsFeed_C_SetCurrentHotspot");
static_assert(sizeof(WBP_CampaignNewsFeed_C_SetCurrentHotspot) == 0x000008, "Wrong size on WBP_CampaignNewsFeed_C_SetCurrentHotspot");
static_assert(offsetof(WBP_CampaignNewsFeed_C_SetCurrentHotspot, NewHotspotRef) == 0x000000, "Member 'WBP_CampaignNewsFeed_C_SetCurrentHotspot::NewHotspotRef' has a wrong offset!");

// Function WBP_CampaignNewsFeed.WBP_CampaignNewsFeed_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_CampaignNewsFeed_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_CampaignNewsFeed_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_CampaignNewsFeed_C_PreConstruct");
static_assert(sizeof(WBP_CampaignNewsFeed_C_PreConstruct) == 0x000001, "Wrong size on WBP_CampaignNewsFeed_C_PreConstruct");
static_assert(offsetof(WBP_CampaignNewsFeed_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_CampaignNewsFeed_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

