#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Campaign_MissionImageViewer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GroundBranch_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Campaign_MissionImageViewer.WBP_Campaign_MissionImageViewer_C
// 0x0208 (0x0468 - 0x0260)
class UWBP_Campaign_MissionImageViewer_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeOutUsage;                                      // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_ImageCaption;                               // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_ImageCaption_InGameMap;                     // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_ImageCaption_InGameMap_1;                   // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_ImageCycler;                                // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_UsageBox;                                   // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_GoBack;                                     // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_GoForwards;                                 // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_PlaceholderText;                     // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_MissionImage;                                // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_InGameMap;                                 // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_ImageCaption;                            // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_ImageCaption_1;                          // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_ImageCaption_InGameMap;                  // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_ImageCaption_InGameMap_1;                // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_ImageNumber;                             // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_NoIntelImages;                           // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UThrobber*                              Throbber_Loading;                                  // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_UsageBox;                              // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Campaign_MissionImageTab_C*        SelectedTab;                                       // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SelectedTabIndex;                                  // 0x0308(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30C[0x4];                                      // 0x030C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<int32, class UTexture2D*>                LoadedImages;                                      // 0x0310(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   NoImagesAvailableText;                             // 0x0360(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   LoadingImagesText;                                 // 0x0378(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   CurrentImageCaption;                               // 0x0390(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UWBP_Campaign_InGameMapMissionImage_C*  InGameMapWidget;                                   // 0x03A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 InGameMapName;                                     // 0x03B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<struct FGBMissionImage>                MissionImageList;                                  // 0x03C0(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	TArray<struct FGBMapMarker>                   MissionMapMarkers;                                 // 0x03D0(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	float                                         MapZoomMinimum;                                    // 0x03E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MapZoomMaximum;                                    // 0x03E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MouseWheelDeltaScaling;                            // 0x03E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MapZoom;                                           // 0x03EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              MapTranslation;                                    // 0x03F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CursorDragScale;                                   // 0x03F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         NotADragCursorDeltaSq;                             // 0x03FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              MapOverlaySize;                                    // 0x0400(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InGameMapIsBeingDisplayed;                         // 0x0408(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          InGameMapUsageBoxIsBeingDisplayed;                 // 0x0409(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_40A[0x6];                                      // 0x040A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGBObjectiveData                       MissionObjectiveData;                              // 0x0410(0x0020)(Edit, BlueprintVisible, ExposeOnSpawn)
	class FName                                   HotspotCodename;                                   // 0x0430(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         MissionSequenceNo;                                 // 0x0438(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_43C[0x4];                                      // 0x043C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 ImageFileNumbers;                                  // 0x0440(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         CurrentFileIndex;                                  // 0x0450(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_454[0x4];                                      // 0x0454(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(int32 NewImageNumber, int32 NewPhotoFileNumber, bool bIsMapImage)> OnSelectedNewImage; // 0x0458(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void IsMapImage(const struct FGBMissionImage& InMissionImage, bool* bIsMapImage);
	void ClampMapTranslationToAvailableSize(const struct FVector2D& DesiredTranslation, struct FVector2D* ClampedTranslation);
	struct FEventReply OnMouseMove(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	struct FEventReply OnMouseWheel(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void IsHoveringOnMap(bool* bIsHoveringOnMap);
	void Construct();
	void SetNewTabIndex(int32 NewTabIndex);
	void DisplayImage(int32 ImageIndex);
	void SetImage(class UTexture2D* ImageTexture);
	void ChangeImageVisibility(bool bShowImage);
	void SetNewMissionImageList(const TArray<struct FGBMissionImage>& MissionImageList_0);
	void UpdateMissionList();
	void BndEvt__WBP_Campaign_MissionImageViewer_Button_GoBack_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_Campaign_MissionImageViewer_Button_GoForwards_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void LoadInGameMap(const class FString& Filename);
	void SetNewMissionMapMarkers(const TArray<struct FGBMapMarker>& MapMarkerList);
	void RepositionAndResizeMapImage();
	void ShowMapUsageBox();
	void HideMapUsageBox();
	void UpdateMapSymbolScaling();
	void ExecuteUbergraph_WBP_Campaign_MissionImageViewer(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Campaign_MissionImageViewer_C">();
	}
	static class UWBP_Campaign_MissionImageViewer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Campaign_MissionImageViewer_C>();
	}
};
static_assert(alignof(UWBP_Campaign_MissionImageViewer_C) == 0x000008, "Wrong alignment on UWBP_Campaign_MissionImageViewer_C");
static_assert(sizeof(UWBP_Campaign_MissionImageViewer_C) == 0x000468, "Wrong size on UWBP_Campaign_MissionImageViewer_C");
static_assert(offsetof(UWBP_Campaign_MissionImageViewer_C, UberGraphFrame) == 0x000260, "Member 'UWBP_Campaign_MissionImageViewer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Campaign_MissionImageViewer_C, FadeOutUsage) == 0x000268, "Member 'UWBP_Campaign_MissionImageViewer_C::FadeOutUsage' has a wrong offset!");
static_assert(offsetof(UWBP_Campaign_MissionImageViewer_C, Border_ImageCaption) == 0x000270, "Member 'UWBP_Campaign_MissionImageViewer_C::Border_ImageCaption' has a wrong offset!");
static_assert(offsetof(UWBP_Campaign_MissionImageViewer_C, Border_ImageCaption_InGameMap) == 0x000278, "Member 'UWBP_Campaign_MissionImageViewer_C::Border_ImageCaption_InGameMap' has a wrong offset!");
static_assert(offsetof(UWBP_Campaign_MissionImageViewer_C, Border_ImageCaption_InGameMap_1) == 0x000280, "Member 'UWBP_Campaign_MissionImageViewer_C::Border_ImageCaption_InGameMap_1' has a wrong offset!");
static_assert(offsetof(UWBP_Campaign_MissionImageViewer_C, Border_ImageCycler) == 0x000288, "Member 'UWBP_Campaign_MissionImageViewer_C::Border_ImageCycler' has a wrong offset!");
static_assert(offsetof(UWBP_Campaign_MissionImageViewer_C, Border_UsageBox) == 0x000290, "Member 'UWBP_Campaign_MissionImageViewer_C::Border_UsageBox' has a wrong offset!");
static_assert(offsetof(UWBP_Campaign_MissionImageViewer_C, Button_GoBack) == 0x000298, "Member 'UWBP_Campaign_MissionImageViewer_C::Button_GoBack' has a wrong offset!");
static_assert(offsetof(UWBP_Campaign_MissionImageViewer_C, Button_GoForwards) == 0x0002A0, "Member 'UWBP_Campaign_MissionImageViewer_C::Button_GoForwards' has a wrong offset!");
static_assert(offsetof(UWBP_Campaign_MissionImageViewer_C, HorizontalBox_PlaceholderText) == 0x0002A8, "Member 'UWBP_Campaign_MissionImageViewer_C::HorizontalBox_PlaceholderText' has a wrong offset!");
static_assert(offsetof(UWBP_Campaign_MissionImageViewer_C, Image_MissionImage) == 0x0002B0, "Member 'UWBP_Campaign_MissionImageViewer_C::Image_MissionImage' has a wrong offset!");
static_assert(offsetof(UWBP_Campaign_MissionImageViewer_C, Overlay_InGameMap) == 0x0002B8, "Member 'UWBP_Campaign_MissionImageViewer_C::Overlay_InGameMap' has a wrong offset!");
static_assert(offsetof(UWBP_Campaign_MissionImageViewer_C, TextBlock_ImageCaption) == 0x0002C0, "Member 'UWBP_Campaign_MissionImageViewer_C::TextBlock_ImageCaption' has a wrong offset!");
static_assert(offsetof(UWBP_Campaign_MissionImageViewer_C, TextBlock_ImageCaption_1) == 0x0002C8, "Member 'UWBP_Campaign_MissionImageViewer_C::TextBlock_ImageCaption_1' has a wrong offset!");
static_assert(offsetof(UWBP_Campaign_MissionImageViewer_C, TextBlock_ImageCaption_InGameMap) == 0x0002D0, "Member 'UWBP_Campaign_MissionImageViewer_C::TextBlock_ImageCaption_InGameMap' has a wrong offset!");
static_assert(offsetof(UWBP_Campaign_MissionImageViewer_C, TextBlock_ImageCaption_InGameMap_1) == 0x0002D8, "Member 'UWBP_Campaign_MissionImageViewer_C::TextBlock_ImageCaption_InGameMap_1' has a wrong offset!");
static_assert(offsetof(UWBP_Campaign_MissionImageViewer_C, TextBlock_ImageNumber) == 0x0002E0, "Member 'UWBP_Campaign_MissionImageViewer_C::TextBlock_ImageNumber' has a wrong offset!");
static_assert(offsetof(UWBP_Campaign_MissionImageViewer_C, TextBlock_NoIntelImages) == 0x0002E8, "Member 'UWBP_Campaign_MissionImageViewer_C::TextBlock_NoIntelImages' has a wrong offset!");
static_assert(offsetof(UWBP_Campaign_MissionImageViewer_C, Throbber_Loading) == 0x0002F0, "Member 'UWBP_Campaign_MissionImageViewer_C::Throbber_Loading' has a wrong offset!");
static_assert(offsetof(UWBP_Campaign_MissionImageViewer_C, VerticalBox_UsageBox) == 0x0002F8, "Member 'UWBP_Campaign_MissionImageViewer_C::VerticalBox_UsageBox' has a wrong offset!");
static_assert(offsetof(UWBP_Campaign_MissionImageViewer_C, SelectedTab) == 0x000300, "Member 'UWBP_Campaign_MissionImageViewer_C::SelectedTab' has a wrong offset!");
static_assert(offsetof(UWBP_Campaign_MissionImageViewer_C, SelectedTabIndex) == 0x000308, "Member 'UWBP_Campaign_MissionImageViewer_C::SelectedTabIndex' has a wrong offset!");
static_assert(offsetof(UWBP_Campaign_MissionImageViewer_C, LoadedImages) == 0x000310, "Member 'UWBP_Campaign_MissionImageViewer_C::LoadedImages' has a wrong offset!");
static_assert(offsetof(UWBP_Campaign_MissionImageViewer_C, NoImagesAvailableText) == 0x000360, "Member 'UWBP_Campaign_MissionImageViewer_C::NoImagesAvailableText' has a wrong offset!");
static_assert(offsetof(UWBP_Campaign_MissionImageViewer_C, LoadingImagesText) == 0x000378, "Member 'UWBP_Campaign_MissionImageViewer_C::LoadingImagesText' has a wrong offset!");
static_assert(offsetof(UWBP_Campaign_MissionImageViewer_C, CurrentImageCaption) == 0x000390, "Member 'UWBP_Campaign_MissionImageViewer_C::CurrentImageCaption' has a wrong offset!");
static_assert(offsetof(UWBP_Campaign_MissionImageViewer_C, InGameMapWidget) == 0x0003A8, "Member 'UWBP_Campaign_MissionImageViewer_C::InGameMapWidget' has a wrong offset!");
static_assert(offsetof(UWBP_Campaign_MissionImageViewer_C, InGameMapName) == 0x0003B0, "Member 'UWBP_Campaign_MissionImageViewer_C::InGameMapName' has a wrong offset!");
static_assert(offsetof(UWBP_Campaign_MissionImageViewer_C, MissionImageList) == 0x0003C0, "Member 'UWBP_Campaign_MissionImageViewer_C::MissionImageList' has a wrong offset!");
static_assert(offsetof(UWBP_Campaign_MissionImageViewer_C, MissionMapMarkers) == 0x0003D0, "Member 'UWBP_Campaign_MissionImageViewer_C::MissionMapMarkers' has a wrong offset!");
static_assert(offsetof(UWBP_Campaign_MissionImageViewer_C, MapZoomMinimum) == 0x0003E0, "Member 'UWBP_Campaign_MissionImageViewer_C::MapZoomMinimum' has a wrong offset!");
static_assert(offsetof(UWBP_Campaign_MissionImageViewer_C, MapZoomMaximum) == 0x0003E4, "Member 'UWBP_Campaign_MissionImageViewer_C::MapZoomMaximum' has a wrong offset!");
static_assert(offsetof(UWBP_Campaign_MissionImageViewer_C, MouseWheelDeltaScaling) == 0x0003E8, "Member 'UWBP_Campaign_MissionImageViewer_C::MouseWheelDeltaScaling' has a wrong offset!");
static_assert(offsetof(UWBP_Campaign_MissionImageViewer_C, MapZoom) == 0x0003EC, "Member 'UWBP_Campaign_MissionImageViewer_C::MapZoom' has a wrong offset!");
static_assert(offsetof(UWBP_Campaign_MissionImageViewer_C, MapTranslation) == 0x0003F0, "Member 'UWBP_Campaign_MissionImageViewer_C::MapTranslation' has a wrong offset!");
static_assert(offsetof(UWBP_Campaign_MissionImageViewer_C, CursorDragScale) == 0x0003F8, "Member 'UWBP_Campaign_MissionImageViewer_C::CursorDragScale' has a wrong offset!");
static_assert(offsetof(UWBP_Campaign_MissionImageViewer_C, NotADragCursorDeltaSq) == 0x0003FC, "Member 'UWBP_Campaign_MissionImageViewer_C::NotADragCursorDeltaSq' has a wrong offset!");
static_assert(offsetof(UWBP_Campaign_MissionImageViewer_C, MapOverlaySize) == 0x000400, "Member 'UWBP_Campaign_MissionImageViewer_C::MapOverlaySize' has a wrong offset!");
static_assert(offsetof(UWBP_Campaign_MissionImageViewer_C, InGameMapIsBeingDisplayed) == 0x000408, "Member 'UWBP_Campaign_MissionImageViewer_C::InGameMapIsBeingDisplayed' has a wrong offset!");
static_assert(offsetof(UWBP_Campaign_MissionImageViewer_C, InGameMapUsageBoxIsBeingDisplayed) == 0x000409, "Member 'UWBP_Campaign_MissionImageViewer_C::InGameMapUsageBoxIsBeingDisplayed' has a wrong offset!");
static_assert(offsetof(UWBP_Campaign_MissionImageViewer_C, MissionObjectiveData) == 0x000410, "Member 'UWBP_Campaign_MissionImageViewer_C::MissionObjectiveData' has a wrong offset!");
static_assert(offsetof(UWBP_Campaign_MissionImageViewer_C, HotspotCodename) == 0x000430, "Member 'UWBP_Campaign_MissionImageViewer_C::HotspotCodename' has a wrong offset!");
static_assert(offsetof(UWBP_Campaign_MissionImageViewer_C, MissionSequenceNo) == 0x000438, "Member 'UWBP_Campaign_MissionImageViewer_C::MissionSequenceNo' has a wrong offset!");
static_assert(offsetof(UWBP_Campaign_MissionImageViewer_C, ImageFileNumbers) == 0x000440, "Member 'UWBP_Campaign_MissionImageViewer_C::ImageFileNumbers' has a wrong offset!");
static_assert(offsetof(UWBP_Campaign_MissionImageViewer_C, CurrentFileIndex) == 0x000450, "Member 'UWBP_Campaign_MissionImageViewer_C::CurrentFileIndex' has a wrong offset!");
static_assert(offsetof(UWBP_Campaign_MissionImageViewer_C, OnSelectedNewImage) == 0x000458, "Member 'UWBP_Campaign_MissionImageViewer_C::OnSelectedNewImage' has a wrong offset!");

}

