#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CampaignNewsEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CampaignNewsEntry.WBP_CampaignNewsEntry_C
// 0x0040 (0x02A0 - 0x0260)
class UWBP_CampaignNewsEntry_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       PopIn;                                             // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_NewDot;                                      // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_NewsItem;                                // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   NewsEntry;                                         // 0x0280(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	struct FDateTime                              Date;                                              // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void Construct();
	void PreConstruct(bool IsDesignTime);
	void ExecuteUbergraph_WBP_CampaignNewsEntry(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CampaignNewsEntry_C">();
	}
	static class UWBP_CampaignNewsEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CampaignNewsEntry_C>();
	}
};
static_assert(alignof(UWBP_CampaignNewsEntry_C) == 0x000008, "Wrong alignment on UWBP_CampaignNewsEntry_C");
static_assert(sizeof(UWBP_CampaignNewsEntry_C) == 0x0002A0, "Wrong size on UWBP_CampaignNewsEntry_C");
static_assert(offsetof(UWBP_CampaignNewsEntry_C, UberGraphFrame) == 0x000260, "Member 'UWBP_CampaignNewsEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CampaignNewsEntry_C, PopIn) == 0x000268, "Member 'UWBP_CampaignNewsEntry_C::PopIn' has a wrong offset!");
static_assert(offsetof(UWBP_CampaignNewsEntry_C, Image_NewDot) == 0x000270, "Member 'UWBP_CampaignNewsEntry_C::Image_NewDot' has a wrong offset!");
static_assert(offsetof(UWBP_CampaignNewsEntry_C, TextBlock_NewsItem) == 0x000278, "Member 'UWBP_CampaignNewsEntry_C::TextBlock_NewsItem' has a wrong offset!");
static_assert(offsetof(UWBP_CampaignNewsEntry_C, NewsEntry) == 0x000280, "Member 'UWBP_CampaignNewsEntry_C::NewsEntry' has a wrong offset!");
static_assert(offsetof(UWBP_CampaignNewsEntry_C, Date) == 0x000298, "Member 'UWBP_CampaignNewsEntry_C::Date' has a wrong offset!");

}

