#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PlatformCustomisation

#include "Basic.hpp"

#include "WBP_IE_Customisation_Master_classes.hpp"
#include "Engine_structs.hpp"
#include "GroundBranch_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_PlatformCustomisation.WBP_PlatformCustomisation_C
// 0x01D8 (0x0560 - 0x0388)
class UWBP_PlatformCustomisation_C final : public UWBP_IE_Customisation_Master_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WBP_PlatformCustomisation_C;        // 0x0388(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Border_5;                                          // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ProgressBar_137;                                   // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox_0;                                       // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_LoadoutSummary_Section_C*          Section_Ammo;                                      // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_LoadoutSummary_Section_C*          Section_Grenade;                                   // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_LoadoutSummary_Section_C*          Section_Misc;                                      // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_140;                                     // 0x03C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_EncumberanceDescription;                 // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_EncumberanceTitle;                       // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_TotalWeight;                             // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Title_LoadoutSummary;                              // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_IE_List_C*                         WBP_DraggableItemsList;                            // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class AGBPlatform*                            PlatformRef;                                       // 0x03F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FPrimaryAssetId>                PouchIds;                                          // 0x03F8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UDataTable*                             ModularPouchList;                                  // 0x0408(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UGBAmmoPouchDragDropPayload*>    ModularAmmoPayloads;                               // 0x0410(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   AmmoPouchContentsText;                             // 0x0420(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  ModularAmmoPouchTags;                              // 0x0438(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  SpecificAmmoPouchTags;                             // 0x0458(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  GrenadeTypeTags;                                   // 0x0478(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  EquipmentTypeTaga;                                 // 0x0498(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  PouchTypeTag;                                      // 0x04B8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTag                           InvItemSocketTag;                                  // 0x04D8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FText                                   EncumberanceHeavy;                                 // 0x04E0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   EncumberanceMedium;                                // 0x04F8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   EncumberanceLight;                                 // 0x0510(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   EncumberanceNone;                                  // 0x0528(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   ToolTip_LoadoutWindow;                             // 0x0540(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FTimerHandle                           LoadoutSummaryTimerHandle;                         // 0x0558(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_PlatformCustomisation(int32 EntryPoint);
	void Destruct();
	void StartLoadoutSummaryTimer();
	void UpdateSummary();
	void Construct();
	void GeneratePouchIds();
	void CreateAmmoPouchPayload(const struct FPrimaryAssetId& InPouchAssetId, const struct FPrimaryAssetId& InAmmoAssetId, EGBAmmoPouchModularity InModularity, const class FText& InDisplayName, TSoftObjectPtr<class UObject> InIcon, const struct FGameplayTagContainer& InInvItemTags, class UGBAmmoPouchDragDropPayload** OutPayload);
	void CreatePouchPayload(const struct FPrimaryAssetId& InPouchAssetId, const struct FPrimaryAssetId& InFillWithId, const class FText& InDisplayName, TSoftObjectPtr<class UObject> InIcon, const struct FGameplayTagContainer& InInvItemTags, class UGBPouchDragDropPayload** OutPayload);
	void AddSpecificAmmPouches();
	void AddModularAmmoPouchPayload(const class FText& InDisplayName, const struct FGameplayTagContainer& InInvItemTags, EGBAmmoPouchModularity InDesiredModularity, const struct FPrimaryAssetId& InDefaultPouchId, const struct FPrimaryAssetId& InDefaultAmmoId, TSoftObjectPtr<class UObject> InIcon);
	void AddModularAmmoPouches();
	void GetPayloadsWithModularPouches(TArray<class UGBInvItemDragDropPayload*>* NewLocalVar_01);
	void AddPouchesForItems(const struct FGameplayTagContainer& InInvItemTagsToFind);
	void GetFillCount(const struct FGameplayTagContainer& InInvItemTags, int32* OutFillCount);
	class UWidget* GetToolTipWidget_0();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_PlatformCustomisation_C">();
	}
	static class UWBP_PlatformCustomisation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_PlatformCustomisation_C>();
	}
};
static_assert(alignof(UWBP_PlatformCustomisation_C) == 0x000008, "Wrong alignment on UWBP_PlatformCustomisation_C");
static_assert(sizeof(UWBP_PlatformCustomisation_C) == 0x000560, "Wrong size on UWBP_PlatformCustomisation_C");
static_assert(offsetof(UWBP_PlatformCustomisation_C, UberGraphFrame_WBP_PlatformCustomisation_C) == 0x000388, "Member 'UWBP_PlatformCustomisation_C::UberGraphFrame_WBP_PlatformCustomisation_C' has a wrong offset!");
static_assert(offsetof(UWBP_PlatformCustomisation_C, Border_5) == 0x000390, "Member 'UWBP_PlatformCustomisation_C::Border_5' has a wrong offset!");
static_assert(offsetof(UWBP_PlatformCustomisation_C, ProgressBar_137) == 0x000398, "Member 'UWBP_PlatformCustomisation_C::ProgressBar_137' has a wrong offset!");
static_assert(offsetof(UWBP_PlatformCustomisation_C, ScrollBox_0) == 0x0003A0, "Member 'UWBP_PlatformCustomisation_C::ScrollBox_0' has a wrong offset!");
static_assert(offsetof(UWBP_PlatformCustomisation_C, Section_Ammo) == 0x0003A8, "Member 'UWBP_PlatformCustomisation_C::Section_Ammo' has a wrong offset!");
static_assert(offsetof(UWBP_PlatformCustomisation_C, Section_Grenade) == 0x0003B0, "Member 'UWBP_PlatformCustomisation_C::Section_Grenade' has a wrong offset!");
static_assert(offsetof(UWBP_PlatformCustomisation_C, Section_Misc) == 0x0003B8, "Member 'UWBP_PlatformCustomisation_C::Section_Misc' has a wrong offset!");
static_assert(offsetof(UWBP_PlatformCustomisation_C, TextBlock_140) == 0x0003C0, "Member 'UWBP_PlatformCustomisation_C::TextBlock_140' has a wrong offset!");
static_assert(offsetof(UWBP_PlatformCustomisation_C, TextBlock_EncumberanceDescription) == 0x0003C8, "Member 'UWBP_PlatformCustomisation_C::TextBlock_EncumberanceDescription' has a wrong offset!");
static_assert(offsetof(UWBP_PlatformCustomisation_C, TextBlock_EncumberanceTitle) == 0x0003D0, "Member 'UWBP_PlatformCustomisation_C::TextBlock_EncumberanceTitle' has a wrong offset!");
static_assert(offsetof(UWBP_PlatformCustomisation_C, TextBlock_TotalWeight) == 0x0003D8, "Member 'UWBP_PlatformCustomisation_C::TextBlock_TotalWeight' has a wrong offset!");
static_assert(offsetof(UWBP_PlatformCustomisation_C, Title_LoadoutSummary) == 0x0003E0, "Member 'UWBP_PlatformCustomisation_C::Title_LoadoutSummary' has a wrong offset!");
static_assert(offsetof(UWBP_PlatformCustomisation_C, WBP_DraggableItemsList) == 0x0003E8, "Member 'UWBP_PlatformCustomisation_C::WBP_DraggableItemsList' has a wrong offset!");
static_assert(offsetof(UWBP_PlatformCustomisation_C, PlatformRef) == 0x0003F0, "Member 'UWBP_PlatformCustomisation_C::PlatformRef' has a wrong offset!");
static_assert(offsetof(UWBP_PlatformCustomisation_C, PouchIds) == 0x0003F8, "Member 'UWBP_PlatformCustomisation_C::PouchIds' has a wrong offset!");
static_assert(offsetof(UWBP_PlatformCustomisation_C, ModularPouchList) == 0x000408, "Member 'UWBP_PlatformCustomisation_C::ModularPouchList' has a wrong offset!");
static_assert(offsetof(UWBP_PlatformCustomisation_C, ModularAmmoPayloads) == 0x000410, "Member 'UWBP_PlatformCustomisation_C::ModularAmmoPayloads' has a wrong offset!");
static_assert(offsetof(UWBP_PlatformCustomisation_C, AmmoPouchContentsText) == 0x000420, "Member 'UWBP_PlatformCustomisation_C::AmmoPouchContentsText' has a wrong offset!");
static_assert(offsetof(UWBP_PlatformCustomisation_C, ModularAmmoPouchTags) == 0x000438, "Member 'UWBP_PlatformCustomisation_C::ModularAmmoPouchTags' has a wrong offset!");
static_assert(offsetof(UWBP_PlatformCustomisation_C, SpecificAmmoPouchTags) == 0x000458, "Member 'UWBP_PlatformCustomisation_C::SpecificAmmoPouchTags' has a wrong offset!");
static_assert(offsetof(UWBP_PlatformCustomisation_C, GrenadeTypeTags) == 0x000478, "Member 'UWBP_PlatformCustomisation_C::GrenadeTypeTags' has a wrong offset!");
static_assert(offsetof(UWBP_PlatformCustomisation_C, EquipmentTypeTaga) == 0x000498, "Member 'UWBP_PlatformCustomisation_C::EquipmentTypeTaga' has a wrong offset!");
static_assert(offsetof(UWBP_PlatformCustomisation_C, PouchTypeTag) == 0x0004B8, "Member 'UWBP_PlatformCustomisation_C::PouchTypeTag' has a wrong offset!");
static_assert(offsetof(UWBP_PlatformCustomisation_C, InvItemSocketTag) == 0x0004D8, "Member 'UWBP_PlatformCustomisation_C::InvItemSocketTag' has a wrong offset!");
static_assert(offsetof(UWBP_PlatformCustomisation_C, EncumberanceHeavy) == 0x0004E0, "Member 'UWBP_PlatformCustomisation_C::EncumberanceHeavy' has a wrong offset!");
static_assert(offsetof(UWBP_PlatformCustomisation_C, EncumberanceMedium) == 0x0004F8, "Member 'UWBP_PlatformCustomisation_C::EncumberanceMedium' has a wrong offset!");
static_assert(offsetof(UWBP_PlatformCustomisation_C, EncumberanceLight) == 0x000510, "Member 'UWBP_PlatformCustomisation_C::EncumberanceLight' has a wrong offset!");
static_assert(offsetof(UWBP_PlatformCustomisation_C, EncumberanceNone) == 0x000528, "Member 'UWBP_PlatformCustomisation_C::EncumberanceNone' has a wrong offset!");
static_assert(offsetof(UWBP_PlatformCustomisation_C, ToolTip_LoadoutWindow) == 0x000540, "Member 'UWBP_PlatformCustomisation_C::ToolTip_LoadoutWindow' has a wrong offset!");
static_assert(offsetof(UWBP_PlatformCustomisation_C, LoadoutSummaryTimerHandle) == 0x000558, "Member 'UWBP_PlatformCustomisation_C::LoadoutSummaryTimerHandle' has a wrong offset!");

}

