#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HardwareMonAndCompare

#include "Basic.hpp"

#include "HardwareMonAndCompare_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function HardwareMonAndCompare.FileFunctionsHardwareMonAndCompare.addBytesToFileAndCloseIt
// 0x0030 (0x0030 - 0x0000)
struct FileFunctionsHardwareMonAndCompare_addBytesToFileAndCloseIt final
{
public:
	EFileFunctionsHardwareMonAndCompareDirectoryType directoryType;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 FilePath;                                          // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<uint8>                                 Bytes;                                             // 0x0018(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          success;                                           // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FileFunctionsHardwareMonAndCompare_addBytesToFileAndCloseIt) == 0x000008, "Wrong alignment on FileFunctionsHardwareMonAndCompare_addBytesToFileAndCloseIt");
static_assert(sizeof(FileFunctionsHardwareMonAndCompare_addBytesToFileAndCloseIt) == 0x000030, "Wrong size on FileFunctionsHardwareMonAndCompare_addBytesToFileAndCloseIt");
static_assert(offsetof(FileFunctionsHardwareMonAndCompare_addBytesToFileAndCloseIt, directoryType) == 0x000000, "Member 'FileFunctionsHardwareMonAndCompare_addBytesToFileAndCloseIt::directoryType' has a wrong offset!");
static_assert(offsetof(FileFunctionsHardwareMonAndCompare_addBytesToFileAndCloseIt, FilePath) == 0x000008, "Member 'FileFunctionsHardwareMonAndCompare_addBytesToFileAndCloseIt::FilePath' has a wrong offset!");
static_assert(offsetof(FileFunctionsHardwareMonAndCompare_addBytesToFileAndCloseIt, Bytes) == 0x000018, "Member 'FileFunctionsHardwareMonAndCompare_addBytesToFileAndCloseIt::Bytes' has a wrong offset!");
static_assert(offsetof(FileFunctionsHardwareMonAndCompare_addBytesToFileAndCloseIt, success) == 0x000028, "Member 'FileFunctionsHardwareMonAndCompare_addBytesToFileAndCloseIt::success' has a wrong offset!");

// Function HardwareMonAndCompare.FileFunctionsHardwareMonAndCompare.base64StringToBytes
// 0x0028 (0x0028 - 0x0000)
struct FileFunctionsHardwareMonAndCompare_base64StringToBytes final
{
public:
	class FString                                 base64String;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          success;                                           // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<uint8>                                 ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(FileFunctionsHardwareMonAndCompare_base64StringToBytes) == 0x000008, "Wrong alignment on FileFunctionsHardwareMonAndCompare_base64StringToBytes");
static_assert(sizeof(FileFunctionsHardwareMonAndCompare_base64StringToBytes) == 0x000028, "Wrong size on FileFunctionsHardwareMonAndCompare_base64StringToBytes");
static_assert(offsetof(FileFunctionsHardwareMonAndCompare_base64StringToBytes, base64String) == 0x000000, "Member 'FileFunctionsHardwareMonAndCompare_base64StringToBytes::base64String' has a wrong offset!");
static_assert(offsetof(FileFunctionsHardwareMonAndCompare_base64StringToBytes, success) == 0x000010, "Member 'FileFunctionsHardwareMonAndCompare_base64StringToBytes::success' has a wrong offset!");
static_assert(offsetof(FileFunctionsHardwareMonAndCompare_base64StringToBytes, ReturnValue) == 0x000018, "Member 'FileFunctionsHardwareMonAndCompare_base64StringToBytes::ReturnValue' has a wrong offset!");

// Function HardwareMonAndCompare.FileFunctionsHardwareMonAndCompare.base64StringToString
// 0x0020 (0x0020 - 0x0000)
struct FileFunctionsHardwareMonAndCompare_base64StringToString final
{
public:
	class FString                                 String;                                            // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 base64String;                                      // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FileFunctionsHardwareMonAndCompare_base64StringToString) == 0x000008, "Wrong alignment on FileFunctionsHardwareMonAndCompare_base64StringToString");
static_assert(sizeof(FileFunctionsHardwareMonAndCompare_base64StringToString) == 0x000020, "Wrong size on FileFunctionsHardwareMonAndCompare_base64StringToString");
static_assert(offsetof(FileFunctionsHardwareMonAndCompare_base64StringToString, String) == 0x000000, "Member 'FileFunctionsHardwareMonAndCompare_base64StringToString::String' has a wrong offset!");
static_assert(offsetof(FileFunctionsHardwareMonAndCompare_base64StringToString, base64String) == 0x000010, "Member 'FileFunctionsHardwareMonAndCompare_base64StringToString::base64String' has a wrong offset!");

// Function HardwareMonAndCompare.FileFunctionsHardwareMonAndCompare.bytesToBase64String
// 0x0020 (0x0020 - 0x0000)
struct FileFunctionsHardwareMonAndCompare_bytesToBase64String final
{
public:
	TArray<uint8>                                 Bytes;                                             // 0x0000(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 base64String;                                      // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FileFunctionsHardwareMonAndCompare_bytesToBase64String) == 0x000008, "Wrong alignment on FileFunctionsHardwareMonAndCompare_bytesToBase64String");
static_assert(sizeof(FileFunctionsHardwareMonAndCompare_bytesToBase64String) == 0x000020, "Wrong size on FileFunctionsHardwareMonAndCompare_bytesToBase64String");
static_assert(offsetof(FileFunctionsHardwareMonAndCompare_bytesToBase64String, Bytes) == 0x000000, "Member 'FileFunctionsHardwareMonAndCompare_bytesToBase64String::Bytes' has a wrong offset!");
static_assert(offsetof(FileFunctionsHardwareMonAndCompare_bytesToBase64String, base64String) == 0x000010, "Member 'FileFunctionsHardwareMonAndCompare_bytesToBase64String::base64String' has a wrong offset!");

// Function HardwareMonAndCompare.FileFunctionsHardwareMonAndCompare.createDirectory
// 0x0020 (0x0020 - 0x0000)
struct FileFunctionsHardwareMonAndCompare_createDirectory final
{
public:
	EFileFunctionsHardwareMonAndCompareDirectoryType directoryType;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Path;                                              // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FileFunctionsHardwareMonAndCompare_createDirectory) == 0x000008, "Wrong alignment on FileFunctionsHardwareMonAndCompare_createDirectory");
static_assert(sizeof(FileFunctionsHardwareMonAndCompare_createDirectory) == 0x000020, "Wrong size on FileFunctionsHardwareMonAndCompare_createDirectory");
static_assert(offsetof(FileFunctionsHardwareMonAndCompare_createDirectory, directoryType) == 0x000000, "Member 'FileFunctionsHardwareMonAndCompare_createDirectory::directoryType' has a wrong offset!");
static_assert(offsetof(FileFunctionsHardwareMonAndCompare_createDirectory, Path) == 0x000008, "Member 'FileFunctionsHardwareMonAndCompare_createDirectory::Path' has a wrong offset!");
static_assert(offsetof(FileFunctionsHardwareMonAndCompare_createDirectory, ReturnValue) == 0x000018, "Member 'FileFunctionsHardwareMonAndCompare_createDirectory::ReturnValue' has a wrong offset!");

// Function HardwareMonAndCompare.FileFunctionsHardwareMonAndCompare.decryptMessageWithAES
// 0x0030 (0x0030 - 0x0000)
struct FileFunctionsHardwareMonAndCompare_decryptMessageWithAES final
{
public:
	class FString                                 encryptedBase64Message;                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 keyIn256Bit;                                       // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FileFunctionsHardwareMonAndCompare_decryptMessageWithAES) == 0x000008, "Wrong alignment on FileFunctionsHardwareMonAndCompare_decryptMessageWithAES");
static_assert(sizeof(FileFunctionsHardwareMonAndCompare_decryptMessageWithAES) == 0x000030, "Wrong size on FileFunctionsHardwareMonAndCompare_decryptMessageWithAES");
static_assert(offsetof(FileFunctionsHardwareMonAndCompare_decryptMessageWithAES, encryptedBase64Message) == 0x000000, "Member 'FileFunctionsHardwareMonAndCompare_decryptMessageWithAES::encryptedBase64Message' has a wrong offset!");
static_assert(offsetof(FileFunctionsHardwareMonAndCompare_decryptMessageWithAES, keyIn256Bit) == 0x000010, "Member 'FileFunctionsHardwareMonAndCompare_decryptMessageWithAES::keyIn256Bit' has a wrong offset!");
static_assert(offsetof(FileFunctionsHardwareMonAndCompare_decryptMessageWithAES, ReturnValue) == 0x000020, "Member 'FileFunctionsHardwareMonAndCompare_decryptMessageWithAES::ReturnValue' has a wrong offset!");

// Function HardwareMonAndCompare.FileFunctionsHardwareMonAndCompare.deleteDirectory
// 0x0020 (0x0020 - 0x0000)
struct FileFunctionsHardwareMonAndCompare_deleteDirectory final
{
public:
	EFileFunctionsHardwareMonAndCompareDirectoryType directoryType;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 FilePath;                                          // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FileFunctionsHardwareMonAndCompare_deleteDirectory) == 0x000008, "Wrong alignment on FileFunctionsHardwareMonAndCompare_deleteDirectory");
static_assert(sizeof(FileFunctionsHardwareMonAndCompare_deleteDirectory) == 0x000020, "Wrong size on FileFunctionsHardwareMonAndCompare_deleteDirectory");
static_assert(offsetof(FileFunctionsHardwareMonAndCompare_deleteDirectory, directoryType) == 0x000000, "Member 'FileFunctionsHardwareMonAndCompare_deleteDirectory::directoryType' has a wrong offset!");
static_assert(offsetof(FileFunctionsHardwareMonAndCompare_deleteDirectory, FilePath) == 0x000008, "Member 'FileFunctionsHardwareMonAndCompare_deleteDirectory::FilePath' has a wrong offset!");
static_assert(offsetof(FileFunctionsHardwareMonAndCompare_deleteDirectory, ReturnValue) == 0x000018, "Member 'FileFunctionsHardwareMonAndCompare_deleteDirectory::ReturnValue' has a wrong offset!");

// Function HardwareMonAndCompare.FileFunctionsHardwareMonAndCompare.deleteFile
// 0x0020 (0x0020 - 0x0000)
struct FileFunctionsHardwareMonAndCompare_deleteFile final
{
public:
	EFileFunctionsHardwareMonAndCompareDirectoryType directoryType;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 FilePath;                                          // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FileFunctionsHardwareMonAndCompare_deleteFile) == 0x000008, "Wrong alignment on FileFunctionsHardwareMonAndCompare_deleteFile");
static_assert(sizeof(FileFunctionsHardwareMonAndCompare_deleteFile) == 0x000020, "Wrong size on FileFunctionsHardwareMonAndCompare_deleteFile");
static_assert(offsetof(FileFunctionsHardwareMonAndCompare_deleteFile, directoryType) == 0x000000, "Member 'FileFunctionsHardwareMonAndCompare_deleteFile::directoryType' has a wrong offset!");
static_assert(offsetof(FileFunctionsHardwareMonAndCompare_deleteFile, FilePath) == 0x000008, "Member 'FileFunctionsHardwareMonAndCompare_deleteFile::FilePath' has a wrong offset!");
static_assert(offsetof(FileFunctionsHardwareMonAndCompare_deleteFile, ReturnValue) == 0x000018, "Member 'FileFunctionsHardwareMonAndCompare_deleteFile::ReturnValue' has a wrong offset!");

// Function HardwareMonAndCompare.FileFunctionsHardwareMonAndCompare.deleteFileAbsolutePath
// 0x0018 (0x0018 - 0x0000)
struct FileFunctionsHardwareMonAndCompare_deleteFileAbsolutePath final
{
public:
	class FString                                 FilePath;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FileFunctionsHardwareMonAndCompare_deleteFileAbsolutePath) == 0x000008, "Wrong alignment on FileFunctionsHardwareMonAndCompare_deleteFileAbsolutePath");
static_assert(sizeof(FileFunctionsHardwareMonAndCompare_deleteFileAbsolutePath) == 0x000018, "Wrong size on FileFunctionsHardwareMonAndCompare_deleteFileAbsolutePath");
static_assert(offsetof(FileFunctionsHardwareMonAndCompare_deleteFileAbsolutePath, FilePath) == 0x000000, "Member 'FileFunctionsHardwareMonAndCompare_deleteFileAbsolutePath::FilePath' has a wrong offset!");
static_assert(offsetof(FileFunctionsHardwareMonAndCompare_deleteFileAbsolutePath, ReturnValue) == 0x000010, "Member 'FileFunctionsHardwareMonAndCompare_deleteFileAbsolutePath::ReturnValue' has a wrong offset!");

// Function HardwareMonAndCompare.FileFunctionsHardwareMonAndCompare.directoryExists
// 0x0020 (0x0020 - 0x0000)
struct FileFunctionsHardwareMonAndCompare_directoryExists final
{
public:
	EFileFunctionsHardwareMonAndCompareDirectoryType directoryType;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Path;                                              // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FileFunctionsHardwareMonAndCompare_directoryExists) == 0x000008, "Wrong alignment on FileFunctionsHardwareMonAndCompare_directoryExists");
static_assert(sizeof(FileFunctionsHardwareMonAndCompare_directoryExists) == 0x000020, "Wrong size on FileFunctionsHardwareMonAndCompare_directoryExists");
static_assert(offsetof(FileFunctionsHardwareMonAndCompare_directoryExists, directoryType) == 0x000000, "Member 'FileFunctionsHardwareMonAndCompare_directoryExists::directoryType' has a wrong offset!");
static_assert(offsetof(FileFunctionsHardwareMonAndCompare_directoryExists, Path) == 0x000008, "Member 'FileFunctionsHardwareMonAndCompare_directoryExists::Path' has a wrong offset!");
static_assert(offsetof(FileFunctionsHardwareMonAndCompare_directoryExists, ReturnValue) == 0x000018, "Member 'FileFunctionsHardwareMonAndCompare_directoryExists::ReturnValue' has a wrong offset!");

// Function HardwareMonAndCompare.FileFunctionsHardwareMonAndCompare.encryptMessageWithAES
// 0x0030 (0x0030 - 0x0000)
struct FileFunctionsHardwareMonAndCompare_encryptMessageWithAES final
{
public:
	class FString                                 Message;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 keyIn256Bit;                                       // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FileFunctionsHardwareMonAndCompare_encryptMessageWithAES) == 0x000008, "Wrong alignment on FileFunctionsHardwareMonAndCompare_encryptMessageWithAES");
static_assert(sizeof(FileFunctionsHardwareMonAndCompare_encryptMessageWithAES) == 0x000030, "Wrong size on FileFunctionsHardwareMonAndCompare_encryptMessageWithAES");
static_assert(offsetof(FileFunctionsHardwareMonAndCompare_encryptMessageWithAES, Message) == 0x000000, "Member 'FileFunctionsHardwareMonAndCompare_encryptMessageWithAES::Message' has a wrong offset!");
static_assert(offsetof(FileFunctionsHardwareMonAndCompare_encryptMessageWithAES, keyIn256Bit) == 0x000010, "Member 'FileFunctionsHardwareMonAndCompare_encryptMessageWithAES::keyIn256Bit' has a wrong offset!");
static_assert(offsetof(FileFunctionsHardwareMonAndCompare_encryptMessageWithAES, ReturnValue) == 0x000020, "Member 'FileFunctionsHardwareMonAndCompare_encryptMessageWithAES::ReturnValue' has a wrong offset!");

// Function HardwareMonAndCompare.FileFunctionsHardwareMonAndCompare.fileExists
// 0x0020 (0x0020 - 0x0000)
struct FileFunctionsHardwareMonAndCompare_fileExists final
{
public:
	EFileFunctionsHardwareMonAndCompareDirectoryType directoryType;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 FilePath;                                          // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FileFunctionsHardwareMonAndCompare_fileExists) == 0x000008, "Wrong alignment on FileFunctionsHardwareMonAndCompare_fileExists");
static_assert(sizeof(FileFunctionsHardwareMonAndCompare_fileExists) == 0x000020, "Wrong size on FileFunctionsHardwareMonAndCompare_fileExists");
static_assert(offsetof(FileFunctionsHardwareMonAndCompare_fileExists, directoryType) == 0x000000, "Member 'FileFunctionsHardwareMonAndCompare_fileExists::directoryType' has a wrong offset!");
static_assert(offsetof(FileFunctionsHardwareMonAndCompare_fileExists, FilePath) == 0x000008, "Member 'FileFunctionsHardwareMonAndCompare_fileExists::FilePath' has a wrong offset!");
static_assert(offsetof(FileFunctionsHardwareMonAndCompare_fileExists, ReturnValue) == 0x000018, "Member 'FileFunctionsHardwareMonAndCompare_fileExists::ReturnValue' has a wrong offset!");

// Function HardwareMonAndCompare.FileFunctionsHardwareMonAndCompare.fileExistsAbsolutePath
// 0x0018 (0x0018 - 0x0000)
struct FileFunctionsHardwareMonAndCompare_fileExistsAbsolutePath final
{
public:
	class FString                                 FilePath;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FileFunctionsHardwareMonAndCompare_fileExistsAbsolutePath) == 0x000008, "Wrong alignment on FileFunctionsHardwareMonAndCompare_fileExistsAbsolutePath");
static_assert(sizeof(FileFunctionsHardwareMonAndCompare_fileExistsAbsolutePath) == 0x000018, "Wrong size on FileFunctionsHardwareMonAndCompare_fileExistsAbsolutePath");
static_assert(offsetof(FileFunctionsHardwareMonAndCompare_fileExistsAbsolutePath, FilePath) == 0x000000, "Member 'FileFunctionsHardwareMonAndCompare_fileExistsAbsolutePath::FilePath' has a wrong offset!");
static_assert(offsetof(FileFunctionsHardwareMonAndCompare_fileExistsAbsolutePath, ReturnValue) == 0x000010, "Member 'FileFunctionsHardwareMonAndCompare_fileExistsAbsolutePath::ReturnValue' has a wrong offset!");

// Function HardwareMonAndCompare.FileFunctionsHardwareMonAndCompare.fileSize
// 0x0020 (0x0020 - 0x0000)
struct FileFunctionsHardwareMonAndCompare_fileSize final
{
public:
	EFileFunctionsHardwareMonAndCompareDirectoryType directoryType;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 FilePath;                                          // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FileFunctionsHardwareMonAndCompare_fileSize) == 0x000008, "Wrong alignment on FileFunctionsHardwareMonAndCompare_fileSize");
static_assert(sizeof(FileFunctionsHardwareMonAndCompare_fileSize) == 0x000020, "Wrong size on FileFunctionsHardwareMonAndCompare_fileSize");
static_assert(offsetof(FileFunctionsHardwareMonAndCompare_fileSize, directoryType) == 0x000000, "Member 'FileFunctionsHardwareMonAndCompare_fileSize::directoryType' has a wrong offset!");
static_assert(offsetof(FileFunctionsHardwareMonAndCompare_fileSize, FilePath) == 0x000008, "Member 'FileFunctionsHardwareMonAndCompare_fileSize::FilePath' has a wrong offset!");
static_assert(offsetof(FileFunctionsHardwareMonAndCompare_fileSize, ReturnValue) == 0x000018, "Member 'FileFunctionsHardwareMonAndCompare_fileSize::ReturnValue' has a wrong offset!");

// Function HardwareMonAndCompare.FileFunctionsHardwareMonAndCompare.fileSizeAbsolutePath
// 0x0018 (0x0018 - 0x0000)
struct FileFunctionsHardwareMonAndCompare_fileSizeAbsolutePath final
{
public:
	class FString                                 FilePath;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FileFunctionsHardwareMonAndCompare_fileSizeAbsolutePath) == 0x000008, "Wrong alignment on FileFunctionsHardwareMonAndCompare_fileSizeAbsolutePath");
static_assert(sizeof(FileFunctionsHardwareMonAndCompare_fileSizeAbsolutePath) == 0x000018, "Wrong size on FileFunctionsHardwareMonAndCompare_fileSizeAbsolutePath");
static_assert(offsetof(FileFunctionsHardwareMonAndCompare_fileSizeAbsolutePath, FilePath) == 0x000000, "Member 'FileFunctionsHardwareMonAndCompare_fileSizeAbsolutePath::FilePath' has a wrong offset!");
static_assert(offsetof(FileFunctionsHardwareMonAndCompare_fileSizeAbsolutePath, ReturnValue) == 0x000010, "Member 'FileFunctionsHardwareMonAndCompare_fileSizeAbsolutePath::ReturnValue' has a wrong offset!");

// Function HardwareMonAndCompare.FileFunctionsHardwareMonAndCompare.fileToBase64String
// 0x0040 (0x0040 - 0x0000)
struct FileFunctionsHardwareMonAndCompare_fileToBase64String final
{
public:
	EFileFunctionsHardwareMonAndCompareDirectoryType directoryType;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 FilePath;                                          // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          success;                                           // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 base64String;                                      // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Filename;                                          // 0x0030(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FileFunctionsHardwareMonAndCompare_fileToBase64String) == 0x000008, "Wrong alignment on FileFunctionsHardwareMonAndCompare_fileToBase64String");
static_assert(sizeof(FileFunctionsHardwareMonAndCompare_fileToBase64String) == 0x000040, "Wrong size on FileFunctionsHardwareMonAndCompare_fileToBase64String");
static_assert(offsetof(FileFunctionsHardwareMonAndCompare_fileToBase64String, directoryType) == 0x000000, "Member 'FileFunctionsHardwareMonAndCompare_fileToBase64String::directoryType' has a wrong offset!");
static_assert(offsetof(FileFunctionsHardwareMonAndCompare_fileToBase64String, FilePath) == 0x000008, "Member 'FileFunctionsHardwareMonAndCompare_fileToBase64String::FilePath' has a wrong offset!");
static_assert(offsetof(FileFunctionsHardwareMonAndCompare_fileToBase64String, success) == 0x000018, "Member 'FileFunctionsHardwareMonAndCompare_fileToBase64String::success' has a wrong offset!");
static_assert(offsetof(FileFunctionsHardwareMonAndCompare_fileToBase64String, base64String) == 0x000020, "Member 'FileFunctionsHardwareMonAndCompare_fileToBase64String::base64String' has a wrong offset!");
static_assert(offsetof(FileFunctionsHardwareMonAndCompare_fileToBase64String, Filename) == 0x000030, "Member 'FileFunctionsHardwareMonAndCompare_fileToBase64String::Filename' has a wrong offset!");

// Function HardwareMonAndCompare.FileFunctionsHardwareMonAndCompare.getAccessTimeStamp
// 0x0020 (0x0020 - 0x0000)
struct FileFunctionsHardwareMonAndCompare_getAccessTimeStamp final
{
public:
	EFileFunctionsHardwareMonAndCompareDirectoryType directoryType;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 FilePath;                                          // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                              ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FileFunctionsHardwareMonAndCompare_getAccessTimeStamp) == 0x000008, "Wrong alignment on FileFunctionsHardwareMonAndCompare_getAccessTimeStamp");
static_assert(sizeof(FileFunctionsHardwareMonAndCompare_getAccessTimeStamp) == 0x000020, "Wrong size on FileFunctionsHardwareMonAndCompare_getAccessTimeStamp");
static_assert(offsetof(FileFunctionsHardwareMonAndCompare_getAccessTimeStamp, directoryType) == 0x000000, "Member 'FileFunctionsHardwareMonAndCompare_getAccessTimeStamp::directoryType' has a wrong offset!");
static_assert(offsetof(FileFunctionsHardwareMonAndCompare_getAccessTimeStamp, FilePath) == 0x000008, "Member 'FileFunctionsHardwareMonAndCompare_getAccessTimeStamp::FilePath' has a wrong offset!");
static_assert(offsetof(FileFunctionsHardwareMonAndCompare_getAccessTimeStamp, ReturnValue) == 0x000018, "Member 'FileFunctionsHardwareMonAndCompare_getAccessTimeStamp::ReturnValue' has a wrong offset!");

// Function HardwareMonAndCompare.FileFunctionsHardwareMonAndCompare.getAllFilesFromDirectory
// 0x0050 (0x0050 - 0x0000)
struct FileFunctionsHardwareMonAndCompare_getAllFilesFromDirectory final
{
public:
	EFileFunctionsHardwareMonAndCompareDirectoryType directoryType;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 FilePath;                                          // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Count;                                             // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         files;                                             // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FString>                         filePaths;                                         // 0x0030(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 FileType;                                          // 0x0040(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FileFunctionsHardwareMonAndCompare_getAllFilesFromDirectory) == 0x000008, "Wrong alignment on FileFunctionsHardwareMonAndCompare_getAllFilesFromDirectory");
static_assert(sizeof(FileFunctionsHardwareMonAndCompare_getAllFilesFromDirectory) == 0x000050, "Wrong size on FileFunctionsHardwareMonAndCompare_getAllFilesFromDirectory");
static_assert(offsetof(FileFunctionsHardwareMonAndCompare_getAllFilesFromDirectory, directoryType) == 0x000000, "Member 'FileFunctionsHardwareMonAndCompare_getAllFilesFromDirectory::directoryType' has a wrong offset!");
static_assert(offsetof(FileFunctionsHardwareMonAndCompare_getAllFilesFromDirectory, FilePath) == 0x000008, "Member 'FileFunctionsHardwareMonAndCompare_getAllFilesFromDirectory::FilePath' has a wrong offset!");
static_assert(offsetof(FileFunctionsHardwareMonAndCompare_getAllFilesFromDirectory, Count) == 0x000018, "Member 'FileFunctionsHardwareMonAndCompare_getAllFilesFromDirectory::Count' has a wrong offset!");
static_assert(offsetof(FileFunctionsHardwareMonAndCompare_getAllFilesFromDirectory, files) == 0x000020, "Member 'FileFunctionsHardwareMonAndCompare_getAllFilesFromDirectory::files' has a wrong offset!");
static_assert(offsetof(FileFunctionsHardwareMonAndCompare_getAllFilesFromDirectory, filePaths) == 0x000030, "Member 'FileFunctionsHardwareMonAndCompare_getAllFilesFromDirectory::filePaths' has a wrong offset!");
static_assert(offsetof(FileFunctionsHardwareMonAndCompare_getAllFilesFromDirectory, FileType) == 0x000040, "Member 'FileFunctionsHardwareMonAndCompare_getAllFilesFromDirectory::FileType' has a wrong offset!");

// Function HardwareMonAndCompare.FileFunctionsHardwareMonAndCompare.getFileFunctionsHardwareMonAndCompareTarget
// 0x0008 (0x0008 - 0x0000)
struct FileFunctionsHardwareMonAndCompare_getFileFunctionsHardwareMonAndCompareTarget final
{
public:
	class UFileFunctionsHardwareMonAndCompare*    ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FileFunctionsHardwareMonAndCompare_getFileFunctionsHardwareMonAndCompareTarget) == 0x000008, "Wrong alignment on FileFunctionsHardwareMonAndCompare_getFileFunctionsHardwareMonAndCompareTarget");
static_assert(sizeof(FileFunctionsHardwareMonAndCompare_getFileFunctionsHardwareMonAndCompareTarget) == 0x000008, "Wrong size on FileFunctionsHardwareMonAndCompare_getFileFunctionsHardwareMonAndCompareTarget");
static_assert(offsetof(FileFunctionsHardwareMonAndCompare_getFileFunctionsHardwareMonAndCompareTarget, ReturnValue) == 0x000000, "Member 'FileFunctionsHardwareMonAndCompare_getFileFunctionsHardwareMonAndCompareTarget::ReturnValue' has a wrong offset!");

// Function HardwareMonAndCompare.FileFunctionsHardwareMonAndCompare.getFilenameOnDisk
// 0x0028 (0x0028 - 0x0000)
struct FileFunctionsHardwareMonAndCompare_getFilenameOnDisk final
{
public:
	EFileFunctionsHardwareMonAndCompareDirectoryType directoryType;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 FilePath;                                          // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FileFunctionsHardwareMonAndCompare_getFilenameOnDisk) == 0x000008, "Wrong alignment on FileFunctionsHardwareMonAndCompare_getFilenameOnDisk");
static_assert(sizeof(FileFunctionsHardwareMonAndCompare_getFilenameOnDisk) == 0x000028, "Wrong size on FileFunctionsHardwareMonAndCompare_getFilenameOnDisk");
static_assert(offsetof(FileFunctionsHardwareMonAndCompare_getFilenameOnDisk, directoryType) == 0x000000, "Member 'FileFunctionsHardwareMonAndCompare_getFilenameOnDisk::directoryType' has a wrong offset!");
static_assert(offsetof(FileFunctionsHardwareMonAndCompare_getFilenameOnDisk, FilePath) == 0x000008, "Member 'FileFunctionsHardwareMonAndCompare_getFilenameOnDisk::FilePath' has a wrong offset!");
static_assert(offsetof(FileFunctionsHardwareMonAndCompare_getFilenameOnDisk, ReturnValue) == 0x000018, "Member 'FileFunctionsHardwareMonAndCompare_getFilenameOnDisk::ReturnValue' has a wrong offset!");

// Function HardwareMonAndCompare.FileFunctionsHardwareMonAndCompare.getMD5FromFile
// 0x0030 (0x0030 - 0x0000)
struct FileFunctionsHardwareMonAndCompare_getMD5FromFile final
{
public:
	EFileFunctionsHardwareMonAndCompareDirectoryType directoryType;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 FilePath;                                          // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          success;                                           // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 MD5;                                               // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FileFunctionsHardwareMonAndCompare_getMD5FromFile) == 0x000008, "Wrong alignment on FileFunctionsHardwareMonAndCompare_getMD5FromFile");
static_assert(sizeof(FileFunctionsHardwareMonAndCompare_getMD5FromFile) == 0x000030, "Wrong size on FileFunctionsHardwareMonAndCompare_getMD5FromFile");
static_assert(offsetof(FileFunctionsHardwareMonAndCompare_getMD5FromFile, directoryType) == 0x000000, "Member 'FileFunctionsHardwareMonAndCompare_getMD5FromFile::directoryType' has a wrong offset!");
static_assert(offsetof(FileFunctionsHardwareMonAndCompare_getMD5FromFile, FilePath) == 0x000008, "Member 'FileFunctionsHardwareMonAndCompare_getMD5FromFile::FilePath' has a wrong offset!");
static_assert(offsetof(FileFunctionsHardwareMonAndCompare_getMD5FromFile, success) == 0x000018, "Member 'FileFunctionsHardwareMonAndCompare_getMD5FromFile::success' has a wrong offset!");
static_assert(offsetof(FileFunctionsHardwareMonAndCompare_getMD5FromFile, MD5) == 0x000020, "Member 'FileFunctionsHardwareMonAndCompare_getMD5FromFile::MD5' has a wrong offset!");

// Function HardwareMonAndCompare.FileFunctionsHardwareMonAndCompare.getMD5FromFileAbsolutePath
// 0x0028 (0x0028 - 0x0000)
struct FileFunctionsHardwareMonAndCompare_getMD5FromFileAbsolutePath final
{
public:
	class FString                                 FilePath;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          success;                                           // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 MD5;                                               // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FileFunctionsHardwareMonAndCompare_getMD5FromFileAbsolutePath) == 0x000008, "Wrong alignment on FileFunctionsHardwareMonAndCompare_getMD5FromFileAbsolutePath");
static_assert(sizeof(FileFunctionsHardwareMonAndCompare_getMD5FromFileAbsolutePath) == 0x000028, "Wrong size on FileFunctionsHardwareMonAndCompare_getMD5FromFileAbsolutePath");
static_assert(offsetof(FileFunctionsHardwareMonAndCompare_getMD5FromFileAbsolutePath, FilePath) == 0x000000, "Member 'FileFunctionsHardwareMonAndCompare_getMD5FromFileAbsolutePath::FilePath' has a wrong offset!");
static_assert(offsetof(FileFunctionsHardwareMonAndCompare_getMD5FromFileAbsolutePath, success) == 0x000010, "Member 'FileFunctionsHardwareMonAndCompare_getMD5FromFileAbsolutePath::success' has a wrong offset!");
static_assert(offsetof(FileFunctionsHardwareMonAndCompare_getMD5FromFileAbsolutePath, MD5) == 0x000018, "Member 'FileFunctionsHardwareMonAndCompare_getMD5FromFileAbsolutePath::MD5' has a wrong offset!");

// Function HardwareMonAndCompare.FileFunctionsHardwareMonAndCompare.getTimeStamp
// 0x0020 (0x0020 - 0x0000)
struct FileFunctionsHardwareMonAndCompare_getTimeStamp final
{
public:
	EFileFunctionsHardwareMonAndCompareDirectoryType directoryType;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 FilePath;                                          // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                              ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FileFunctionsHardwareMonAndCompare_getTimeStamp) == 0x000008, "Wrong alignment on FileFunctionsHardwareMonAndCompare_getTimeStamp");
static_assert(sizeof(FileFunctionsHardwareMonAndCompare_getTimeStamp) == 0x000020, "Wrong size on FileFunctionsHardwareMonAndCompare_getTimeStamp");
static_assert(offsetof(FileFunctionsHardwareMonAndCompare_getTimeStamp, directoryType) == 0x000000, "Member 'FileFunctionsHardwareMonAndCompare_getTimeStamp::directoryType' has a wrong offset!");
static_assert(offsetof(FileFunctionsHardwareMonAndCompare_getTimeStamp, FilePath) == 0x000008, "Member 'FileFunctionsHardwareMonAndCompare_getTimeStamp::FilePath' has a wrong offset!");
static_assert(offsetof(FileFunctionsHardwareMonAndCompare_getTimeStamp, ReturnValue) == 0x000018, "Member 'FileFunctionsHardwareMonAndCompare_getTimeStamp::ReturnValue' has a wrong offset!");

// Function HardwareMonAndCompare.FileFunctionsHardwareMonAndCompare.int64ToString
// 0x0018 (0x0018 - 0x0000)
struct FileFunctionsHardwareMonAndCompare_int64ToString final
{
public:
	int64                                         Num;                                               // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FileFunctionsHardwareMonAndCompare_int64ToString) == 0x000008, "Wrong alignment on FileFunctionsHardwareMonAndCompare_int64ToString");
static_assert(sizeof(FileFunctionsHardwareMonAndCompare_int64ToString) == 0x000018, "Wrong size on FileFunctionsHardwareMonAndCompare_int64ToString");
static_assert(offsetof(FileFunctionsHardwareMonAndCompare_int64ToString, Num) == 0x000000, "Member 'FileFunctionsHardwareMonAndCompare_int64ToString::Num' has a wrong offset!");
static_assert(offsetof(FileFunctionsHardwareMonAndCompare_int64ToString, ReturnValue) == 0x000008, "Member 'FileFunctionsHardwareMonAndCompare_int64ToString::ReturnValue' has a wrong offset!");

// Function HardwareMonAndCompare.FileFunctionsHardwareMonAndCompare.isReadOnly
// 0x0020 (0x0020 - 0x0000)
struct FileFunctionsHardwareMonAndCompare_isReadOnly final
{
public:
	EFileFunctionsHardwareMonAndCompareDirectoryType directoryType;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 FilePath;                                          // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FileFunctionsHardwareMonAndCompare_isReadOnly) == 0x000008, "Wrong alignment on FileFunctionsHardwareMonAndCompare_isReadOnly");
static_assert(sizeof(FileFunctionsHardwareMonAndCompare_isReadOnly) == 0x000020, "Wrong size on FileFunctionsHardwareMonAndCompare_isReadOnly");
static_assert(offsetof(FileFunctionsHardwareMonAndCompare_isReadOnly, directoryType) == 0x000000, "Member 'FileFunctionsHardwareMonAndCompare_isReadOnly::directoryType' has a wrong offset!");
static_assert(offsetof(FileFunctionsHardwareMonAndCompare_isReadOnly, FilePath) == 0x000008, "Member 'FileFunctionsHardwareMonAndCompare_isReadOnly::FilePath' has a wrong offset!");
static_assert(offsetof(FileFunctionsHardwareMonAndCompare_isReadOnly, ReturnValue) == 0x000018, "Member 'FileFunctionsHardwareMonAndCompare_isReadOnly::ReturnValue' has a wrong offset!");

// Function HardwareMonAndCompare.FileFunctionsHardwareMonAndCompare.moveFile
// 0x0038 (0x0038 - 0x0000)
struct FileFunctionsHardwareMonAndCompare_moveFile final
{
public:
	EFileFunctionsHardwareMonAndCompareDirectoryType directoryTypeTo;                                // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 filePathTo;                                        // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFileFunctionsHardwareMonAndCompareDirectoryType directoryTypeFrom;                              // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 filePathFrom;                                      // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FileFunctionsHardwareMonAndCompare_moveFile) == 0x000008, "Wrong alignment on FileFunctionsHardwareMonAndCompare_moveFile");
static_assert(sizeof(FileFunctionsHardwareMonAndCompare_moveFile) == 0x000038, "Wrong size on FileFunctionsHardwareMonAndCompare_moveFile");
static_assert(offsetof(FileFunctionsHardwareMonAndCompare_moveFile, directoryTypeTo) == 0x000000, "Member 'FileFunctionsHardwareMonAndCompare_moveFile::directoryTypeTo' has a wrong offset!");
static_assert(offsetof(FileFunctionsHardwareMonAndCompare_moveFile, filePathTo) == 0x000008, "Member 'FileFunctionsHardwareMonAndCompare_moveFile::filePathTo' has a wrong offset!");
static_assert(offsetof(FileFunctionsHardwareMonAndCompare_moveFile, directoryTypeFrom) == 0x000018, "Member 'FileFunctionsHardwareMonAndCompare_moveFile::directoryTypeFrom' has a wrong offset!");
static_assert(offsetof(FileFunctionsHardwareMonAndCompare_moveFile, filePathFrom) == 0x000020, "Member 'FileFunctionsHardwareMonAndCompare_moveFile::filePathFrom' has a wrong offset!");
static_assert(offsetof(FileFunctionsHardwareMonAndCompare_moveFile, ReturnValue) == 0x000030, "Member 'FileFunctionsHardwareMonAndCompare_moveFile::ReturnValue' has a wrong offset!");

// Function HardwareMonAndCompare.FileFunctionsHardwareMonAndCompare.readBytesFromFile
// 0x0030 (0x0030 - 0x0000)
struct FileFunctionsHardwareMonAndCompare_readBytesFromFile final
{
public:
	EFileFunctionsHardwareMonAndCompareDirectoryType directoryType;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 FilePath;                                          // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          success;                                           // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<uint8>                                 ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(FileFunctionsHardwareMonAndCompare_readBytesFromFile) == 0x000008, "Wrong alignment on FileFunctionsHardwareMonAndCompare_readBytesFromFile");
static_assert(sizeof(FileFunctionsHardwareMonAndCompare_readBytesFromFile) == 0x000030, "Wrong size on FileFunctionsHardwareMonAndCompare_readBytesFromFile");
static_assert(offsetof(FileFunctionsHardwareMonAndCompare_readBytesFromFile, directoryType) == 0x000000, "Member 'FileFunctionsHardwareMonAndCompare_readBytesFromFile::directoryType' has a wrong offset!");
static_assert(offsetof(FileFunctionsHardwareMonAndCompare_readBytesFromFile, FilePath) == 0x000008, "Member 'FileFunctionsHardwareMonAndCompare_readBytesFromFile::FilePath' has a wrong offset!");
static_assert(offsetof(FileFunctionsHardwareMonAndCompare_readBytesFromFile, success) == 0x000018, "Member 'FileFunctionsHardwareMonAndCompare_readBytesFromFile::success' has a wrong offset!");
static_assert(offsetof(FileFunctionsHardwareMonAndCompare_readBytesFromFile, ReturnValue) == 0x000020, "Member 'FileFunctionsHardwareMonAndCompare_readBytesFromFile::ReturnValue' has a wrong offset!");

// Function HardwareMonAndCompare.FileFunctionsHardwareMonAndCompare.readStringFromFile
// 0x0030 (0x0030 - 0x0000)
struct FileFunctionsHardwareMonAndCompare_readStringFromFile final
{
public:
	EFileFunctionsHardwareMonAndCompareDirectoryType directoryType;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 FilePath;                                          // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          success;                                           // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Data;                                              // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FileFunctionsHardwareMonAndCompare_readStringFromFile) == 0x000008, "Wrong alignment on FileFunctionsHardwareMonAndCompare_readStringFromFile");
static_assert(sizeof(FileFunctionsHardwareMonAndCompare_readStringFromFile) == 0x000030, "Wrong size on FileFunctionsHardwareMonAndCompare_readStringFromFile");
static_assert(offsetof(FileFunctionsHardwareMonAndCompare_readStringFromFile, directoryType) == 0x000000, "Member 'FileFunctionsHardwareMonAndCompare_readStringFromFile::directoryType' has a wrong offset!");
static_assert(offsetof(FileFunctionsHardwareMonAndCompare_readStringFromFile, FilePath) == 0x000008, "Member 'FileFunctionsHardwareMonAndCompare_readStringFromFile::FilePath' has a wrong offset!");
static_assert(offsetof(FileFunctionsHardwareMonAndCompare_readStringFromFile, success) == 0x000018, "Member 'FileFunctionsHardwareMonAndCompare_readStringFromFile::success' has a wrong offset!");
static_assert(offsetof(FileFunctionsHardwareMonAndCompare_readStringFromFile, Data) == 0x000020, "Member 'FileFunctionsHardwareMonAndCompare_readStringFromFile::Data' has a wrong offset!");

// Function HardwareMonAndCompare.FileFunctionsHardwareMonAndCompare.setReadOnly
// 0x0020 (0x0020 - 0x0000)
struct FileFunctionsHardwareMonAndCompare_setReadOnly final
{
public:
	EFileFunctionsHardwareMonAndCompareDirectoryType directoryType;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 FilePath;                                          // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNewReadOnlyValue;                                 // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0019(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FileFunctionsHardwareMonAndCompare_setReadOnly) == 0x000008, "Wrong alignment on FileFunctionsHardwareMonAndCompare_setReadOnly");
static_assert(sizeof(FileFunctionsHardwareMonAndCompare_setReadOnly) == 0x000020, "Wrong size on FileFunctionsHardwareMonAndCompare_setReadOnly");
static_assert(offsetof(FileFunctionsHardwareMonAndCompare_setReadOnly, directoryType) == 0x000000, "Member 'FileFunctionsHardwareMonAndCompare_setReadOnly::directoryType' has a wrong offset!");
static_assert(offsetof(FileFunctionsHardwareMonAndCompare_setReadOnly, FilePath) == 0x000008, "Member 'FileFunctionsHardwareMonAndCompare_setReadOnly::FilePath' has a wrong offset!");
static_assert(offsetof(FileFunctionsHardwareMonAndCompare_setReadOnly, bNewReadOnlyValue) == 0x000018, "Member 'FileFunctionsHardwareMonAndCompare_setReadOnly::bNewReadOnlyValue' has a wrong offset!");
static_assert(offsetof(FileFunctionsHardwareMonAndCompare_setReadOnly, ReturnValue) == 0x000019, "Member 'FileFunctionsHardwareMonAndCompare_setReadOnly::ReturnValue' has a wrong offset!");

// Function HardwareMonAndCompare.FileFunctionsHardwareMonAndCompare.setTimeStamp
// 0x0020 (0x0020 - 0x0000)
struct FileFunctionsHardwareMonAndCompare_setTimeStamp final
{
public:
	EFileFunctionsHardwareMonAndCompareDirectoryType directoryType;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 FilePath;                                          // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                              DateTime;                                          // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FileFunctionsHardwareMonAndCompare_setTimeStamp) == 0x000008, "Wrong alignment on FileFunctionsHardwareMonAndCompare_setTimeStamp");
static_assert(sizeof(FileFunctionsHardwareMonAndCompare_setTimeStamp) == 0x000020, "Wrong size on FileFunctionsHardwareMonAndCompare_setTimeStamp");
