#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KytheraPlugin

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "AIModule_structs.hpp"
#include "KytheraPlugin_structs.hpp"


namespace SDK::Params
{

// Function KytheraPlugin.KytCSNComponent.SetPedestrianSpawnDensityMultiplier
// 0x0004 (0x0004 - 0x0000)
struct KytCSNComponent_SetPedestrianSpawnDensityMultiplier final
{
public:
	float                                         Multiplier;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KytCSNComponent_SetPedestrianSpawnDensityMultiplier) == 0x000004, "Wrong alignment on KytCSNComponent_SetPedestrianSpawnDensityMultiplier");
static_assert(sizeof(KytCSNComponent_SetPedestrianSpawnDensityMultiplier) == 0x000004, "Wrong size on KytCSNComponent_SetPedestrianSpawnDensityMultiplier");
static_assert(offsetof(KytCSNComponent_SetPedestrianSpawnDensityMultiplier, Multiplier) == 0x000000, "Member 'KytCSNComponent_SetPedestrianSpawnDensityMultiplier::Multiplier' has a wrong offset!");

// Function KytheraPlugin.KytCSNComponent.SetVehicleSpawnDensityMultiplier
// 0x0004 (0x0004 - 0x0000)
struct KytCSNComponent_SetVehicleSpawnDensityMultiplier final
{
public:
	float                                         Multiplier;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KytCSNComponent_SetVehicleSpawnDensityMultiplier) == 0x000004, "Wrong alignment on KytCSNComponent_SetVehicleSpawnDensityMultiplier");
static_assert(sizeof(KytCSNComponent_SetVehicleSpawnDensityMultiplier) == 0x000004, "Wrong size on KytCSNComponent_SetVehicleSpawnDensityMultiplier");
static_assert(offsetof(KytCSNComponent_SetVehicleSpawnDensityMultiplier, Multiplier) == 0x000000, "Member 'KytCSNComponent_SetVehicleSpawnDensityMultiplier::Multiplier' has a wrong offset!");

// Function KytheraPlugin.KytBTFunctionLibrary.GetBlackboardValueAsKytBlackBoard
// 0x0038 (0x0038 - 0x0000)
struct KytBTFunctionLibrary_GetBlackboardValueAsKytBlackBoard final
{
public:
	class UBTNode*                                NodeOwner;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBlackboardKeySelector                 Key;                                               // 0x0008(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UKytBlackboard*                         ReturnValue;                                       // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KytBTFunctionLibrary_GetBlackboardValueAsKytBlackBoard) == 0x000008, "Wrong alignment on KytBTFunctionLibrary_GetBlackboardValueAsKytBlackBoard");
static_assert(sizeof(KytBTFunctionLibrary_GetBlackboardValueAsKytBlackBoard) == 0x000038, "Wrong size on KytBTFunctionLibrary_GetBlackboardValueAsKytBlackBoard");
static_assert(offsetof(KytBTFunctionLibrary_GetBlackboardValueAsKytBlackBoard, NodeOwner) == 0x000000, "Member 'KytBTFunctionLibrary_GetBlackboardValueAsKytBlackBoard::NodeOwner' has a wrong offset!");
static_assert(offsetof(KytBTFunctionLibrary_GetBlackboardValueAsKytBlackBoard, Key) == 0x000008, "Member 'KytBTFunctionLibrary_GetBlackboardValueAsKytBlackBoard::Key' has a wrong offset!");
static_assert(offsetof(KytBTFunctionLibrary_GetBlackboardValueAsKytBlackBoard, ReturnValue) == 0x000030, "Member 'KytBTFunctionLibrary_GetBlackboardValueAsKytBlackBoard::ReturnValue' has a wrong offset!");

// Function KytheraPlugin.KytNavOctree.IgnoreMeshForNavigation
// 0x0010 (0x0010 - 0x0000)
struct KytNavOctree_IgnoreMeshForNavigation final
{
public:
	class UPrimitiveComponent*                    Mesh;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Ignore;                                            // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(KytNavOctree_IgnoreMeshForNavigation) == 0x000008, "Wrong alignment on KytNavOctree_IgnoreMeshForNavigation");
static_assert(sizeof(KytNavOctree_IgnoreMeshForNavigation) == 0x000010, "Wrong size on KytNavOctree_IgnoreMeshForNavigation");
static_assert(offsetof(KytNavOctree_IgnoreMeshForNavigation, Mesh) == 0x000000, "Member 'KytNavOctree_IgnoreMeshForNavigation::Mesh' has a wrong offset!");
static_assert(offsetof(KytNavOctree_IgnoreMeshForNavigation, Ignore) == 0x000008, "Member 'KytNavOctree_IgnoreMeshForNavigation::Ignore' has a wrong offset!");

// Function KytheraPlugin.KytNavOctree.QueryNavigablePointInSphere
// 0x0024 (0x0024 - 0x0000)
struct KytNavOctree_QueryNavigablePointInSphere final
{
public:
	struct FVector                                Result;                                            // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Center;                                            // 0x000C(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Radius;                                            // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NavigationRadius;                                  // 0x001C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          OpenAreasOnly;                                     // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0021(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(KytNavOctree_QueryNavigablePointInSphere) == 0x000004, "Wrong alignment on KytNavOctree_QueryNavigablePointInSphere");
static_assert(sizeof(KytNavOctree_QueryNavigablePointInSphere) == 0x000024, "Wrong size on KytNavOctree_QueryNavigablePointInSphere");
static_assert(offsetof(KytNavOctree_QueryNavigablePointInSphere, Result) == 0x000000, "Member 'KytNavOctree_QueryNavigablePointInSphere::Result' has a wrong offset!");
static_assert(offsetof(KytNavOctree_QueryNavigablePointInSphere, Center) == 0x00000C, "Member 'KytNavOctree_QueryNavigablePointInSphere::Center' has a wrong offset!");
static_assert(offsetof(KytNavOctree_QueryNavigablePointInSphere, Radius) == 0x000018, "Member 'KytNavOctree_QueryNavigablePointInSphere::Radius' has a wrong offset!");
static_assert(offsetof(KytNavOctree_QueryNavigablePointInSphere, NavigationRadius) == 0x00001C, "Member 'KytNavOctree_QueryNavigablePointInSphere::NavigationRadius' has a wrong offset!");
static_assert(offsetof(KytNavOctree_QueryNavigablePointInSphere, OpenAreasOnly) == 0x000020, "Member 'KytNavOctree_QueryNavigablePointInSphere::OpenAreasOnly' has a wrong offset!");
static_assert(offsetof(KytNavOctree_QueryNavigablePointInSphere, ReturnValue) == 0x000021, "Member 'KytNavOctree_QueryNavigablePointInSphere::ReturnValue' has a wrong offset!");

// Function KytheraPlugin.KytNavOctree.RegenerateVolume
// 0x0018 (0x0018 - 0x0000)
struct KytNavOctree_RegenerateVolume final
{
public:
	struct FVector                                Center;                                            // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                halfExtent;                                        // 0x000C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KytNavOctree_RegenerateVolume) == 0x000004, "Wrong alignment on KytNavOctree_RegenerateVolume");
static_assert(sizeof(KytNavOctree_RegenerateVolume) == 0x000018, "Wrong size on KytNavOctree_RegenerateVolume");
static_assert(offsetof(KytNavOctree_RegenerateVolume, Center) == 0x000000, "Member 'KytNavOctree_RegenerateVolume::Center' has a wrong offset!");
static_assert(offsetof(KytNavOctree_RegenerateVolume, halfExtent) == 0x00000C, "Member 'KytNavOctree_RegenerateVolume::halfExtent' has a wrong offset!");

// Function KytheraPlugin.KytAnimationSupport.IsAnimationSupported
// 0x0020 (0x0020 - 0x0000)
struct KytAnimationSupport_IsAnimationSupported final
{
public:
	class FString                                 AnimationName;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UKytBlackboard*                   AnimationParameters;                               // 0x0010(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(KytAnimationSupport_IsAnimationSupported) == 0x000008, "Wrong alignment on KytAnimationSupport_IsAnimationSupported");
static_assert(sizeof(KytAnimationSupport_IsAnimationSupported) == 0x000020, "Wrong size on KytAnimationSupport_IsAnimationSupported");
static_assert(offsetof(KytAnimationSupport_IsAnimationSupported, AnimationName) == 0x000000, "Member 'KytAnimationSupport_IsAnimationSupported::AnimationName' has a wrong offset!");
static_assert(offsetof(KytAnimationSupport_IsAnimationSupported, AnimationParameters) == 0x000010, "Member 'KytAnimationSupport_IsAnimationSupported::AnimationParameters' has a wrong offset!");
static_assert(offsetof(KytAnimationSupport_IsAnimationSupported, ReturnValue) == 0x000018, "Member 'KytAnimationSupport_IsAnimationSupported::ReturnValue' has a wrong offset!");

// Function KytheraPlugin.KytBTDecorator.ChildNodeEnter
// 0x0001 (0x0001 - 0x0000)
struct KytBTDecorator_ChildNodeEnter final
{
public:
	EKytBTEnterResult                             ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KytBTDecorator_ChildNodeEnter) == 0x000001, "Wrong alignment on KytBTDecorator_ChildNodeEnter");
static_assert(sizeof(KytBTDecorator_ChildNodeEnter) == 0x000001, "Wrong size on KytBTDecorator_ChildNodeEnter");
static_assert(offsetof(KytBTDecorator_ChildNodeEnter, ReturnValue) == 0x000000, "Member 'KytBTDecorator_ChildNodeEnter::ReturnValue' has a wrong offset!");

// Function KytheraPlugin.KytBTDecorator.ChildNodeUpdate
// 0x0001 (0x0001 - 0x0000)
struct KytBTDecorator_ChildNodeUpdate final
{
public:
	EKytBTUpdateResult                            ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KytBTDecorator_ChildNodeUpdate) == 0x000001, "Wrong alignment on KytBTDecorator_ChildNodeUpdate");
static_assert(sizeof(KytBTDecorator_ChildNodeUpdate) == 0x000001, "Wrong size on KytBTDecorator_ChildNodeUpdate");
static_assert(offsetof(KytBTDecorator_ChildNodeUpdate, ReturnValue) == 0x000000, "Member 'KytBTDecorator_ChildNodeUpdate::ReturnValue' has a wrong offset!");

// Function KytheraPlugin.KytBTDecorator.DoCleanup
// 0x0010 (0x0010 - 0x0000)
struct KytBTDecorator_DoCleanup final
{
public:
	class AKytController*                         Controller;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UKytBlackboard*                         BehaviorBlackboard;                                // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KytBTDecorator_DoCleanup) == 0x000008, "Wrong alignment on KytBTDecorator_DoCleanup");
static_assert(sizeof(KytBTDecorator_DoCleanup) == 0x000010, "Wrong size on KytBTDecorator_DoCleanup");
static_assert(offsetof(KytBTDecorator_DoCleanup, Controller) == 0x000000, "Member 'KytBTDecorator_DoCleanup::Controller' has a wrong offset!");
static_assert(offsetof(KytBTDecorator_DoCleanup, BehaviorBlackboard) == 0x000008, "Member 'KytBTDecorator_DoCleanup::BehaviorBlackboard' has a wrong offset!");

// Function KytheraPlugin.KytBTDecorator.DoEnter
// 0x0018 (0x0018 - 0x0000)
struct KytBTDecorator_DoEnter final
{
public:
	class AKytController*                         Controller;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UKytBlackboard*                         BehaviorBlackboard;                                // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EKytBTEnterResult                             ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(KytBTDecorator_DoEnter) == 0x000008, "Wrong alignment on KytBTDecorator_DoEnter");
static_assert(sizeof(KytBTDecorator_DoEnter) == 0x000018, "Wrong size on KytBTDecorator_DoEnter");
static_assert(offsetof(KytBTDecorator_DoEnter, Controller) == 0x000000, "Member 'KytBTDecorator_DoEnter::Controller' has a wrong offset!");
static_assert(offsetof(KytBTDecorator_DoEnter, BehaviorBlackboard) == 0x000008, "Member 'KytBTDecorator_DoEnter::BehaviorBlackboard' has a wrong offset!");
static_assert(offsetof(KytBTDecorator_DoEnter, ReturnValue) == 0x000010, "Member 'KytBTDecorator_DoEnter::ReturnValue' has a wrong offset!");

// Function KytheraPlugin.KytBTDecorator.DoUpdate
// 0x0018 (0x0018 - 0x0000)
struct KytBTDecorator_DoUpdate final
{
public:
	class AKytController*                         Controller;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UKytBlackboard*                         BehaviorBlackboard;                                // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EKytBTUpdateResult                            ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(KytBTDecorator_DoUpdate) == 0x000008, "Wrong alignment on KytBTDecorator_DoUpdate");
static_assert(sizeof(KytBTDecorator_DoUpdate) == 0x000018, "Wrong size on KytBTDecorator_DoUpdate");
static_assert(offsetof(KytBTDecorator_DoUpdate, Controller) == 0x000000, "Member 'KytBTDecorator_DoUpdate::Controller' has a wrong offset!");
static_assert(offsetof(KytBTDecorator_DoUpdate, BehaviorBlackboard) == 0x000008, "Member 'KytBTDecorator_DoUpdate::BehaviorBlackboard' has a wrong offset!");
static_assert(offsetof(KytBTDecorator_DoUpdate, ReturnValue) == 0x000010, "Member 'KytBTDecorator_DoUpdate::ReturnValue' has a wrong offset!");

// Function KytheraPlugin.KytNavSplineActor.SplinePointPassed
// 0x0020 (0x0020 - 0x0000)
struct KytNavSplineActor_SplinePointPassed final
{
public:
	class APawn*                                  Ship;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PointIndex;                                        // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 PointName;                                         // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KytNavSplineActor_SplinePointPassed) == 0x000008, "Wrong alignment on KytNavSplineActor_SplinePointPassed");
static_assert(sizeof(KytNavSplineActor_SplinePointPassed) == 0x000020, "Wrong size on KytNavSplineActor_SplinePointPassed");
static_assert(offsetof(KytNavSplineActor_SplinePointPassed, Ship) == 0x000000, "Member 'KytNavSplineActor_SplinePointPassed::Ship' has a wrong offset!");
static_assert(offsetof(KytNavSplineActor_SplinePointPassed, PointIndex) == 0x000008, "Member 'KytNavSplineActor_SplinePointPassed::PointIndex' has a wrong offset!");
static_assert(offsetof(KytNavSplineActor_SplinePointPassed, PointName) == 0x000010, "Member 'KytNavSplineActor_SplinePointPassed::PointName' has a wrong offset!");

// Function KytheraPlugin.KytBlackboard.CreateKytBlackboard
// 0x0008 (0x0008 - 0x0000)
struct KytBlackboard_CreateKytBlackboard final
{
public:
	class UKytBlackboard*                         ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KytBlackboard_CreateKytBlackboard) == 0x000008, "Wrong alignment on KytBlackboard_CreateKytBlackboard");
static_assert(sizeof(KytBlackboard_CreateKytBlackboard) == 0x000008, "Wrong size on KytBlackboard_CreateKytBlackboard");
static_assert(offsetof(KytBlackboard_CreateKytBlackboard, ReturnValue) == 0x000000, "Member 'KytBlackboard_CreateKytBlackboard::ReturnValue' has a wrong offset!");

// Function KytheraPlugin.KytBlackboard.ClearBlackboardValue
// 0x0010 (0x0010 - 0x0000)
struct KytBlackboard_ClearBlackboardValue final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KytBlackboard_ClearBlackboardValue) == 0x000008, "Wrong alignment on KytBlackboard_ClearBlackboardValue");
static_assert(sizeof(KytBlackboard_ClearBlackboardValue) == 0x000010, "Wrong size on KytBlackboard_ClearBlackboardValue");
static_assert(offsetof(KytBlackboard_ClearBlackboardValue, Key) == 0x000000, "Member 'KytBlackboard_ClearBlackboardValue::Key' has a wrong offset!");

// Function KytheraPlugin.KytBlackboard.GetBlackboardValueAsActor
// 0x0018 (0x0018 - 0x0000)
struct KytBlackboard_GetBlackboardValueAsActor final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KytBlackboard_GetBlackboardValueAsActor) == 0x000008, "Wrong alignment on KytBlackboard_GetBlackboardValueAsActor");
static_assert(sizeof(KytBlackboard_GetBlackboardValueAsActor) == 0x000018, "Wrong size on KytBlackboard_GetBlackboardValueAsActor");
static_assert(offsetof(KytBlackboard_GetBlackboardValueAsActor, Key) == 0x000000, "Member 'KytBlackboard_GetBlackboardValueAsActor::Key' has a wrong offset!");
static_assert(offsetof(KytBlackboard_GetBlackboardValueAsActor, ReturnValue) == 0x000010, "Member 'KytBlackboard_GetBlackboardValueAsActor::ReturnValue' has a wrong offset!");

// Function KytheraPlugin.KytBlackboard.GetBlackboardValueAsBlackboard
// 0x0018 (0x0018 - 0x0000)
struct KytBlackboard_GetBlackboardValueAsBlackboard final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UKytBlackboard*                         ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KytBlackboard_GetBlackboardValueAsBlackboard) == 0x000008, "Wrong alignment on KytBlackboard_GetBlackboardValueAsBlackboard");
static_assert(sizeof(KytBlackboard_GetBlackboardValueAsBlackboard) == 0x000018, "Wrong size on KytBlackboard_GetBlackboardValueAsBlackboard");
static_assert(offsetof(KytBlackboard_GetBlackboardValueAsBlackboard, Key) == 0x000000, "Member 'KytBlackboard_GetBlackboardValueAsBlackboard::Key' has a wrong offset!");
static_assert(offsetof(KytBlackboard_GetBlackboardValueAsBlackboard, ReturnValue) == 0x000010, "Member 'KytBlackboard_GetBlackboardValueAsBlackboard::ReturnValue' has a wrong offset!");

// Function KytheraPlugin.KytBlackboard.GetBlackboardValueAsBool
// 0x0018 (0x0018 - 0x0000)
struct KytBlackboard_GetBlackboardValueAsBool final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(KytBlackboard_GetBlackboardValueAsBool) == 0x000008, "Wrong alignment on KytBlackboard_GetBlackboardValueAsBool");
static_assert(sizeof(KytBlackboard_GetBlackboardValueAsBool) == 0x000018, "Wrong size on KytBlackboard_GetBlackboardValueAsBool");
static_assert(offsetof(KytBlackboard_GetBlackboardValueAsBool, Key) == 0x000000, "Member 'KytBlackboard_GetBlackboardValueAsBool::Key' has a wrong offset!");
static_assert(offsetof(KytBlackboard_GetBlackboardValueAsBool, ReturnValue) == 0x000010, "Member 'KytBlackboard_GetBlackboardValueAsBool::ReturnValue' has a wrong offset!");

// Function KytheraPlugin.KytBlackboard.GetBlackboardValueAsFloat
// 0x0018 (0x0018 - 0x0000)
struct KytBlackboard_GetBlackboardValueAsFloat final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(KytBlackboard_GetBlackboardValueAsFloat) == 0x000008, "Wrong alignment on KytBlackboard_GetBlackboardValueAsFloat");
static_assert(sizeof(KytBlackboard_GetBlackboardValueAsFloat) == 0x000018, "Wrong size on KytBlackboard_GetBlackboardValueAsFloat");
static_assert(offsetof(KytBlackboard_GetBlackboardValueAsFloat, Key) == 0x000000, "Member 'KytBlackboard_GetBlackboardValueAsFloat::Key' has a wrong offset!");
static_assert(offsetof(KytBlackboard_GetBlackboardValueAsFloat, ReturnValue) == 0x000010, "Member 'KytBlackboard_GetBlackboardValueAsFloat::ReturnValue' has a wrong offset!");

// Function KytheraPlugin.KytBlackboard.GetBlackboardValueAsInt
// 0x0018 (0x0018 - 0x0000)
struct KytBlackboard_GetBlackboardValueAsInt final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(KytBlackboard_GetBlackboardValueAsInt) == 0x000008, "Wrong alignment on KytBlackboard_GetBlackboardValueAsInt");
static_assert(sizeof(KytBlackboard_GetBlackboardValueAsInt) == 0x000018, "Wrong size on KytBlackboard_GetBlackboardValueAsInt");
static_assert(offsetof(KytBlackboard_GetBlackboardValueAsInt, Key) == 0x000000, "Member 'KytBlackboard_GetBlackboardValueAsInt::Key' has a wrong offset!");
static_assert(offsetof(KytBlackboard_GetBlackboardValueAsInt, ReturnValue) == 0x000010, "Member 'KytBlackboard_GetBlackboardValueAsInt::ReturnValue' has a wrong offset!");

// Function KytheraPlugin.KytBlackboard.GetBlackboardValueAsString
// 0x0020 (0x0020 - 0x0000)
struct KytBlackboard_GetBlackboardValueAsString final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KytBlackboard_GetBlackboardValueAsString) == 0x000008, "Wrong alignment on KytBlackboard_GetBlackboardValueAsString");
static_assert(sizeof(KytBlackboard_GetBlackboardValueAsString) == 0x000020, "Wrong size on KytBlackboard_GetBlackboardValueAsString");
static_assert(offsetof(KytBlackboard_GetBlackboardValueAsString, Key) == 0x000000, "Member 'KytBlackboard_GetBlackboardValueAsString::Key' has a wrong offset!");
static_assert(offsetof(KytBlackboard_GetBlackboardValueAsString, ReturnValue) == 0x000010, "Member 'KytBlackboard_GetBlackboardValueAsString::ReturnValue' has a wrong offset!");

// Function KytheraPlugin.KytBlackboard.GetBlackboardValueAsVector
// 0x0020 (0x0020 - 0x0000)
struct KytBlackboard_GetBlackboardValueAsVector final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0010(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(KytBlackboard_GetBlackboardValueAsVector) == 0x000008, "Wrong alignment on KytBlackboard_GetBlackboardValueAsVector");
static_assert(sizeof(KytBlackboard_GetBlackboardValueAsVector) == 0x000020, "Wrong size on KytBlackboard_GetBlackboardValueAsVector");
static_assert(offsetof(KytBlackboard_GetBlackboardValueAsVector, Key) == 0x000000, "Member 'KytBlackboard_GetBlackboardValueAsVector::Key' has a wrong offset!");
static_assert(offsetof(KytBlackboard_GetBlackboardValueAsVector, ReturnValue) == 0x000010, "Member 'KytBlackboard_GetBlackboardValueAsVector::ReturnValue' has a wrong offset!");

// Function KytheraPlugin.KytBlackboard.GetOrCreateBlackboardValueAsBlackboard
// 0x0018 (0x0018 - 0x0000)
struct KytBlackboard_GetOrCreateBlackboardValueAsBlackboard final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UKytBlackboard*                         ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KytBlackboard_GetOrCreateBlackboardValueAsBlackboard) == 0x000008, "Wrong alignment on KytBlackboard_GetOrCreateBlackboardValueAsBlackboard");
static_assert(sizeof(KytBlackboard_GetOrCreateBlackboardValueAsBlackboard) == 0x000018, "Wrong size on KytBlackboard_GetOrCreateBlackboardValueAsBlackboard");
static_assert(offsetof(KytBlackboard_GetOrCreateBlackboardValueAsBlackboard, Key) == 0x000000, "Member 'KytBlackboard_GetOrCreateBlackboardValueAsBlackboard::Key' has a wrong offset!");
static_assert(offsetof(KytBlackboard_GetOrCreateBlackboardValueAsBlackboard, ReturnValue) == 0x000010, "Member 'KytBlackboard_GetOrCreateBlackboardValueAsBlackboard::ReturnValue' has a wrong offset!");

// Function KytheraPlugin.KytBlackboard.HasValue
// 0x0018 (0x0018 - 0x0000)
struct KytBlackboard_HasValue final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(KytBlackboard_HasValue) == 0x000008, "Wrong alignment on KytBlackboard_HasValue");
static_assert(sizeof(KytBlackboard_HasValue) == 0x000018, "Wrong size on KytBlackboard_HasValue");
static_assert(offsetof(KytBlackboard_HasValue, Key) == 0x000000, "Member 'KytBlackboard_HasValue::Key' has a wrong offset!");
static_assert(offsetof(KytBlackboard_HasValue, ReturnValue) == 0x000010, "Member 'KytBlackboard_HasValue::ReturnValue' has a wrong offset!");

// Function KytheraPlugin.KytBlackboard.SetBlackboardValueAsBlackboard
// 0x0018 (0x0018 - 0x0000)
struct KytBlackboard_SetBlackboardValueAsBlackboard final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UKytBlackboard*                         Value;                                             // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KytBlackboard_SetBlackboardValueAsBlackboard) == 0x000008, "Wrong alignment on KytBlackboard_SetBlackboardValueAsBlackboard");
static_assert(sizeof(KytBlackboard_SetBlackboardValueAsBlackboard) == 0x000018, "Wrong size on KytBlackboard_SetBlackboardValueAsBlackboard");
static_assert(offsetof(KytBlackboard_SetBlackboardValueAsBlackboard, Key) == 0x000000, "Member 'KytBlackboard_SetBlackboardValueAsBlackboard::Key' has a wrong offset!");
static_assert(offsetof(KytBlackboard_SetBlackboardValueAsBlackboard, Value) == 0x000010, "Member 'KytBlackboard_SetBlackboardValueAsBlackboard::Value' has a wrong offset!");

// Function KytheraPlugin.KytBlackboard.SetBlackboardValueAsBool
// 0x0018 (0x0018 - 0x0000)
struct KytBlackboard_SetBlackboardValueAsBool final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Value;                                             // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(KytBlackboard_SetBlackboardValueAsBool) == 0x000008, "Wrong alignment on KytBlackboard_SetBlackboardValueAsBool");
static_assert(sizeof(KytBlackboard_SetBlackboardValueAsBool) == 0x000018, "Wrong size on KytBlackboard_SetBlackboardValueAsBool");
static_assert(offsetof(KytBlackboard_SetBlackboardValueAsBool, Key) == 0x000000, "Member 'KytBlackboard_SetBlackboardValueAsBool::Key' has a wrong offset!");
static_assert(offsetof(KytBlackboard_SetBlackboardValueAsBool, Value) == 0x000010, "Member 'KytBlackboard_SetBlackboardValueAsBool::Value' has a wrong offset!");

// Function KytheraPlugin.KytBlackboard.SetBlackboardValueAsEntityId
// 0x0018 (0x0018 - 0x0000)
struct KytBlackboard_SetBlackboardValueAsEntityId final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 Value;                                             // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KytBlackboard_SetBlackboardValueAsEntityId) == 0x000008, "Wrong alignment on KytBlackboard_SetBlackboardValueAsEntityId");
static_assert(sizeof(KytBlackboard_SetBlackboardValueAsEntityId) == 0x000018, "Wrong size on KytBlackboard_SetBlackboardValueAsEntityId");
static_assert(offsetof(KytBlackboard_SetBlackboardValueAsEntityId, Key) == 0x000000, "Member 'KytBlackboard_SetBlackboardValueAsEntityId::Key' has a wrong offset!");
static_assert(offsetof(KytBlackboard_SetBlackboardValueAsEntityId, Value) == 0x000010, "Member 'KytBlackboard_SetBlackboardValueAsEntityId::Value' has a wrong offset!");

// Function KytheraPlugin.KytBlackboard.SetBlackboardValueAsFloat
// 0x0018 (0x0018 - 0x0000)
struct KytBlackboard_SetBlackboardValueAsFloat final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Value;                                             // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(KytBlackboard_SetBlackboardValueAsFloat) == 0x000008, "Wrong alignment on KytBlackboard_SetBlackboardValueAsFloat");
static_assert(sizeof(KytBlackboard_SetBlackboardValueAsFloat) == 0x000018, "Wrong size on KytBlackboard_SetBlackboardValueAsFloat");
static_assert(offsetof(KytBlackboard_SetBlackboardValueAsFloat, Key) == 0x000000, "Member 'KytBlackboard_SetBlackboardValueAsFloat::Key' has a wrong offset!");
static_assert(offsetof(KytBlackboard_SetBlackboardValueAsFloat, Value) == 0x000010, "Member 'KytBlackboard_SetBlackboardValueAsFloat::Value' has a wrong offset!");

// Function KytheraPlugin.KytBlackboard.SetBlackboardValueAsInt
// 0x0018 (0x0018 - 0x0000)
struct KytBlackboard_SetBlackboardValueAsInt final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Value;                                             // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(KytBlackboard_SetBlackboardValueAsInt) == 0x000008, "Wrong alignment on KytBlackboard_SetBlackboardValueAsInt");
static_assert(sizeof(KytBlackboard_SetBlackboardValueAsInt) == 0x000018, "Wrong size on KytBlackboard_SetBlackboardValueAsInt");
static_assert(offsetof(KytBlackboard_SetBlackboardValueAsInt, Key) == 0x000000, "Member 'KytBlackboard_SetBlackboardValueAsInt::Key' has a wrong offset!");
static_assert(offsetof(KytBlackboard_SetBlackboardValueAsInt, Value) == 0x000010, "Member 'KytBlackboard_SetBlackboardValueAsInt::Value' has a wrong offset!");

// Function KytheraPlugin.KytBlackboard.SetBlackboardValueAsPosition
// 0x0020 (0x0020 - 0x0000)
struct KytBlackboard_SetBlackboardValueAsPosition final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Value;                                             // 0x0010(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(KytBlackboard_SetBlackboardValueAsPosition) == 0x000008, "Wrong alignment on KytBlackboard_SetBlackboardValueAsPosition");
static_assert(sizeof(KytBlackboard_SetBlackboardValueAsPosition) == 0x000020, "Wrong size on KytBlackboard_SetBlackboardValueAsPosition");
static_assert(offsetof(KytBlackboard_SetBlackboardValueAsPosition, Key) == 0x000000, "Member 'KytBlackboard_SetBlackboardValueAsPosition::Key' has a wrong offset!");
static_assert(offsetof(KytBlackboard_SetBlackboardValueAsPosition, Value) == 0x000010, "Member 'KytBlackboard_SetBlackboardValueAsPosition::Value' has a wrong offset!");

// Function KytheraPlugin.KytBlackboard.SetBlackboardValueAsString
// 0x0020 (0x0020 - 0x0000)
struct KytBlackboard_SetBlackboardValueAsString final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Value;                                             // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KytBlackboard_SetBlackboardValueAsString) == 0x000008, "Wrong alignment on KytBlackboard_SetBlackboardValueAsString");
static_assert(sizeof(KytBlackboard_SetBlackboardValueAsString) == 0x000020, "Wrong size on KytBlackboard_SetBlackboardValueAsString");
static_assert(offsetof(KytBlackboard_SetBlackboardValueAsString, Key) == 0x000000, "Member 'KytBlackboard_SetBlackboardValueAsString::Key' has a wrong offset!");
static_assert(offsetof(KytBlackboard_SetBlackboardValueAsString, Value) == 0x000010, "Member 'KytBlackboard_SetBlackboardValueAsString::Value' has a wrong offset!");

// Function KytheraPlugin.KytBlackboard.SetBlackboardValueAsStringHash
// 0x0020 (0x0020 - 0x0000)
struct KytBlackboard_SetBlackboardValueAsStringHash final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Value;                                             // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KytBlackboard_SetBlackboardValueAsStringHash) == 0x000008, "Wrong alignment on KytBlackboard_SetBlackboardValueAsStringHash");
static_assert(sizeof(KytBlackboard_SetBlackboardValueAsStringHash) == 0x000020, "Wrong size on KytBlackboard_SetBlackboardValueAsStringHash");
static_assert(offsetof(KytBlackboard_SetBlackboardValueAsStringHash, Key) == 0x000000, "Member 'KytBlackboard_SetBlackboardValueAsStringHash::Key' has a wrong offset!");
static_assert(offsetof(KytBlackboard_SetBlackboardValueAsStringHash, Value) == 0x000010, "Member 'KytBlackboard_SetBlackboardValueAsStringHash::Value' has a wrong offset!");

// Function KytheraPlugin.KytBlackboard.SetBlackboardValueAsVector
// 0x0020 (0x0020 - 0x0000)
struct KytBlackboard_SetBlackboardValueAsVector final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Value;                                             // 0x0010(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(KytBlackboard_SetBlackboardValueAsVector) == 0x000008, "Wrong alignment on KytBlackboard_SetBlackboardValueAsVector");
static_assert(sizeof(KytBlackboard_SetBlackboardValueAsVector) == 0x000020, "Wrong size on KytBlackboard_SetBlackboardValueAsVector");
static_assert(offsetof(KytBlackboard_SetBlackboardValueAsVector, Key) == 0x000000, "Member 'KytBlackboard_SetBlackboardValueAsVector::Key' has a wrong offset!");
static_assert(offsetof(KytBlackboard_SetBlackboardValueAsVector, Value) == 0x000010, "Member 'KytBlackboard_SetBlackboardValueAsVector::Value' has a wrong offset!");

// Function KytheraPlugin.KytController.GetKytController
// 0x0010 (0x0010 - 0x0000)
struct KytController_GetKytController final
{
public:
	class AActor*                                 ControlledActor;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AKytController*                         ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KytController_GetKytController) == 0x000008, "Wrong alignment on KytController_GetKytController");
static_assert(sizeof(KytController_GetKytController) == 0x000010, "Wrong size on KytController_GetKytController");
static_assert(offsetof(KytController_GetKytController, ControlledActor) == 0x000000, "Member 'KytController_GetKytController::ControlledActor' has a wrong offset!");
static_assert(offsetof(KytController_GetKytController, ReturnValue) == 0x000008, "Member 'KytController_GetKytController::ReturnValue' has a wrong offset!");

// Function KytheraPlugin.KytController.AddTag
// 0x0010 (0x0010 - 0x0000)
struct KytController_AddTag final
{
public:
	class FString                                 Tag;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KytController_AddTag) == 0x000008, "Wrong alignment on KytController_AddTag");
static_assert(sizeof(KytController_AddTag) == 0x000010, "Wrong size on KytController_AddTag");
static_assert(offsetof(KytController_AddTag, Tag) == 0x000000, "Member 'KytController_AddTag::Tag' has a wrong offset!");

// Function KytheraPlugin.KytController.EraseTag
// 0x0010 (0x0010 - 0x0000)
struct KytController_EraseTag final
{
public:
	class FString                                 Tag;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KytController_EraseTag) == 0x000008, "Wrong alignment on KytController_EraseTag");
static_assert(sizeof(KytController_EraseTag) == 0x000010, "Wrong size on KytController_EraseTag");
static_assert(offsetof(KytController_EraseTag, Tag) == 0x000000, "Member 'KytController_EraseTag::Tag' has a wrong offset!");

// Function KytheraPlugin.KytController.ForcePerceptionOfActor
// 0x0010 (0x0010 - 0x0000)
struct KytController_ForcePerceptionOfActor final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Time;                                              // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(KytController_ForcePerceptionOfActor) == 0x000008, "Wrong alignment on KytController_ForcePerceptionOfActor");
static_assert(sizeof(KytController_ForcePerceptionOfActor) == 0x000010, "Wrong size on KytController_ForcePerceptionOfActor");
static_assert(offsetof(KytController_ForcePerceptionOfActor, Actor) == 0x000000, "Member 'KytController_ForcePerceptionOfActor::Actor' has a wrong offset!");
static_assert(offsetof(KytController_ForcePerceptionOfActor, Time) == 0x000008, "Member 'KytController_ForcePerceptionOfActor::Time' has a wrong offset!");

// Function KytheraPlugin.KytController.GetCurrentTarget
// 0x0008 (0x0008 - 0x0000)
struct KytController_GetCurrentTarget final
{
public:
	class AActor*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KytController_GetCurrentTarget) == 0x000008, "Wrong alignment on KytController_GetCurrentTarget");
static_assert(sizeof(KytController_GetCurrentTarget) == 0x000008, "Wrong size on KytController_GetCurrentTarget");
static_assert(offsetof(KytController_GetCurrentTarget, ReturnValue) == 0x000000, "Member 'KytController_GetCurrentTarget::ReturnValue' has a wrong offset!");

// Function KytheraPlugin.KytController.GetEntityState
// 0x0008 (0x0008 - 0x0000)
struct KytController_GetEntityState final
{
public:
	class UKytBlackboard*                         ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KytController_GetEntityState) == 0x000008, "Wrong alignment on KytController_GetEntityState");
static_assert(sizeof(KytController_GetEntityState) == 0x000008, "Wrong size on KytController_GetEntityState");
static_assert(offsetof(KytController_GetEntityState, ReturnValue) == 0x000000, "Member 'KytController_GetEntityState::ReturnValue' has a wrong offset!");

// Function KytheraPlugin.KytController.GetGroup
// 0x0018 (0x0018 - 0x0000)
struct KytController_GetGroup final
{
public:
	class FString                                 Type;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AKytGroup*                              ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KytController_GetGroup) == 0x000008, "Wrong alignment on KytController_GetGroup");
static_assert(sizeof(KytController_GetGroup) == 0x000018, "Wrong size on KytController_GetGroup");
static_assert(offsetof(KytController_GetGroup, Type) == 0x000000, "Member 'KytController_GetGroup::Type' has a wrong offset!");
static_assert(offsetof(KytController_GetGroup, ReturnValue) == 0x000010, "Member 'KytController_GetGroup::ReturnValue' has a wrong offset!");

// Function KytheraPlugin.KytController.HasTag
// 0x0018 (0x0018 - 0x0000)
struct KytController_HasTag final
{
public:
	class FString                                 Tag;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(KytController_HasTag) == 0x000008, "Wrong alignment on KytController_HasTag");
static_assert(sizeof(KytController_HasTag) == 0x000018, "Wrong size on KytController_HasTag");
static_assert(offsetof(KytController_HasTag, Tag) == 0x000000, "Member 'KytController_HasTag::Tag' has a wrong offset!");
static_assert(offsetof(KytController_HasTag, ReturnValue) == 0x000010, "Member 'KytController_HasTag::ReturnValue' has a wrong offset!");

// Function KytheraPlugin.KytController.NotifyPerceptionAboutActor
// 0x0008 (0x0008 - 0x0000)
struct KytController_NotifyPerceptionAboutActor final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KytController_NotifyPerceptionAboutActor) == 0x000008, "Wrong alignment on KytController_NotifyPerceptionAboutActor");
static_assert(sizeof(KytController_NotifyPerceptionAboutActor) == 0x000008, "Wrong size on KytController_NotifyPerceptionAboutActor");
static_assert(offsetof(KytController_NotifyPerceptionAboutActor, Actor) == 0x000000, "Member 'KytController_NotifyPerceptionAboutActor::Actor' has a wrong offset!");

// Function KytheraPlugin.KytController.OverrideTarget
// 0x0008 (0x0008 - 0x0000)
struct KytController_OverrideTarget final
{
public:
	class AActor*                                 Override;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KytController_OverrideTarget) == 0x000008, "Wrong alignment on KytController_OverrideTarget");
static_assert(sizeof(KytController_OverrideTarget) == 0x000008, "Wrong size on KytController_OverrideTarget");
static_assert(offsetof(KytController_OverrideTarget, Override) == 0x000000, "Member 'KytController_OverrideTarget::Override' has a wrong offset!");

// Function KytheraPlugin.KytController.ReplaceTag
// 0x0020 (0x0020 - 0x0000)
struct KytController_ReplaceTag final
{
public:
	class FString                                 oldTag;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 newTag;                                            // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KytController_ReplaceTag) == 0x000008, "Wrong alignment on KytController_ReplaceTag");
static_assert(sizeof(KytController_ReplaceTag) == 0x000020, "Wrong size on KytController_ReplaceTag");
static_assert(offsetof(KytController_ReplaceTag, oldTag) == 0x000000, "Member 'KytController_ReplaceTag::oldTag' has a wrong offset!");
static_assert(offsetof(KytController_ReplaceTag, newTag) == 0x000010, "Member 'KytController_ReplaceTag::newTag' has a wrong offset!");

// Function KytheraPlugin.KytController.RunBehavior
// 0x0020 (0x0020 - 0x0000)
struct KytController_RunBehavior final
{
public:
	class FString                                 BehaviorName;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UKytBlackboard*                         KytBlackboard;                                     // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(KytController_RunBehavior) == 0x000008, "Wrong alignment on KytController_RunBehavior");
static_assert(sizeof(KytController_RunBehavior) == 0x000020, "Wrong size on KytController_RunBehavior");
static_assert(offsetof(KytController_RunBehavior, BehaviorName) == 0x000000, "Member 'KytController_RunBehavior::BehaviorName' has a wrong offset!");
static_assert(offsetof(KytController_RunBehavior, KytBlackboard) == 0x000010, "Member 'KytController_RunBehavior::KytBlackboard' has a wrong offset!");
static_assert(offsetof(KytController_RunBehavior, ReturnValue) == 0x000018, "Member 'KytController_RunBehavior::ReturnValue' has a wrong offset!");

// Function KytheraPlugin.KytController.SetPerceptionScaleModifiers
// 0x0008 (0x0008 - 0x0000)
struct KytController_SetPerceptionScaleModifiers final
{
public:
	float                                         visualModifier;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         audioModifier;                                     // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KytController_SetPerceptionScaleModifiers) == 0x000004, "Wrong alignment on KytController_SetPerceptionScaleModifiers");
static_assert(sizeof(KytController_SetPerceptionScaleModifiers) == 0x000008, "Wrong size on KytController_SetPerceptionScaleModifiers");
static_assert(offsetof(KytController_SetPerceptionScaleModifiers, visualModifier) == 0x000000, "Member 'KytController_SetPerceptionScaleModifiers::visualModifier' has a wrong offset!");
static_assert(offsetof(KytController_SetPerceptionScaleModifiers, audioModifier) == 0x000004, "Member 'KytController_SetPerceptionScaleModifiers::audioModifier' has a wrong offset!");

// Function KytheraPlugin.KytShipController.LeadFormation
// 0x0008 (0x0008 - 0x0000)
struct KytShipController_LeadFormation final
{
public:
	class UKytFormation*                          FormationType;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KytShipController_LeadFormation) == 0x000008, "Wrong alignment on KytShipController_LeadFormation");
static_assert(sizeof(KytShipController_LeadFormation) == 0x000008, "Wrong size on KytShipController_LeadFormation");
static_assert(offsetof(KytShipController_LeadFormation, FormationType) == 0x000000, "Member 'KytShipController_LeadFormation::FormationType' has a wrong offset!");

// Function KytheraPlugin.KytShipController.MoveToActor
// 0x0010 (0x0010 - 0x0000)
struct KytShipController_MoveToActor final
{
public:
	class AActor*                                 Goal;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EndDistance;                                       // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Speed;                                             // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KytShipController_MoveToActor) == 0x000008, "Wrong alignment on KytShipController_MoveToActor");
static_assert(sizeof(KytShipController_MoveToActor) == 0x000010, "Wrong size on KytShipController_MoveToActor");
static_assert(offsetof(KytShipController_MoveToActor, Goal) == 0x000000, "Member 'KytShipController_MoveToActor::Goal' has a wrong offset!");
static_assert(offsetof(KytShipController_MoveToActor, EndDistance) == 0x000008, "Member 'KytShipController_MoveToActor::EndDistance' has a wrong offset!");
static_assert(offsetof(KytShipController_MoveToActor, Speed) == 0x00000C, "Member 'KytShipController_MoveToActor::Speed' has a wrong offset!");

// Function KytheraPlugin.KytShipController.MoveToLocation
// 0x0014 (0x0014 - 0x0000)
struct KytShipController_MoveToLocation final
{
public:
	struct FVector                                Dest;                                              // 0x0000(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EndDistance;                                       // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Speed;                                             // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KytShipController_MoveToLocation) == 0x000004, "Wrong alignment on KytShipController_MoveToLocation");
static_assert(sizeof(KytShipController_MoveToLocation) == 0x000014, "Wrong size on KytShipController_MoveToLocation");
static_assert(offsetof(KytShipController_MoveToLocation, Dest) == 0x000000, "Member 'KytShipController_MoveToLocation::Dest' has a wrong offset!");
static_assert(offsetof(KytShipController_MoveToLocation, EndDistance) == 0x00000C, "Member 'KytShipController_MoveToLocation::EndDistance' has a wrong offset!");
